[
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/13/sesame-the-startup-behind-the-viral-virtual-assistant-maya-releases-its-base-ai-model/",
        "date_extracted": "2025-03-14T13:34:57.103032",
        "title": "Sesame, the startup behind the viral virtual assistant Maya, releases its base AI model",
        "author": null,
        "publication_date": null,
        "content": "AI companySesamehas released the base model that powers Maya, theimpressively realistic voice assistant.\nThe model, which is 1 billion parameters in size (“parameters” referring to individual components of the model), is under an Apache 2.0 license, meaning it can be used commercially with few restrictions. Called CSM-1B, the model generates “RVQ audio codes” from text and audio inputs, according toSesame’s description on the AI dev platform Hugging Face.\nRVQ refers to “residual vector quantization,” a technique for encoding audio into discrete tokens called codes. RVQ is usedin a number of recent AI audio technologies, including Google’s SoundStream and Meta’s Encodec.\nCSM-1B uses a model fromMeta’s Llama familyas its backbone paired with an audio “decoder” component. A fine-tuned variant of CSM powers Maya, Sesame says.\n“The model open-sourced here is a base generation model,” Sesame writes in CSM-1B’sHugging FaceandGitHubrepositories. “It is capable of producing a variety of voices, but it has not been fine-tuned on any specific voice […] The model has some capacity for non-English languages due to data contamination in the training data, but it likely won’t do well.”\nIt’s unclear what data Sesame used to train CSM-1B. The company didn’t say.\nIt’s worth noting the model has no real safeguards to speak of. Sesame has an honor system and merely urges developers and users not to use the model to mimic a person’s voice without their consent, create misleading content like fake news, or engage in “harmful” or “malicious” activities.\nI triedthe demoon Hugging Face, and cloning my voice took less than a minute. From there, it was easy to generate speech to my heart’s desire, including on controversial topics like the election and Russian propaganda.\nConsumer Reports recently warned that many popular AI-powered voice cloning tools on the marketdon’t have “meaningful” safeguardsto prevent fraud or abuse.\nSesame, co-founded by Oculus co-creator Brendan Iribe, went viral in late February for its assistant tech, which comes close to clearing uncanny valley territory. Maya and Sesame’s other assistant, Miles, take breaths and speak with disfluencies, and can be interrupted while speaking,much like OpenAI’s Voice Mode.\nSesame has raised an undisclosed amount of capital from Andreessen Horowitz, Spark Capital, and Matrix Partners. In addition to building voice assistant tech, the company says it’s prototyping AI glasses “designed to be worn all day” that’ll be equipped with its custom models.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/13/y-combinators-police-surveillance-darling-flock-safety-raises-275m-at-7-5b-valuation/",
        "date_extracted": "2025-03-14T13:34:59.875468",
        "title": "Y Combinator’s police surveillance darling Flock Safety raises $275M at $7.5B valuation",
        "author": null,
        "publication_date": null,
        "content": "Flock Safetyand one of its long-time VCs, Bedrock Capital,announcedThursday that the startup raised a fresh $275 million at a $7.5 billion valuation.\nFlock makes computer vision-enabled video surveillance technology used by law enforcement as well as businesses, property management companies, and so on. It’s best known for itsautomatic license plate recognition tech, but Flock also makes gunshot detection tech marketed to schools, and recentlyacquired public safety drone company Aerodome.\nFlock was founded in 2017 and went through Y Combinator that same year. Growth exploded in the subsequent years. Flock crossed over $300 million in annual recurring revenue last year, which is 70% year-over-year growth, Flock spokesperson Holly Beilin told TechCrunch.\nThe Atlanta-based startup has now raised over $950 million in total funding,according to PitchBook data, and its last valuation a year ago was $4.8 billion. Return investors Andreessen Horowitz, Greenoaks, Meritech Capital, Matrix Partners, and Y Combinator participated in this round.\nGiven that it makes surveillance tech, Flock has unsurprisingly had its share of controversies. For instance, theACLU cited concerns with Flockover the kind of mass surveillance it enables and, a year ago, urged the company to allow independent review of its products. Privacy advocates in Norfolk, Virginiaare currently suingto stop Flock from being deployed there.\nFlock is also facing a wrongful termination lawsuit from a sitting mayor of a small California town,as TechCrunch recently reported.\nThat said, Flock has been a VC darling for years.\nFor instance, Bedrock’s founder, Geoff Lewis, recounted how he flew to Atlanta in 2018 to beg Flock co-founder Garrett Langley (pictured above) to take a $10 million Series A-1, one of the first checks from Lewis’ new firm. But Langley had just closed Flock’s Series A.\nThat deal was a “totally insane” $60 million valuation, asBedrock described it— about triple the valuation of the A round just a few months earlier. Langley took the money — and has gone on to take more than $164 million in investments from Bedrock since.\nBy the way, Lewis, who hailed from Founders Fund, now has other big names in Bedrock’s portfolio, like OpenAI, Rippling, andMach Industries.\nMeanwhile, a16z’s American Dynamism fund lead, David Ulevitch, led other rounds for Flock. “Beyond protecting property, Flock Safety is literally helping to save lives,” Ulevitch and a16z growth VC David Georgeopinedin 2021.\nYC’s Garry Tan took to LinkedIn justa few months agoto applaud the success rate Flock claims it has achieved in fighting crime.But it’s Flock’s revenue growth, in addition to its public safety products, that’s caused investors to “continue to double and triple down on Flock,” Beilin said.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/13/minimalist-light-phone-iii-launches-march-27/",
        "date_extracted": "2025-03-14T13:35:02.536550",
        "title": "Minimalist Light Phone III launches March 27",
        "author": null,
        "publication_date": null,
        "content": "Light, the maker of a minimalist phone designed to help consumers disconnect from smartphone distractions and social media, will launch its newest model, theLight Phone III, on March 27. This version of the device, like its older counterpart, offers a simple black-and-white display and necessary features like support for calls, texts, navigation, alarms, hotspots, a calendar, and more, including music. However, the upgraded device now ships with a3.92-inch AMOLED displayinstead of an e-paper screen.\nIt also adds a camera and NFC chip for future payment tools.\nFirstannounced last summer, the Light Phone III improves repairability, as you can now access the battery, and replace the screen and USB port.\nThe company said it also tried to improve the device’s usability and performance, making it approximately the width of most iPhones for easier use.\n“It actually will keep a lot of the characteristics that people love about the e-ink screen, [with it] feeling much different than a glossy smartphone screen,” Light co-founder Joe Hollier explained last year, when the phone was first introduced.\nAs before, customers will be able to choose whether they want to use the unlocked device as their main phone or simply as a backup for those times they want to disconnect without losing access to critical tools to navigate modern life.\nLight sells its own data plans starting at $30 per month for 1 GB of data.\nHowever, the Light Phone III’s upgrades will increase the price point a bit. Instead of $299, like the older, e-ink device, the Light Phone III will be available for $599 for a limited time.\nThe price will later increase to $799, the website indicates.\nThe Light Phone III’s full specs:\nDimensions: 106mm x 71.5mm x 12mmWeight: 124gNetwork: 5G + 4GLTEDisplay: 3.92″ AMOLED (1080×1240)Screen: Matte GlassPort: USB-C 2.0Camera: 12m default image output(50m rear sensor / 8m front sensor)SIM: Nano SIM + E-SIMMemory: 128GB / 6GB RAMBattery: 1800 mAHSound: 2 mics (noise cancellation), 2 stereo speakersFeatures: GPS, Bluetooth 5.0, NFC, Fingerprint IDMaterials: Aluminum, Glass, SORPLAS Recycled PlasticChipset: Qualcomm SM 4450IP Rating: IP 54",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2024/06/LightPhoneIII.Text_.jpg?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/13/10-startups-to-watch-from-y-combinators-w25-demo-day/",
        "date_extracted": "2025-03-14T13:35:05.317916",
        "title": "10 startups to watch from Y Combinator’s W25 Demo Day",
        "author": null,
        "publication_date": null,
        "content": "One of Silicon Valley’s most storied startup accelerators, Y Combinator, held its Winter 2025 Demo Day on Wednesday, showcasing what its latest batch of 160 startups are cooking up. Some of Silicon Valley’s most successful startups — including Stripe, Airbnb, and Reddit — started out in a YC batch.\nToday, YC’s newer startups are focused on building the next big thing in AI. In this batch, we noticed a surprising number of startups creating tools to enhance other companies’ AI agents. Rather than building their own AI agents, these startups are building support tools. There’s no shortage of companies building AI agent tools today, but these managed to stick out from the crowd.\nThere are some honorable mentions that didn’t quite make this list but still managed to catch our attention. There’s Optifye, a startup that’s building software to manage factory workers and wasembroiled in a social controversya few weeks ago. There’s also Artificial Societies, which runsAI simulations to test how well your LinkedIn posts will doin a simulated version of your network.\nYC has always accepted some eye-catching companies, but here are the startups we think are worth paying attention to in YC W25.\nWhat it does:API for agent teleoperation\nWhy it’s a fave:One of the key reasons Waymo has been successful at deploying autonomous robotaxis is because humans can remotely take over a vehicle if one ever gets stuck. Abundant took that same idea, teleoperation, and built a platform that applies it to all AI agents. Abundant says its API allows it to catch when an AI agent fails, and allows one of its human operators to step in and take over.\nWhat it does:lets AI agents navigate browsers\nWhy it’s a fave:Coincidentally,Browser Use went viral earlier this weekbecause a Chinese AI agent, Manus, used its open-source tool to click through site menus and fill out forms on browsers. Daily downloads quintupled to 28,000, one of the founders told TechCrunch. As web-browsing AI agents such as OpenAI’s Operator are taking off, Browser Use seems to be offering a compelling open source tool that enables them.\nWhat it does:replaces tedious grading work with AI\nWhy it’s a fave:Teaching assistants (TAs) are the backbone of any modern university, quietly grading papers for professors and doing other grunt work. But grading piles of repetitive papers might not be the best use of a TA’s time when they could be directly teaching students. Founded by Cornell TAs who openly declare that they “hate grading,” GradeWiz uses AI tools to automate the task so TAs can make better use of their time.\nWhat it does:Robinhood for Pokémon cards\nWhat it’s a fave:Misprint has a cool origin story — its co-founder, Eva Herget, quit her job at Goldman Sachs to sell Pokémon cards full-time, raking in $40,000 a month. Now, Herget and her co-founder have launched a platform for selling cards and other collectibles that allows users to treat them more like stocks, using a bid/ask system. It’s not a small market: $3.5 billion of secondhand Pokémon cards are sold every year, Misprint says.\nWhat it does:uses AI to find the best vibe coders\nWhy it’s a fave:AI-assisted “vibe coding” is all the rage, with a YC partner recently saying that a quarter of YC startups havecodebases that are 95% AI-generated.But AI-assisted coding isn’t just cheating: it’s a skill in and of itself. NextByte says it helps companies find the best “vibe coders” thanks to an AI model that powers interview questions testing coders’ skills at leveraging AI.\nWhat it does:AI clone for Zoom calls\nWhy it’s a fave:Who hasn’t popped into a Zoom meeting for work with a bad case of bed hair or barely concealed pajama pants? Pickle solves this by letting you “clone” an ideal version yourself and putting that much better-composed individual onto the screen, lip-syncing to your voice in real time. As a (mostly) remote team, we really hope Pickle — which says it has over 1,500 paying users so far — can pull this one off.\nWhat it does:AI agents to automate restaurant management\nWhy it’s a fave:We’ve worked enough jobs waiting tables to know that managing a restaurant is not an exact science. Managing restaurant inventory is often done in Google Sheets, and involves lots of calling and emailing with suppliers. Rebolt tries to automate some of that work with AI agents, and the company says it’s in pricing discussions with the parent company of Burger King.\nWhat it does:a Roomba for weeds on a farm\nWhy it’s a fave:Weeds kill farms, but removing those weeds is a difficult task that requires lots of human labor. Founded by a former Apple hardware lead, Red Barn Robotics claims its weeding robot, which it calls “The Field Hand,” is 15x faster than a human and a quarter of the price. The company has already signed $5 million in LOIs for the upcoming growing season.\nWhat it does:a vintage clothing marketplace curated by AI\nWhy it’s a fave:If you’ve ever shopped for vintage clothing online, you know that it can be an overwhelming experience. There are lots of options, and it’s hard to assess quality. Retrofit uses AI to sort through thousands of vintage listings and creates a marketplace based on current trends. Plus, their website looks great.\nWhat it does:autonomous patrol boats\nWhy it’s a fave:Autonomy is hot in defense tech right now, from Shield AI’s “AI fighter pilot” toSaronic’s planned autonomous warship factory.Splash builds small patrol boats that autonomously patrol sea borders. The startup says it has already cruised autonomously 200 miles in the San Francisco Bay Area and claims an impressive 800-mile range.\n\n",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/13/techcrunch-all-stage-unveils-a-powerhouse-agenda-for-founders/",
        "date_extracted": "2025-03-14T13:35:07.988843",
        "title": "TechCrunch All Stage unveils a powerhouse agenda for founders",
        "author": null,
        "publication_date": null,
        "content": "TechCrunch All Stage(formerly Early Stage) returns toBoston on July 15, and the agenda for our tentpole East Coast founder event is almost complete. We’re excited to share this sneak peek at some of the fantastic speakers and sessions we have on tap.\nFor builders who are just starting on their founder journey, ourFoundation Stageis absolutely the place to be. We’re enlisting a stellar cast of leading investors and entrepreneurs to dig deep into founder-focused topics such as:\nNew for 2025, we’re calling all growth-stage founders and startups for a full-day track dedicated to advice on how to scale your company from Series A and beyond. On theScale Stage, you can check out:\nTC All Stageis unlike any other TechCrunch event. Instead of panels and fireside chats, speakers present their areas of expertise and then answer your questions. As always, all attendees get transcripts and visual assets from the presentations, so you can take what you learn with you!\nAnd if you’re the chatty type, you’ll enjoy the roundtable discussions and our networking platform Braindate for lots of time to mingle with other founders, builders, and investors. You have loads of founder questions, and we’ll have the answers for you. More topics will be announced soon.\nSo come down and hang with us on July 15 in Boston andgrab your early-bird pass to save up to $320. We’ll see you there!\nAll the Ways You Don’t Realize VCs Are Evaluating Your Company at Pre-Seed\nWith Charles Hudson, Managing Partner and Founder,Precursor Ventures\nMVP in the Age of AI: When to Bot and When to Not\nWith Chris Gardner, Partner,Underscore.vc\nThe TAM Myth: How the Best Startups Reshape Markets\nWith Jahanvi Sardana, Partner,Index Ventures\nHow to Craft a Killer Pitch Deck\nWith Tiffany Luck, Partner,NEA\nFounders selected to take part in this session will have four minutes to wow a panel of judges, including leading VCs, who will then provide feedback.Check the event pagesoon for how to apply!\nThe Operator’s Playbook for Building and Scaling Sustainable Companies\nWith Jon McNeill, CEO and Co-Founder,DVx Ventures\nHow to Raise for Series C and Beyond\nWith Cathy Cao, Partner,Sapphire Ventures\nMore agenda announcements are on the way, but the best way to experience TC All Stage is to be there in person. Whether you’re looking for hands-on founder insights or scouting the next big investment, this is the must-attend summit for founders and VCs of all stages. Join us on July 15 at SoWa Power Station in Boston—register now and save up to $320 on select tickets!\nGo beyond attending—exhibit your brand and innovation in front of 1,200 top AI minds. Space is limited, so don’t miss your chance to make an impact!Grab your exhibit table here before they run out.\nOr, explore sponsorship opportunities and activations at TC Sessions: AI. Get in touch with our team by fillingout this form.\nSubscribe to the TechCrunch Eventsnewsletter for early access to special deals and the latest event news.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2019/09/GettyImages-849201940.jpg?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/03/Cathy_Gao_Headshot.png?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/13/5-ways-techcrunch-sessions-ai-will-fuel-your-ai-growth/",
        "date_extracted": "2025-03-14T13:35:10.635020",
        "title": "5 ways TechCrunch Sessions: AI will fuel your AI growth",
        "author": null,
        "publication_date": null,
        "content": "Less than three months until TechCrunch’s biggest AI event yet! If you’re shaping the future of AI, investing in the next game-changing innovation, or simply eager to dive deep into what’s next,TechCrunch Sessions: AIis the place to be.\nOn June 5, Zellerbach Hall at UC Berkeley will be buzzing with 1,200 AI experts, investors, and enthusiasts exchanging ideas, forging connections, and exploring the frontier of artificial intelligence.\nSecure your spot now and save up to $210before ticket prices rise. Don’t sit this one out — AI’s biggest breakthroughs and insights await!\nAt TC Sessions: AI, we’re putting the sharpest minds in AI front and center — so you can learn directly from those shaping the industry. Hear success stories, uncover strategies, and explore the next wave of AI innovation.\nSpeakers like Jae Lee (CEO,Twelve Labs), Oliver Cameron (CEO,Odyssey), Kanu Gulati (Partner,Khosla Ventures), and more will share their expertise on the main stage. Check out theTC Sessions: AI speaker pagefor the latest speakers and agenda updates.\nA few must-attend discussions include:\nThe main stage brings you game-changing insights from AI’s brightest minds, but the conversation doesn’t stop there. Take it further in the breakout sessions, where you can ask your burning questions, challenge ideas, and gain fresh perspectives from top AI experts and fellow attendees.\nDon’t just listen — engage, interact, and dive deeper. Breakouts are where real discussions happen.\nMeet your next investor, partner, or collaborator at TC Sessions: AI. Whether through 1:1 or small-group Braindate networking, or chance encounters in the Expo Hall, the opportunities to make meaningful connections are endless. Discover new talent, connect with fellow peers, and surround yourself with the right people to fuel your next big AI move.\nThe Expo Hall is your gateway to the next wave of AI. Get hands-on with the latest technologies, tools, and services that will push AI boundaries. Perfect for anyone looking to elevate their AI strategy, improve systems, or explore tech that benefits humanity, this is the ultimate hub for innovation. AI geeks, this is your chance to dive deep!\nOr, take it a step further —showcase your AI breakthroughto 1,200 AI leaders and enthusiasts by booking your exhibit table. Space is very limited, so don’t wait to reserve yours!\nBeyond the event itself, “Sessions: AI Week” (June 1 – June 7) features AI-infusedSide Eventshosted by leading companies. With mixers, workshops, and networking events, you’ll gain more connections, deeper insights, and a chance to keep the momentum going long after the main event wraps. Whether you’re attending these Side Events as an AI professional or someone eager to explore the world of AI, you’ll leave with valuable connections and newfound wisdom that can elevate your personal growth or company’s brand, plus, have fun along the way.\nTechCrunch’s biggest tech conference of the year offers countless reasons to attend, but the best way to understand its impact is to experience it firsthand. If AI is your field, your interest, or your future, then you must attend TC Sessions: AI. Don’t miss your chance tosave up to $210—register todayand immerse yourself in the cutting-edge world of AI on June 5 in Berkeley!\nGo beyond attending — exhibit your brand and innovation in front of 1,200 top AI minds. Space is limited, so don’t miss your chance to make an impact!Grab your exhibit table here before they run out.\nOr, explore more sponsorship opportunities and activations at TC Sessions: AI. Get in touch with our team by fillingout this form.\nSubscribe to the TechCrunch Eventsnewsletter for early access to special deals and the latest event news.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/TC-Sessions-Robotics-breakouts.jpg?w=680",
            "https://techcrunch.com/wp-content/uploads/2020/02/GettyImages-1047707680.jpg?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/01/Google-Exhibit-Disrupt-2025.jpg?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/13/omni-is-designing-tools-to-help-companies-make-data-driven-decisions/",
        "date_extracted": "2025-03-14T13:35:13.401535",
        "title": "Omni raises $69M to design tools that help companies better analyze their data",
        "author": null,
        "publication_date": null,
        "content": "Employees at many companies today are expected to make decisions through careful data analysis, but the tools they need to do it are clunky, slow or — in some cases — don’t exist.\nThat’s according to Colin Zima, the CEO ofOmni, a business intelligence (BI) platform that aims to help organizations simplify how they work with their data. Before co-founding Omni, Zima led the Search quality team at Google and was the chief analytics officer at Looker.\n“With cloud data warehouses like Snowflake and BigQuery, legacy reliability is merging with modern scalability,” Zima told TechCrunch. “Yet tens of thousands of businesses remain tied to outdated BI processes. Modern organizations demand the agility of self-service analytics without compromising centralized control. That gap represents a massive market opportunity — it’s why Omni was born.”\nOmni’s platform lets users run ad hoc data analyses and build charts and reports, and also provides tools to create visualizations with components such as hyperlinks, text, and images.\nIn addition to a point-and-click interface for creating data queries and dashboards, Omni offers a compatibility layer for Excel spreadsheets and formulas. It can also take raw SQL, the language used to communicate with databases, and automatically parse and restructure it into “modeled concepts” that then become accessible in Omni’s interface.\nProducts built with Omni, like dashboards, can be brought into other applications via integrations, Zima added.\n“We built Omni to embrace the diversity of things you need to do with BI,” he said. “It’s simple enough for anyone to get started quickly with exploration and dashboards, but flexible enough to handle deep customization and sophisticated data models as your needs evolve.”\nWhile there’s no shortage of BI tools on the market today, Omni has managed to grow its customer base to over 200 companies, including Perplexity, BuzzFeed, Writer, and Incident.io. Annual recurring revenue has grown to nearly $10 million, Zima said, and he expects that number to triple this year.\nInvestors are eager to get in on the action, Zima said, which led Omni to raise sooner than was “strictly necessary.” This month, the company closed a $69 million Series B round that was led by ICONIQ Growth, and saw participation from Theory Ventures, First Round Capital, Redpoint Ventures, GV, and Snowflake Ventures.\n“We’ve seen other companies raise — and burn through — hundreds of millions [of dollars] trying to brute-force growth,” Zima said. “That’s not how we operate. Building everything you need in a BI tool is expensive because we’re competing with every major BI tool from the last 40 years. Our growth has been efficient and intentional, allowing us to focus on R&D.”\nZima said the funding, which brings San Francisco-based Omni’s total raised to $97 million at a $650 million valuation, will help Omni keep the “foot on the gas” around embedded analytics and spreadsheet functionality, and allow it to “double down” on hiring across its product and go-to-market teams. Omni currently has 85 employees, and expects to end the year with 150.\n“We want to be well-funded and control our own destiny,” Zima said. “When an [exit] derails a company’s mission, product development slows, customer experience suffers, and the magic fades […] Our strategy has been to fund aggressively but spend thoughtfully, so we can stay focused on the product without worrying about runway. Our past successes have also put us in a strong position to think long-term.”",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/drafts-archived-93a74cbdc47ba52236ef13d10a58f3f8.png?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/13/bria-lands-new-funding-for-ai-models-trained-on-licensed-data/",
        "date_extracted": "2025-03-14T13:35:16.153929",
        "title": "Bria lands new funding for AI models trained on licensed data",
        "author": null,
        "publication_date": null,
        "content": "AI-powered image generators, which are at the center of a number of copyright lawsuits against AI companies, are frequently trained on massive amounts of data from public websites. Most of these companies argue thatfair use doctrineshields their data-scraping and training practices. But many copyright holders disagree.\nThat’s why some startups and firms developing image generators are trying a different tack: Training generators exclusively on licensed content. New York and Tel Aviv-basedBria, founded in 2023 by entrepreneurs Yair Adato and Assa Eldar, is one of these.\nBria pays for images from around 20 partners, including Getty Images, and uses these to train image-generating models with content guardrails. Adato, Bria’s CEO, said that the platform “programmatically” compensates image owners according to their “overall influence.”\n“Bria foundation models house one billion visuals and millions of videos,” Adato told TechCruch. “Bria has mitigated biases that can sometimes emerge in AI-generated visual content by training its models on globally representative datasets. The company’s models consistently produce visuals that reflect diversity, making them suited for various creative applications.”\nBria offers plug-ins for image editing and design apps, including Photoshop and Figma, as well as a fine-tuning API that allows customers to customize the company’s models for specific applications. Users can run Bria’s models on the company’s platform or an outside computing environment, like a public cloud. In either case, customers own the data and outputs, Adato said.\n“Enterprise customers can pay for access to source code and [models],” Adato said. “We provide over 30 specialized APIs for creating and modifying visuals, which customers access through subscription and usage-based pricing. Companies can pay to fine-tune our generative AI models with their brand assets, creating custom engines that maintain their visual identity.”\nBria’s plans are ambitious. Adato tells TechCrunch that the 40-person company seeks to foster an “IP ecosystem” where businesses can access licensed images from media conglomerates for use in commercial creations, with “built-in compliance.”\nBria also plans to expand its platform and models to support additional media types, including music, video, and text, as well as on-device applications.\n“Bria continues to thrive despite broader tech industry challenges,” Adato said. “While the sector faces headwinds from central tech company market maturation, macroeconomic pressures causing budget constraints, and oversaturation of basic AI wrapper applications, these factors strengthen Bria’s position.”\nWhile a growing number of ventures are trying to build businesses around licensed media generators, including Adobe, Spawning AI, and Shutterstock, Bria has managed to gain a foothold in the nascent market. On Thursday, the company announced that it raised $40 million in a Series B funding round led by Red Dot Capital with participation from Maor Investments, Entrée Capital, GFT Ventures, Intel Capital, and IN Venture.\nBringing Bria’s total raised to around $65 million, the majority of the new cash will be put toward product development, Adato said.\n“We are growing fast with our 40 customers, demonstrating significant annual recurring revenue growth of more than 400% last year,” Adato said. “We’re also expanding our team with additional expertise in several key areas: generative AI researchers and engineers in music and video, global sales and marketing leaders, IP and copyright experts, and generative AI consultants. We expect to double our team size by the end of the year.”",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/BRIA_LP_Ecommers_bottle2.webp?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/12/anthropic-ceo-says-spies-are-after-100m-ai-secrets-in-a-few-lines-of-code/",
        "date_extracted": "2025-03-14T13:35:18.922356",
        "title": "Anthropic CEO says spies are after $100M AI secrets in a ‘few lines of code’",
        "author": null,
        "publication_date": null,
        "content": "Anthropic’s CEO Dario Amodei is worried that spies, likely from China, are getting their hands on costly “algorithmic secrets” from the U.S.’s top AI companies — and he wants the U.S. government to step in.\nSpeaking at a Council on Foreign Relationseventon Monday, Amodei said that China is known for its “large-scale industrial espionage” and that AI companies like Anthropic are almost certainly being targeted.\n“Many of these algorithmic secrets, there are $100 million secrets that are a few lines of code,” he said. “And, you know, I’m sure that there are folks trying to steal them, and they may be succeeding.”\nMore help from the U.S. government to defend against this risk is “very important,” Amodei added, without specifying exactly what kind of help would be required.\nAnthropic declined to comment to TechCrunch on the remarks specifically but referred toAnthropic’s recommendationsto the White House’s Office of Science and Technology Policy (OSTP) earlier this month.\nIn the submission, Anthropic argues that the federal government should partner with AI industry leaders to beef up security at frontier AI labs, including by working with U.S. intelligence agencies and their allies.\nThe remarks are in keeping with Amodei’s more critical stance toward Chinese AI development. Amodei hascalled forstrong U.S. export controls on AI chips to Chinawhile saying that DeepSeek scored “the worst”on a critical bioweapons data safety test that Anthropic ran.\nAmodei’s concerns, as he laid out in his essay “Machines of Loving Grace” and elsewhere, center on China using AI for authoritarian and military purposes.\nThis kind of stance has led tocriticismfrom some in the AI community who argue the U.S. and China should collaborate more, not less, on AI, in order to avoid an arms race that results in either country building a system so powerful that humans can’t control it.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/12/food-delivery-startup-wonder-acquires-media-company-tastemade-for-90m/",
        "date_extracted": "2025-03-14T13:35:21.465146",
        "title": "Food delivery startup Wonder acquires media company Tastemade for $90M",
        "author": null,
        "publication_date": null,
        "content": "Food delivery startup Wonder isacquiring media company Tastemadefor around $90 million, according to The Wall Street Journal. Founded in 2012, Tastemade produces food, travel, and home videos and operates several free, ad-supported streaming television (FAST) channels.\nThe acquisition gives Wonder access to a content studio, production company, and advertising business. Wonder will leverage all of these assets to promote its brands to a wider audience, the company says.\nThe deal marks Wonder’s latest step toward its mission to create a mealtime “super app.”Wonder founder and CEO Marc Lore, who was previously Walmart’s head of e-commerce, wants to turn Wonder into an AI app that not only tells you what to eat but also automatically orders it for you from Wonder kitchens.\nWith this acquisition, users may soon be able to place a delivery order for a dish that they’re seeing being prepared by a chef on a Tastemade streaming channel.\nWonder’s past acquisitions includeBlue ApronandGrubhub. The startup has raised a total of $1.6 billion to date.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/12/donald-trump-jr-has-been-boosting-maga-related-startups/",
        "date_extracted": "2025-03-14T13:35:24.248679",
        "title": "Donald Trump Jr. has been boosting MAGA-related startups",
        "author": null,
        "publication_date": null,
        "content": "Since Donald Trump Jr. joined VC firm 1789 Capital after his father won the election, he’s been busy monetizing the Make America Great Again (MAGA) ecosystem.\nHe’s been making bets in media, pharmaceutical, guns, and crypto while pushing against environmental, social, and governance (ESG) and diversity, equity, and inclusion (DEI),the Financial Timesreported.\nThe VC firm was co-founded by Trump donor Omeed Malik (who is alsoa backer of Substack) and has support from Rebekah Mercer, a backer of the conservative news site Breitbart. Conservative influencer Charlie Kirk, right-wing radio personality Clay Travis, and investor Marc Andreessen were also early backers of 1789,according to Bloomberg.\nThe 1789 team, situated less than two miles from Mar-a-Lago, is immersed in Trump world. So far, the firm led the $15 million seed round for Tucker Carlson’s new media company; has poured more than $50 million into Elon Musk’s companies xAI and SpaceX; invested in a beverage company founded by right-wing YouTubers the Nelk Boys, and backed the prediction site Polymarket, according to Bloomberg.\nThe firm is reportedly looking for companies to acquire, under the expectation that President Trump will relax some financial regulatory rules, a source told Bloomberg.\nOverall, 1789 raised $500 million alone after Inauguration Day and is hoping to raise at least $1 billion for its first fund by the middle of this year, especially from endowments and pensions in Republican states.\nElsewhere, according to Bloomberg and the Financial Times, Trump Jr. is on the board of three publicly traded companies, including a drone manufacturer, a conservative marketplace, and a fintech. He’s on the board of BlinkRX, a 1789 portfolio company that does drug deliveries. He’s an adviser to the firearm retailer GrabAGun, which Malik said he and Trump Jr. were looking to take public this year. He’s an adviser to another prediction market company, Kalshi, and alongside his brother Eric, he is an investor in the biotech company Dominari Holdings.\nHe’s also, of course, the sole trustee of Trump Media & Technology Group, the parent company of Truth Social.\nMany were surprised that Trump Jr. decided to go deeper into the startup and investment world after his father became president again, Bloomberg reported, but the move has since become another indication of the deepening economic and social ties between the power players in Silicon Valley and on Capitol Hill.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/12/tech-layoffs-2025-list/",
        "date_extracted": "2025-03-14T13:35:26.910411",
        "title": "A comprehensive list of 2025 tech layoffs",
        "author": null,
        "publication_date": null,
        "content": "The tech layoff wave is still kicking in 2025. Last year sawmore than 150,000 job cutsacross 549 companies, according to independent layoffs trackerLayoffs.fyi. So far this year, more than 22,000 workers have been the victim of reductions across the tech industry, with a staggering 16,084 cuts taking place in February alone.\nWe’re tracking layoffs in the tech industry in 2025 so you can see the trajectory of the cutbacks and understand the impact on innovation across all types of companies. As businesses continue to embrace AI and automation, this tracker serves as a reminder of the human impact of layoffs — and what could be at stake with increased innovation.\nBelow you’ll find a comprehensive list of all the known tech layoffs that have occurred in 2025, which will be updated regularly. If you have a tip on a layoff, contact ushere. If you prefer to remain anonymous, you can contact ushere.\nWill cut 22 jobs, affecting nearlya quarter of its total workforce,following the announcement of the AI startup’s strategicpartnership with Microsoft.\nAnnounced it will beshutting down several of its officesin accordance with Elon Musk’s DOGE, including its Office of Technology, Policy, and Strategy and the DEI branch in the Office of Diversity and Equal Opportunity.\nHas reportedly laid off some staff, according toLinkedIn posts from ex-employees.The company has not confirmed the layoffs, and it is currently unknown how many workers were affected.\nAnnounced plans tolet go of 340 employeesin its technology division as part of a new restructuring effort.\nWill cut2,500 employees,or 5% of its total staff, in response to its shares sliding 19% in the first fiscal quarter.\nWill cutup to 300 workers in Dublin,accounting for roughly 10% of the company’s workforce in Ireland.\nAnnounced it willlay off 65 employees,affecting 5% of its total workforce.\nIs reportedly set to lay offover 1,000 employees and contractorsin a cost-cutting effort. It’s the second round of cuts for the company in just five months.\nReduced itstotal headcount by 16%as the gaming startup shifts its focus to be “scrappier” and “more efficient.”\nWasshut downjust three years after it was acquired by Flipkart. It is currently unknown how manny employees were affected.\nWill cutup to 2,000 jobsas part of its “Future Now” restructuring plan that hopes to save the company $300 million before the end of its fiscal year.\nAnnounced500 job cutsafter it wassold to Wonder Group for $650 million.The number of cuts affected more than 20% of its previous workforce.\nAnnounced plansto lay off 1,350 employees,affecting 9% of its total workforce, in an attempt to reshape its GTM model. The company is alsomaking reductions in its facilities,though it does not plan to close any offices.\nIs planning to cut employees in itsPeople Operations and cloud organizations teamsin a new reorganization effort. The company is offering a voluntary exit program to U.S.-based People Operations employees.\nReduced its headcountby 25 employees,accounting for 16% of its total workforce. The company is planning to release a commercial version of its proteome analysis platform in 2026.\nWill reportedlycut a few dozen employees in Israel,potentially affecting 10% of its 250-person workforce in the country.\nCut1,100 jobs in a reorganizing effortthat affected its tech workers. The coffee chain will now outsource some tech work to third-party employees.\nLaid offdozens of employeesover the last few weeks, including around 10% of staff in one day, after failing to meet its sales growth targets. The “headless commerce” platformraised money at a $1.9 billion valuationjust a few years ago.\nWill cutroughly 5% of its current workforcein a new efficiency drive to increase profitability and growth.\nLaid off more employeesin a new effort to cut costs, though the total number is unknown. Last year, the travel giantcut about 1,500 rolesin its Product & Technology division.\nHasceased operationsand has laid off its employees after selling its business and technology to Israeli cybersecurity company Tufin. The cuts affect roughly 300 people.\nIsshutting down its operationsamid “ongoing challenges in healthcare.” It’s unclear the number of employees affected. In 2023, the women’s healthcare startupraised $18 millionto fund its expansion.\nCut51 jobs in its San Francisco headquarters,according to state filings with the Employment Development Department. The SaaS startup previously reduced its headcount by 8% in 2023.\nHascut 120 employees,impacting 44% of its total staff. It’s the Y Combinator-backed Nigerian startup’s second layoff round in just five months.\nReportedlylaid off dozens of employeesas part of a new cost-cutting effort that aims to ensure “long-term success” in the startup’s mission to curb misinformation online.\nWill lay off about 10% of its workforce, affectingmore than 1,000 employees.According to an email to staff obtained by CNN, the cuts will largely have an impact on positions in engineering and program management.\nAnnounced in an SEC filing that it willcut around 450 positionsbetween February and July 2025, with a complete restructuring set to be completed in the fall, following its new partnership with Zillow.\nIs laying off6% of its total workforce,the cybersecurity firm confirmed to TechCrunch. The cuts come less than two weeks after Sophos acquired Secureworks for $859 million.\nWill cutnearly 200 employeesas it introduces redundancy measures and closes down its operations in Poland and Kenya.\nReportedlyconducted another round of layoffs.It’s unknown how many employees were affected.\nCut nearly 200 employees, CEO Mike Seckler announcedin a note to employees, citing “potential adverse events” like a recession or rising interest rates.\nCut 120 jobs, affecting roughlyone-third of its total workforce,TechCrunch exclusively learned. The move comes just a year after the Dutch startupcut 90 employeesfollowing its rebrand.\nLaid offabout 500 employees,affecting 15% of its workforce, citing poor business performance. The new cuts follow twoearlierlayoff roundsfor the company that affected roughly 200 employees.\nReportedly let go ofapproximately 200 employees,according to The Verge. The company previouslycut 100 employeesas part of a layoff round in August 2024.\nLaid off1,750 employees,as originally reported by Bloomberg and confirmed independently by TechCrunch. The cuts affect roughly 8.5% of the enterprise HR platform’s total head count.\nLaid off 180 employees,the company confirmed to TechCrunch.The cuts come just over one year after the access and identity management giantlet go of 400 workers.\nIs laying off50% of its workforce, including CEO Marc Whitten and several other top executives, as it prepares to shut down operations. What remains of the autonomous vehicle company will move under General Motors.\nIs reportedly eliminatingmore than 1,000 jobs.The cuts come as the giant is actively recruiting and hiring workers to sell new AI products.\nHas shut down operations, CEO Paul Kesserwaniannounced on LinkedIn.The fintech startup’s post-money valuationin 2022 was $82.4 million,according to PitchBook.\nLaid off150 employees based in the U.S., affecting roughly 18% of its total workforce, in an effort to reach profitability.\nLaid offdozens of workers in its communications departmentin order to help the company “move faster, increase ownership, strengthen our culture, and bring teams closer to customers.”\nIslaying off 300 people,according to a leaked memo reported by Business Insider. However, according to the memo, the fintech giant is planning to grow its total headcount by 17%.\nLaid off15 employeesas the augmented writing startup undergoes a restructuring effort.\nIscutting 75 employeesin an effort to “ensure the long-term sustainability and success” of the company. The audio company last cut 200 writers in July 2024 months afterpartnering with ElevenLabs.\nIs planning tocut 58 employeesin response to an “ongoing macroeconomic challenges and continued uncertainty in the solar industry.”\nAnnounced in an internal memo that it willcut 5% of its stafftargeting “low performers” as the company prepares for “an intense year.”As of its latest quarterly report,Meta currently has more than 72,000 employees.\nWill cut up to 730 jobs,impacting 3% of its total workforce,as it plans to exit operations in Germany and focus on physical retailers.\nIs shutting down its operations,impacting 63 employees.The delivery startup said employees will be paid through January 15 without severance.\nIslaying off 114 employeesas part of a team realignment, per a new WARN notice filing, focusing its efforts on a robotic printing system.\nEliminated 37 jobs, impacting roughly 10% of its total workforce, even as the companypursues “aggressive” hiring.\nIs cuttingdozens of employeesacross its global markets as part of a strategic reorganization to increase profitability.\nPlans to lay off400 employees globally.It’s the company’s fourth layoff roundsince January 2024as the solar industry as a whole faces a downturn.\nThe fintech startup, founded in 2018,abruptly shut down earlier this year.Per an email from CEO Paul Aaron, the closure follows anunsuccessful attempt to find a buyer, thoughEmployer.com has a new offer under considerationto acquire the company post-shutdown.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/12/sakana-claims-its-ai-paper-passed-peer-review-but-its-a-bit-more-nuanced-than-that/",
        "date_extracted": "2025-03-14T13:35:29.488297",
        "title": "Sakana claims its AI-generated paper passed peer review — but it’s a bit more nuanced than that",
        "author": null,
        "publication_date": null,
        "content": "Japanese AI startupSakanasaid that its AI generated one of the first peer-reviewed scientific publications. But while the claim isn’t necessarily untrue, there are caveats to note.\nThedebate swirling around AI and its role in the scientific processgrows fiercer by the day. Many researchers don’t think AI is quite ready to serve as a “co-scientist,” while others think that there’s potential — but acknowledge it’s early days.\nSakana falls into the latter camp.\nThe company said that it used an AI system called The AI Scientist-v2 to generate a paper that Sakana then submitted to a workshop at ICLR, a long-running and reputable AI conference. Sakana claims that the workshop’s organizers, as well as ICLR’s leadership, had agreed to work with the company to conduct an experiment to double-blind review AI-generated manuscripts.\nSakana said it collaborated with researchers at the University of British Columbia and the University of Oxford to submit three AI-generated papers to the aforementioned workshop for peer review. The AI Scientist-v2 generated the papers “end-to-end,” Sakana claims, including the scientific hypotheses, experiments and experimental code, data analyses, visualizations, text, and titles.\n“We generated research ideas by providing the workshop abstract and description to the AI,” Robert Lange, a research scientist and founding member at Sakana, told TechCrunch via email. “This ensured that the generated papers were on topic and suitable submissions.”\nOne paper out of the three was accepted to the ICLR workshop — a paper that casts a critical lens on training techniques for AI models. Sakana said it immediately withdrew the paper before it could be published in the interest of transparency and respect for ICLR conventions.\n“The accepted paper both introduces a new, promising method for training neural networks and shows that there are remaining empirical challenges,” Lange said. “It provides an interesting data point to spark further scientific investigation.”\nBut the achievement isn’t as impressive as it might seem at first glance.\nIn the blog post, Sakana admits that its AI occasionally made “embarrassing” citation errors, for example incorrectly attributing a method to a 2016 paper instead of the original 1997 work.\nSakana’s paper also didn’t undergo as much scrutiny as some other peer-reviewed publications. Because the company withdrew it after the initial peer review, the paper didn’t receive an additional “meta-review,” during which the workshop organizers could have in theory rejected it.\nThen there’s the fact that acceptance rates for conference workshops tend to be higher than acceptance rates for the main “conference track” — a fact Sakana candidly mentions in its blog post. The company said that none of its AI-generated studies passed its internal bar for ICLR conference track publication.\nMatthew Guzdial, an AI researcher and assistant professor at the University of Alberta, called Sakana’s results “a bit misleading.”\n“The Sakana folks selected the papers from some number of generated ones, meaning they were using human judgment in terms of picking outputs they thought might get in,” he said via email. “What I think this shows is that humans plus AI can be effective, not that AI alone can create scientific progress.”\nMike Cook, a research fellow at King’s College London specializing in AI, questioned the rigor of the peer reviewers and workshop.\n“New workshops, like this one, are often reviewed by more junior researchers,” he told TechCrunch. “It’s also worth noting that this workshop is about negative results and difficulties — which is great, I’ve run a similar workshop before — but it’s arguably easier to get an AI to write about a failure convincingly.”\nCook added that he wasn’t surprised an AI can pass peer review, considering that AI excels at writing human-sounding prose. PartlyAI-generatedpaperspassing journal review isn’t even new, Cook pointed out, nor are the ethical dilemmas this poses for the sciences.\nAI’s technical shortcomings — such as its tendency tohallucinate— make many scientists wary of endorsing it for serious work. Moreover, experts fear AI could simplyend up generating noisein the scientific literature, not elevating progress.\n“We need to ask ourselves whether [Sakana’s] result is about how good AI is at designing and conducting experiments, or whether it’s about how good it is at selling ideas to humans — which we know AI is great at already,” Cook said. “There’s a difference between passing peer review and contributing knowledge to a field.”\nSakana, to its credit, makes no claim that its AI can produce groundbreaking — or even especially novel — scientific work. Rather, the goal of the experiment was to “study the quality of AI-generated research,” the company said, and to highlight the urgent need for “norms regarding AI-generated science.”\n“[T]here are difficult questions about whether [AI-generated] science should be judged on its own merits first to avoid bias against it,” the company wrote. “Going forward, we will continue to exchange opinions with the research community on the state of this technology to ensure that it does not develop into a situation in the future where its sole purpose is to pass peer review, thereby substantially undermining the meaning of the scientific peer review process.”",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/paper_abstract.png?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/12/why-onyx-thinks-its-open-source-solution-will-win-enterprise-search/",
        "date_extracted": "2025-03-14T13:35:32.221451",
        "title": "Why Onyx thinks its open source solution will win enterprise search",
        "author": null,
        "publication_date": null,
        "content": "Enterprises have troves of internal data and information that employees need to complete their tasks or answer questions for potential customers. But that doesn’t mean the right information is easy to find.\nOnyxwants to solve that problem through its internal enterprise search tool. There are other big names in the category, likeGlean— which has raised $600 million in venture funding — fighting for market share in the hot category, but San Francisco-based Onyx has a differentiator that helps separate it from the pack, it says. It’s open source.\nCompanies can get Onyx running in about 30 minutes, and it connects to more than 40 internal company data sources, including Salesforce, GitHub, and Google Drive. Enterprise users can then pay for additional tiers of features like increased sign-in security and increased encryption.\nChris Weaver, co-founder and co-CEO of Onyx, told TechCrunch that he and his co-founder and co-CEO Yuhong Sun originally set out to fix a problem both he and Sun were seeing in their respective engineering roles.\n“We knew where things were roughly, but it was still kind of hard, [and] new people just couldn’t find anything,” Weaver said. “It felt like there had to be a better way to do this.”\nOnyx isn’t Weaver and Sun’s first attempt at building a company. Their first idea, a live stats tracking app for Twitch streamers, was going well until Twitch killed embedded streams and rendered the product essentially unusable. Their second effort, a site to help people compare speciality keyboards, didn’t work either.\nBut with Sun’s machine learning background and the overall advancements in AI technology, Onyx — originally called Danswer, a portmanteau for deep answer — was different. They released the original open source project in 2023 and received strong momentum and feedback right away.\n“Ramp was actually one of the early teams that found us,” Sun said. “At the time, we didn’t have any way for them to pay us or anything. We didn’t have anything like support plans or whatever, and there were no paid features. For us, it was like, people really want to pay for our project. I mean, it’s free, but people want to pay for it. So, you know, maybe there’s a chance to make a business from this.”\nToday the company works with dozens of enterprises, including Netflix, Ramp, and Thales Group. Sun and Weaver largely credit the company’s success to their decision to open source the software. It has allowed companies to experiment and also avoid a lengthy enterprise sales cycle.\n“Open source is really the only way for this type of solution to scale out and get the momentum into every single business in the world,” said Weaver.\nWhile confident that open source is the winning strategy for internal search, the team is entering a competitive field. Beyond startups like Glean, they face competition from companies building their own internal solutions, like the fintech Klarna, which has built aninternal search and chatbot tool, Kiki.\nOnyx isn’t deterred. Starting an internal search tool from scratch is really hard, Weaver said, and he thinks of Onyx as a foundational tool for companies that want to build their own internal search products. He said the proof is in the numbers.\n“We’ve seen the usage grow explosively,” Sun said. “We hit a peak of over 160,000 messages in a single week. We are really hoping to lean into that organic growth and hopefully all the teams in the world will use Onyx one day.”\nThe company also recently attracted a $10 million seed round co-led by Khosla Ventures and First Round Capital, with participation from Y Combinator and angel investors. Among them are Gokul Rajaram, former board member at Coinbase and Pinterest; Arash Ferdowsi, a co-founder of Dropbox; and Amit Agarwal, the former chief product officer of Datadog.\nOnyx plans to use the funds to hire staff and develop more premium features.\n",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/12/project-europe-a-new-early-stage-fund-will-back-under-25s-with-200k-to-build-the-next-tech-titan/",
        "date_extracted": "2025-03-14T13:35:34.997109",
        "title": "Project Europe, a new early-stage fund, will back people under 25 to build the next tech titan",
        "author": null,
        "publication_date": null,
        "content": "A recurring theme in Europe’s tech world is that the region needs its own Google or Microsoft. Now comes the launch of a new fund to support this initiative.\nProject Europe— a new fund for founders “solving hard problems with technical solutions” — says it has initially pulled together $10 million from 128 different founders and tech execs from startups both in Europe and further afield. The list, which you canview here, includes the founders of Klarna, Mistral, and SoundCloud; successful recipients will each get €200,000 (around $200,000) to build out their ideas.\nThe companies need to be started in Europe, but there are no restrictions around moving them later. Founders also do not have to have fully formed startups to apply. You can apply with an idea or if you “have been tinkering around a thesis,” the fund notes on its site.\nThere is one other caveat. If you are over 25 years old, stop reading now. Project Europe is limiting its awards to people who are only 25 and under.\nOne of the investors in the round explained the age-specific requirement as a way of “supporting the next generation of founders.” This focus on young founders is reminiscent of theThiel Fellowship, which hands out $100,000 to college dropouts in the U.S. However, there’s no dropout clause in Project Europe’s case.\nThere has been extensive discussion about how Europe has failed to seize the opportunity to build a mega tech business comparable to Meta, Apple, or Google over the past few decades. In many ways, it’s a classic chicken-and-egg issue.\nSome have pinpointed thelack of growth-stage fundingas a major bottleneck that drives founders to move to the U.S., or to sell up when the opportunity comes along.\nOthers say the problem ties to risk appetite. Ian Hogarth, the founder-turned-VC who has been one of the more outspoken people on the topic, has written about how the most promising companies are moving orselling too early. In other words, we’ll never know whether a lack of growth funding would have actually proven to be a bottleneck. (Hogarth is not among the list of people backing Project Europe.)\nIt’s most likely a combination of reasons why Europe has yet to produce a trillion-dollar technology company on the order of the hyperscalers that have come out of the U.S. and Asia. And it’s debatable that seed funding is a significant gating factor among those.\nProject Europe says the initial investment will give it 6.66% of equity in the new idea/business if it’s leading the investment and less if not.\nIn addition to the money, cohorts receive 1:1 mentorship from one of the nine partners in the fund — which include Victor Riparbelli from Synthesia, Mati Staniszewski from ElevenLabs, and Rina Onur Sirinoglu from Spyke Games (who is the only female partner).\nOther perks include access to the 119 others in the fund for advice. Harry Stebbings, the podcaster-turned-investor at 20VC who has built a business out of growth hacking andmicro-investing, is one of the creators of Project Europe. He is offering access to his media empire as part of the deal, too.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/12/battery-manufacturer-northvolt-nears-the-end-as-it-files-for-bankruptcy-in-sweden/",
        "date_extracted": "2025-03-14T13:35:37.662838",
        "title": "Battery manufacturer Northvolt nears the end as it files for bankruptcy in Sweden",
        "author": null,
        "publication_date": null,
        "content": "Northvolt filed for bankruptcy in Sweden on Wednesday, the latest blow to Europe’s attempts to create a battery manufacturing juggernaut that could rival the Chinese giants.\nThough the Swedish startup has raised more than $14 billion, it has been running short on cash recently. Northvoltfiled for Chapter 11 bankruptcyin the U.S. in November. Since then, it’s been racing to conserve cash and raise new funds in an effort to stave off insolvency.\nThose efforts have fallen short.\n“Northvolt has experienced a series of compounding challenges in recent months that eroded its financial position, including rising capital costs, geopolitical instability, subsequent supply chain disruptions, and shifts in market demand,” the company said in astatement.\nEuropean countries and automakers had pinned their hopes on Northvolt, which represented a bold bet on EU battery manufacturing. Most battery factories today are built and run by Chinese, Japanese, or Korean companies.\nThe ailing manufacturer had secureda $5 billion debt dealin January 2024, but it was struggling to bring in revenue as it burned through a reported $100 million per month.\nNorthvolt’s fortunes took a more decisive turn when BMW canceled a $2 billion contract in June 2024. The battery manufacturer had been unable to deliver on time.\nTo conserve cash, it laid off 1,600 employees and sold the assets of its Cuberg division, a Bay Area solid-state battery startup it acquired in 2021.\nNorthvolt had been seeking additional financing from lenders, but it was unable to reach an agreement with them. That impasse, coupled with previous failures, wasn’t enough to extend the company’s runway far enough to master its manufacturing woes and build a solid customer base.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/12/how-la-fourche-an-online-organic-supermarket-is-thriving-after-q-commerces-bust/",
        "date_extracted": "2025-03-14T13:35:40.428375",
        "title": "How La Fourche, an online organic supermarket, is thriving after q-commerce’s bust",
        "author": null,
        "publication_date": null,
        "content": "La Fourcheis just seven years old but it has been quite a rollercoaster for the French startup. During this time, the online grocery retailer has gone through a global pandemic, followed by the rise of venture-backed quick-commerce startups that promised grocery deliveries in less than 15 minutes, followed by the implosion of that vertical.\nWhen you talk with La Fourche’s co-founder and CEO Nathan Labat, he doesn’t spend too much time dwelling on Flink, Getir, Gopuff, Gorillas and all the q-commerce startups that swarmed over Europe around 2021. That’s because La Fourche’s business model could be considered the perfect opposite of all that. Although the startup is alsoVC-backed, it has taken a different path.\nMost of La Fourche’s inventory consists of healthy and organic products with a long shelf life. Think olive oil, diapers, cereals, shampoo, and coffee beans.\n“I break it down into three buying patterns. You have one buying pattern, which is the quick refill — ‘what am I going to eat tonight?’ — it leads to very low average order values: €20 to €30,” Labat explained.\n“Then, you have a weekly pattern, where you plan more, you go and buy fruit and vegetables, fresh produce, etc.,” he went on. “Then you have the stock up opportunity, which is really about filling up your cupboards for a month, a month and a half.\n“These are three very distinct patterns. And we’re really clearly identified as a stock-up company.”\nThe company only offers a handful of options for each product category so that it has broad coverage of its users’ needs without overwhelming them with choice. It also offers its own brand products.\nIn a way, La Fourche has been trying to differentiate its offering from what you can get from traditional supermarket chains and their delivery services.\n“There’s a lack of consumer confidence,” Labat argued — calling out “the overwhelming catalog with awful stuff, everything you already know as a consumer, which led to the rise ofYuka”, a food health quality app.\nWith La Fourche, customers pay a yearly membership fee to sign up — it currently costs around €60 per year ($65.50 at current exchange rates). After that, customers don’t pay a delivery fee for orders above a certain threshold.\nOn this front, Labat names Costco andThrive Marketas inspirations. (But Amazon Prime is perhaps the most familiar user of the delivery membership model.) Subscriptions create brand loyalty, increase retention rates and could even improve the average order value.\nInstead of shelling out for a subscription to get diapers, another to get fresh coffee beans, and another one for personal care products, customers can get all these products from La Fourche.\n“Subscription models have become increasingly common,” Labat noted. “You get the impression that on food, it’s interesting because you can offer something like ‘one subscription to rule them all.’”\nLa Fourche’s metrics tend to back those assumptions. The company currently has 120,000 members. On average, they order around €120 worth of products once per month or every 45 days.\nOverall, La Fourche says it’s on track to generate €100 million in gross merchandise volume in 2025.\nThe startup’s unit economics are improving as well. “We went from -15% in EBITDA margin to -9% last year, and we’re on track for -2% this year,” he said, adding: “We aim to achieve our first profitable quarter by the end of 2025.”\nPart of the reason La Fourche’s business model seems to work is that it scales well. The company doesn’t have to increase marketing spending as it grows because most of La Fourche’s customers come from referrals. The startup says it spends around 5% of its revenue on marketing.\nThe other big reason is that La Fourche only has one warehouse that covers the entire country. It is nowan automated warehouse— built usingAutoStore’s technology. “We have a relatively asset-light model with a high recurrence rate,” Labat summed up.\nAs an added benefit, 46% of La Fourche’s customers reside in the countryside. This isn’t a startup that only serves customers living in big cities, as they already have plenty of options for grocery shopping.\nUp next, La Fourche wants to grow its customer base in Germany — where it recently launched its online organic supermarket, under the brand nameAckerherz. And if it can demonstrate the model is replicable across different countries there will likely be further geographic expansions down the road.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/La-Fourche-Nathan-Labat.jpg"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/12/wolf-games-backed-by-law-order-creator-uses-ai-to-create-murder-mystery-games/",
        "date_extracted": "2025-03-14T13:35:43.215341",
        "title": "Wolf Games, backed by ‘Law & Order’ creator, uses AI to create murder mystery games",
        "author": null,
        "publication_date": null,
        "content": "Elliot Wolf, the executive producer and son of “Law & Order” creator Dick Wolf, is entering a new venture aimed at engaging true crime fans.\nHe, along with co-founders Andrew Adashek (CEO) and Noah Rosenberg (CTO), are developingWolf Games, a new startup that leverages AI to generate daily murder mystery games. The company also announced on Wednesday its $4 million seed funding round.\nWolf Games’ flagship title is called Public Eye and capitalizes on the growing interest among true crime enthusiasts who often love to play detective.\nPublic Eye is set in a dystopian future where crime rates have skyrocketed to the point where law enforcement thinks asking the public for assistance is a smart idea. Players gather clues, piece together evidence, and enlist the help of an AI assistant, which guides them through investigations and offers hints to help solve the crime.\nHowever, creating new murder mysteries for players to solve on a daily basis is a tall order. To tackle this, Wolf Games leverages an AI engine that helps the team of writers whip up new cases.\nThe AI draws inspiration from headlines published by major news sources such as CBS and NBC. Similar to “Law & Order,” one of the longest-running true crime dramas in TV history, the company says that the stories in the game are primarily fictional and are inspired by these headlines rather than copied directly.\nIn addition to story creation, AI is also used to generate interview clips and photos of crime scenes.\n“In a single click, we take this linear story and make it fully interactive and playable,” Wolf told TechCrunch, adding that top AI models like Gemini are used to ensure character consistency throughout the story.\n“If a character gets a scar on their face halfway through the story, every time that character appears, they’ll have the scar,” Wolf explained.\nWe tested the game ourselves, where we attempted to solve the murder of a store owner. The suspects included a sketchy intern, a drunken boyfriend, and a fed-up daughter. For a story mostly generated by AI, it was surprisingly OK and even had an unexpected twist at the end. (It’s worth noting that it’s hard to go wrong with a true crime story, considering the abundance of real-life events that can inspire dramatic storylines.)\nThe true crime genre of games is highly competitive, but the founders think they have the expertise to garner a significant audience.\nThe caliber of the investors also tells a compelling story. The pre-seed round included participation from Dick Wolf, Beats co-founder Jimmy Iovine, and United Talent Agency Chairman Paul Wachter.\nPublic Eye launches on the web this summer. It’ll be free to play with optional in-app purchases; you’ll need tojoin a waitlistif you want to give it a shot.\nIn the future, Wolf Games is considering working with IP holders to adapt TV shows into new games.\nIt’s notable that Hollywood executives continue to launch AI startups, especially considering the2023strikeswhere the use of AI was a contentious issue. The Oscar-winning film “The Brutalist” is the latest example of a production that faced backlash from viewers for its use of an AI voice tool.\nHowever, despite the industry grappling with the implications of AI, a growing number of celebrities — such asAshton Kutcherandwill.i.am— are investing in AI ventures, indicating a desire to harness this technology for entertainment.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/New-Suspect-e1741731554247.png?w=314"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/12/scimplify-raises-40m-to-help-manufacturers-access-specialty-chemicals/",
        "date_extracted": "2025-03-14T13:35:45.869240",
        "title": "Scimplify raises $40M to help manufacturers access specialty chemicals",
        "author": null,
        "publication_date": null,
        "content": "Scimplify, an Indian startup that helps pharmaceutical and agricultural companies access a range of specialty chemicals, has raised $40 million in a new funding round co-led by Accel and Bertelsmann India Investments to widen its footprint in the U.S. and reach new markets.\nThe Series B round pegs Scimplify’s valuation at about $150 million post-money, the company said.\nSpecialty chemicals are vital for manufacturing in many industries, but access is still a problem, as manufacturers of these chemicals are scattered across the world. Companies have mostly relied on Chinese suppliers to source such chemicals, but geopolitical tensions are increasingly pushing manufacturers to look for alternatives in other regions. Moreover, customers often find it hard to find a specific chemical if they are looking for a particular reactor, chemistry, or compliance such as U.S. FDA or GMP.\nScimplify aims to connect manufacturers with specialty chemical makers using its platform, ATOMS, which lists specialty chemicals from more than 5,000 factories run by over 200 manufacturers across 10 countries, including India, China, Vietnam, Egypt, and Japan. The startup primarily targets pharmaceuticals, agriculture, and industry.\nThe startup vets manufacturers, gets them audited by third-parties semi-annually, and segregates them based on their geography, chemistry, capacity, and compliance. It also process-engineers existing chemicals to make them cost-effective and relevant for different use cases.\nScimplify has so far served 600 customers across more than 16 countries worldwide, co-founder Sachin Santhosh told TechCrunch.\nUnlike other marketplaces, Santhosh said, Scimplify also offers made-to-order chemicals by working with chemical producers, and lets customers easily switch from one recipe to another using its manufacturer network.\nBefore Scimplify, Santhosh worked at the B2B startups Bizongo and OffBusiness, both of which helped streamline procurement and supply chain processes for businesses. His co-founders, Salil Srivastava and Dheeraj Dhingra, both previously worked at manufacturing supply chain company Zetwerk.\nThe startup plans to use the fresh cash to scale its presence geographically, cater to new industry segments, and enhance R&D. Scimplify has subsidiaries in Dubai and Indonesia, and is looking to set up offices in the U.S. and Japan. It has a team of 150 people.\nIt’s now considering acquiring one or two chemical factories to unlock new kinds of customers and regulated markets, Santhosh told TechCrunch.\nThe Series B also saw participation from UMI and existing investors Beenext, Omnivore, and 3one4 Capital. The company has raised funding of $54 million so far since its inception in 2023.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/scimplify-atoms.jpg"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/12/elea-ai-is-chasing-the-healthcare-productivity-opportunity-by-targeting-pathology-labs-legacy-systems/",
        "date_extracted": "2025-03-14T13:35:48.631054",
        "title": "Elea AI is chasing the healthcare productivity opportunity by targeting pathology labs’ legacy systems",
        "author": null,
        "publication_date": null,
        "content": "VC funding into AI tools for healthcare wasprojected to hit $11 billion last year— a headline figure that speaks to the widespread conviction that artificial intelligence will prove transformative in a critical sector.\nMany startups applying AI in healthcare are seeking to drive efficiencies by automating some of the administration that orbits and enables patient care. Hamburg-basedEleabroadly fits this mold, but it’s starting with a relatively overlooked and underserved niche — pathology labs, whose work entails analyzing patient samples for disease — from where it believes it’ll be able to scale the voice-based, AI agent-powered workflow system it’s developed to boost labs’ productivity to achieve global impact. Including by transplanting its workflow-focused approach to accelerating the output of other healthcare departments, too.\nElea’s initial AI tool is designed to overhaul how clinicians and other lab staff work. It’s a complete replacement for legacy information systems and other set ways of working (such as using Microsoft Office for typing reports) — shifting the workflow to an “AI operating system” which deploys speech-to-text transcription and other forms of automation to “substantially” shrink the time it takes them to output a diagnosis.\nAfter around half a year operating with its first users, Elea says its system has been able to cut the time it takes the lab to produce around half their reports down to just two days.\nThe step-by-step, often manual workflow of pathology labs means there’s good scope to boost productivity by applying AI, says Elea’s CEO and co-founder Dr. Christoph Schröder. “We basically turn this all around — and all of the steps are much more automated … [Doctors] speak to Elea, the MTAs [medical technical assistants] speak to Elea, tell them what they see, what they want to do with it,” he explains.\n“Elea is the agent, performs all the tasks in the system and prints things — prepares the slides, for example, the staining and all those things — so that [tasks] go much, much quicker, much, much smoother.”\n“It doesn’t really augment anything, it replaces the entire infrastructure,” he adds of the cloud-based software they want to replace the lab’s legacy systems and their more siloed ways of working, using discrete apps to carry out different tasks. The idea for the AI OS is to be able to orchestrate everything.\nThe startup is building on variouslarge language models(LLMs) through fine-tuning with specialist information and data to enable core capabilities in the pathology lab context. The platform bakes in speech-to-text to transcribe staff voice notes — and also “text-to-structure”; meaning the system can turn these transcribed voice notes into active direction that powers the AI agent’s actions, which can include sending instructions to lab kits to keep the workflow ticking along.\nElea also plans to develop its own foundational model for slide image analysis, per Schröder, as it pushes toward developing diagnostic capabilities, too. But for now, it’s focused on scaling its initial offering.\nThe startup’s pitch to labs suggests that what could take them two to three weeks using conventional processes can be achieved in a matter of hours or days as the integrated system is able to stack up and compound productivity gains by supplanting things like the tedious back-and-forth that can surround manual typing up of reports, where human error and other workflow quirks can inject a lot of friction.\nThe system can be accessed by lab staff through an iPad app, Mac app, or web app — offering a variety of touch-points to suit the different types of users.\nThe business was founded in early 2024 and launched with its first lab in October having spent some time in stealth working on their idea in 2023, per Schröder, who has a background in applying AI for autonomous driving projects at Bosch, Luminar, and Mercedes.\nAnother co-founder, Dr. Sebastian Casu — the startup’s CMO — brings a clinical background, having spent more than a decade working in intensive care, anesthesiology, and across emergency departments, as well as previously being a medical director for a large hospital chain.\nSo far, Elea has inked a partnership with a major German hospital group (it’s not disclosing which one as yet) that it says processes some 70,000 cases annually. So the system has hundreds of users so far.\nMore customers are slated to launch “soon” — and Schröder also says it’s looking at international expansion, with a particular eye on entering the U.S. market.\nThe startup is disclosing for the first time a €4 million seed it raised last year — led by Fly Ventures and Giant Ventures — that’s been used to build out its engineering team and get the product into the hands of the first labs.\nThis figure is a pretty small sum versus the aforementioned billions in funding that are now flying around the space annually. But Schröder argues AI startups don’t need armies of engineers and hundreds of millions to succeed — it’s more a case of applying the resources you have smartly, he suggests. And in this healthcare context, that means taking a department-focused approach and maturing the target use case before moving on to the next application area.\nStill, at the same time, he confirms the team will be looking to raise a (larger) Series A round — likely this summer — saying Elea will be shifting gears into actively marketing to get more labs buying in, rather than relying on the word-of-mouth approach they started with.\nDiscussing their approach versus the competitive landscape for AI solutions in healthcare, he tells us: “I think the big difference is it’s a spot solution versus vertically integrated.”\n“A lot of the tools that you see are add-ons on top of existing systems [such as EHR systems] … It’s something that [users] need to do on top of another tool, another UI, something else that people that don’t really want to work with digital hardware have to do, and so it’s difficult, and it definitely limits the potential,” he goes on.\n“What we built instead is we actually integrated it deeply into our own laboratory information system — or we call it pathology operating system — which ultimately means that the user doesn’t even have to use a different UI, doesn’t have to use a different tool. And it just speaks with Elea, says what it sees, says what it wants to do, and says what Elea is supposed to do in the system.”\n“You also don’t need gazillions of engineers anymore — you need a dozen, two dozen really, really good ones,” he also argues. “We have two dozen engineers, roughly, on the team … and they can get done amazing things.”\n“The fastest growing companies that you see these days, they don’t have hundreds of engineers — they have one, two dozen experts, and those guys can build amazing things. And that’s the philosophy that we have as well, and that’s why we don’t really need to raise — at least initially — hundreds of millions,” he adds.\n“It is definitely a paradigm shift … in how you build companies.”\nChoosing to start with pathology labs was a strategic choice for Elea as not only is the addressable market worth multiple billions of dollars, per Schröder, but he couches the pathology space as “extremely global” — with global lab companies and suppliers amping up scalability for its software as a service play — especially compared to the more fragmented situation around supplying hospitals.\n“For us, it’s super interesting because you can build one application and actually scale already with that — from Germany to the U.K., the U.S.,” he suggests. “Everyone is thinking the same, acting the same, having the same workflow. And if you solve it in German, the great thing with the current LLMs, then you solve it also in English [and other languages like Spanish] … So it opens up a lot of different opportunities.”\nHe also lauds pathology labs as “one of the fastest growing areas in medicine” — pointing out that developments in medical science, such as the rise in molecular pathology and DNA sequencing, are creating demand for more types of analysis, and for a greater frequency of analyses. All of which means more work for labs — and more pressure on labs to be more productive.\nOnce Elea has matured the lab use case, he says they may look to move into areas where AI is more typically being applied in healthcare — such as supporting hospital doctors to capture patient interactions — but any other applications they develop would also have a tight focus on workflow.\n“What we want to bring is this workflow mindset, where everything is treated like a workflow task, and at the end, there is a report — and that report needs to be sent out,” he says — adding that in a hospital context they wouldn’t want to get into diagnostics but would “really focus on operationalizing the workflow.”\nImage processing is another area Elea is interested in other future healthcare applications — such as speeding up data analysis for radiology.\nWhat about accuracy? Healthcare is a very sensitive use case so any errors in these AI transcriptions — say, related to a biopsy that’s checking for cancerous tissue — could lead to serious consequences if there’s a mismatch between what a human doctor says and what Elea hears and reports back to other decision makers in the patient care chain.\nCurrently, Schröder says they’re evaluating accuracy by looking at things like how many characters users change in reports the AI serves up. At present, he says there are between 5% to 10% of cases where some manual interactions are made to these automated reports which might indicate an error. (Though he also suggests doctors may need to make changes for other reasons — but say they are working to “drive down” the percentage where manual interventions happen.)\nUltimately, he argues, the buck stops with the doctors and other staff who are asked to review and approve the AI outputs — suggesting Elea’s workflow is not really any different from the legacy processes that it’s been designed to supplant (where, for example, a doctor’s voice note would be typed up by a human and such transcriptions could also contain errors — whereas now “it’s just that the initial creation is done by Elea AI, not by a typist”).\nAutomation can lead to a higher throughput volume, though, which could be pressure on such checks as human staff have to deal with potentially a lot more data and reports to review than they used to.\nOn this, Schröder agrees there could be risks. But he says they have built in a “safety net” feature where the AI can try to spot potential issues — using prompts to encourage the doctor to look again. “We call it a second pair of eyes,” he notes, adding: “Where we evaluate previous findings reports with what [the doctor] said right now and give him comments and suggestions.”\nPatient confidentiality may be another concern attached to agentic AI that relies on cloud-based processing (as Elea does), rather than data remaining on-premise and under the lab’s control. On this, Schröder claims the startup has solved for “data privacy” concerns by separating patient identities from diagnostic outputs — so it’s basically relying on pseudonymization for data protection compliance.\n“It’s always anonymous along the way — every step just does one thing — and we combine the data on the device where the doctor sees them,” he says. “So we have basically pseudo IDs that we use in all of our processing steps — that are temporary, that are deleted afterward — but for the time when the doctor looks at the patient, they are being combined on the device for him.”\n“We work with servers in Europe, ensure that everything is data privacy compliant,” he also tells us. “Our lead customer is a publicly owned hospital chain — called critical infrastructure in Germany. We needed to ensure that, from a data privacy point of view, everything is secure. And they have given us the thumbs up.”\n“Ultimately, we probably overachieved what needs to be done. But it’s, you know, always better to be on the safe side — especially if you handle medical data.”",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/11/bolt-ceo-ryan-breslow-explains-his-troubled-30m-personal-loan-announces-new-super-app/",
        "date_extracted": "2025-03-14T13:35:51.277857",
        "title": "Bolt CEO Ryan Breslow explains his troubled $30M personal loan, announces new ‘super app’",
        "author": null,
        "publication_date": null,
        "content": "Bolt’s controversial co-founder Ryan Breslow, whoreturned as CEO earlier this month, spoke on Monday about the $30 million personal loan he took out of his company that sparked legal battles and contributed to his (temporary) ouster.\nBreslow also announced that Bolt will launch an “everything app” that will integrate one-click checkouts for everything from crypto to financial services “very soon.”\nThe legal battle over the loan began in 2023, when Bolt investor Activant sued Breslow. Activantclaimed Breslow saddled the startup with $30 million in debtby borrowing that amount and then defaulting, with company funds used to pay it back.\nThe case waseventually settled, with Bolt agreeing to repurchase Activant’s shares for $37 million last year.\nSpeaking atFintech Meetupin Las Vegas yesterday, Breslow defended the loan, framing it as an act of loyalty to Bolt rather than the self-dealing the Activant lawsuit alleged it was.\nHe said he opted for the loan instead of selling his stock in a secondaries transaction and that the loan was unanimously approved by Bolt’s board.\n“It was done to be pro-Bolt,” Breslow said. “I took it out instead of selling any meaningful secondaries. I wanted to show all of our investors that I’m keeping all my chips in, I believe so much in the stock that I’m not selling my shares.”\nBreslow said he thought he had plenty of time to pay back the loan and was waiting for Bolt to IPO to do so. He said that after he left the CEO role, the board called in the loan, which he viewed as “a bit of an attack.”\nBreslow, the outspoken founder of Bolt, stepped down as CEO in early 2022. In the years between then and his return this year, he has also faced allegations thathe misled investorsand violated security laws byinflating metricswhile fundraising the last time he ran the company.\nOn Monday, Breslow admitted he made “a ton of mistakes” — but said they were not the ones he was accused of. He viewed his main mistake as allowing people to join Bolt’s cap table that he “did not know very well” (without specifying who).\nNow that he’s back as CEO, he says Bolt will soon be launching a new “super app” that will integrate Bolt’s one-click checkout e-commerce experience across a wide array of services.\n“Instead of one-click checkout, we’re going to have one-click everything: financial services, peer-to-peer, crypto, cards, financial products, all in one app,” he said.\nBreslow compared Bolt to U.K. fintech Revolut, whichwas valued at $45 billion last year, claiming Bolt has 80 million “wallets” compared to Revolut’s 45 million, although he admitted Bolt has not “monetized our consumers yet.”\nIndeed, Bolt’s ARR stood at about $28 million with $7 million in gross profit as of the end of March 2024, tech publication Newcomer reportedlast year. That’s small compared to Revolut,which announced$2.2 billion in revenue and $545 million in profits (before tax) for 2023 alone.\nThe big question remaining about Bolt is the status of its next fundraise. In August, news broke about a pending $450 million fundraise deal. But it raised questions over its unusual use of$250 million in “marketing credits”and lack of confirmation froman investor mistakenly identifiedas its lead.\nSome of Bolt’s investors, including BlackRock and Hedosophia, sued to block the round, Forbesreported, but that has been voluntarily dismissed by all parties, Boltannouncedtoday.\nBreslow noted during his speech that “all” the legal cases against him are “fully settled, dismissed” but didn’t provide an update on the $450 million fundraise.\nHe did comment, though, that he’s been “humbled” by his experience and has found a newfound determination to run Bolt after his faith and himself — and his startup — was challenged.\n“You know, I obviously make mistakes but I’ve got a very big chip on my shoulder,” he said. “I’m ready to take Bolt to really new heights.”\nBlackRock and Hedosophia didn’t respond to a request for comment.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/11/mark-cuban-says-ai-is-never-the-answer-its-a-tool/",
        "date_extracted": "2025-03-14T13:35:53.878743",
        "title": "Mark Cuban says AI is ‘never the answer,’ it’s a ‘tool’",
        "author": null,
        "publication_date": null,
        "content": "Speaking at the SXSW conference in Austin, tech investor and entrepreneur Mark Cuban shared his thoughts on how AI technology can help small businesses outperform their competition. In short, he told the crowd that AI was not the answer, in and of itself; it’s meant to serve as an aid that can help entrepreneurs by making it easier to get started growing their businesses and answering questions along the way.\nCuban suggested that today’s entrepreneurs should spend “every waking minute learning about AI” because of its potential.\n“There’s so much changing that rapidly,” he said, adding that it’s different for established businesses integrating AI compared with new businesses just getting off the ground.\n“It’s so much easier to start,” Cuban explained. “It went from — way, way back in the day — $5,000 for a PC … to if you just have a laptop and a connection to the internet, you can start anything. Now, you have a mentor, whether you use Perplexity, Anthropic Claude, ChatGPT, Gemini — it doesn’t matter. You have experts.”\nWhile he admitted that there were some problems with AIs that make mistakes and hallucinate, he noted that human mentors and experts “don’t always get it right, either.”\nDespite the issues, the AI “experts” can help you understand what you don’t know, and can aid in other areas of running a business, like research, emails, and sales calls.\nHowever, Cuban cautioned the crowd not to overly rely on AI. “AI is never the answer. AI is the tool. Whatever skills you have, you can use AI to amplify them,” he said.\nThis is particularly true in creative fields, where AI is moving into areas like art and writing.\n“A lot of creative people think, well, AI is gonna write all the scripts,” Cuban said. “AI doesn’t know a good story from a bad story. You need to be creative. AI can do the video — trust me, I can create AI-generated videos. They’re still gonna suck.”\n“Whatever skills you have, AI can amplify them. But not using it means somebody else is going to be amplifying their skills — and that could be the difference between getting ahead of you or not,” Cuban said.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/11/the-sibling-founders-of-stax-payments-are-back-with-a-new-fintech-and-a-20m-seed-raise/",
        "date_extracted": "2025-03-14T13:35:57.508242",
        "title": "The sibling founders of Stax Payments are back with a $20M seed raise for their new fintech, Worth",
        "author": null,
        "publication_date": null,
        "content": "Worth, a company focused on helping fintechs, banks, and enterprises underwrite small and medium-sized businesses more easily, has raised $20 million in a seed funding round, the startup tells TechCrunch exclusively.\nIt’s a large seed round, especially these days when capital is harder to come by. But the founders’ history may have something to do with that. Sal Rehmetullah and Suneera Madhani, who are siblings, also founded another fintech company, Stax Payments. Theyexited that startupafter nearly 10 years when it was valued at north of $1.1 billion, said Madhani, after growing it to over $140 million in recurring revenue and raising $245 million in funding. (Stax still operates but the pair haven’t been part of the business in over two years.)\nNow they’re aiming to take their learnings from that experience to grow Orlando, Florida-basedWorth, which they say is providing “frictionless” onboarding and underwriting for SMBs applying for credit-based products, loans, or financing.\n“Today, as a consumer you can apply for an Apple Card on your phone and use it minutes later at a coffee shop. It’s instant and seamless. But if you’re a small business applying for the same credit card, financing, merchant services, or a new bank account? That is a different story,” Madhani said.\nAnd when a small business applies for financing, credit cards, loans, any financial service or onboarding to enterprises, they often have to complete a cumbersome application process, upload several documents, and wait several days — and in some cases, weeks — for a response, she added.\nWorthsays its technology “fixes” these issues, meaning that SMBs instead face less paperwork, less application abandonment, fewer delays, and faster approvals when applying for credit cards or loans. It claims that it helps entities “quickly and easily” prefill, onboard, and underwrite small businesses with just three fields: their name, address, and tax ID.\nIt does this by pre-filling an application with necessary data and automating all the checks a financial institution needs to do, said Rehmetullah. Those checks include Know Your Business (KYB), Know Your Customer (KYC), ownership identity verification, fraud verification, bank account verification, and financial statement analysis in real time. And, Worth says it is able to perform those checks on SMBs and business owners across the globe, not just in the United States.\nWorth, which launched its product a year ago, has used artificial intelligence and a strategic relationship with Equifax to build a proprietary set of data on more than 242 million global SMBs by analyzing large volumes of data from bank accounts, tax returns, QuickBooks, Stripe, and other sources. By continuously updating it, it’s able to provide financial institutions, credit unions, payment processers, and fintechs with real-time data, said lead investor Neil Kapur, partner of TTV Capital, which led the startup’s equity raise.\n“We have the full 360 financial data of a small business, which has been nonexistent,” Rehmetullah said.\nWhile the founders won’t disclose hard revenue figures to date, they told TechCrunch that the startup’s ARR is in the “seven figures,” and that its growth is “exceeding the triple digits,” including adding 12 customers in the fourth quarter of 2024 alone.\nWorth currently has over 25 clients, including Aurora Payments, REPAY Holdings, Fairwinds, and PatientFi, among others.\nThe company makes money by charging a platform fee for access to pre-filling capabilities, instant verification services, a case management database, ongoing predictive monitoring, and AI-based features. It also charges a per-entity verification usage fee.\nLooking ahead, Worth plans to launch a “Worth Score,” or business credit score, to SMBs directly in early 2026 in an effort to help them better understand their financial health.\nPresently, Worth has more than 50 full-time employees.\nTTV Capital led the equity raise, which also included participation from Ingeborg, Florida Funders, Deep Work Capital, and Florida Opportunity Fund. Worth also secured $5 million in debt funding from Silicon Valley Bank.\nWorth plans to use its new capital primarily to scale its organization, particularly across sales and marketing.\nTTV’s Kapur believes that Worth is increasing operational efficiency for customers in an automated way, “which provides immediate and quantifiably measurable ROI.” His firm also believes that Worth’s founding team “is uniquely qualified” to solve the challenges of onboarding and underwriting for financial institutions.\n“TTV is investing in the founders as much as the idea itself,” he told TechCrunch.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/11/meet-the-new-vc-firm-secretly-backed-by-volkswagen/",
        "date_extracted": "2025-03-14T13:36:00.179469",
        "title": "Meet the new VC firm secretly backed by Volkswagen",
        "author": null,
        "publication_date": null,
        "content": "A new venture firm calledLeitmotifhas been on a quiet blitz for the last 16 months, funding around 20 startups broadly focused on decarbonization. Its portfolio includes EV companies, space and battery plays, and four nuclear fusion startups. But the firm has only said its funding is from “European industrial interests.”\nNow, Leitmotif has told TechCrunch where the money came from: the Volkswagen Group.\nThe German automotive giant has committed $300 million to Leitmotif’s first fund and is its sole limited partner; Leitmotif has deployed roughly one third of that so far. During a conference on Tuesday, Volkswagen Group’s CEO Oliver Blume said Leitmotif’s investments could help lower the automaker’s carbon footprint and develop a “circular economy inside and outside” the company.\n“Volkswagen culture is team culture,” he said.\nLeitmotif wants to go even further, according to the young firm’s managing partners Matt Trevithick and Jens Wiese. They hope to spin up successive funds that draw in more European industrial interest beyond Volkswagen.\nIt’s an ambitious effort. Securing funding for hardware startups, especially ones with a serious manufacturing component, has been tough the last few years. But Trevithick believes it’s the right time to try to invest in these kinds of companies.\n“Technology has always been a driver of human progress, and I think the United States is about to supercharge that,” he told TechCrunch. “I think the next several years are about to produce a number of technical capabilities in the United States that the rest of the world will marvel at.”\nLeitmotif is also building a transatlantic fund while the geopolitical environment is being strained by the Trump administration.\nDespite that turmoil, Wiese — who was the head of Volkswagen Group’s M&A, Investment Advisory, and Partnerships division before starting Leitmotif — said the overarching goal of the new firm is to “create a bridge between the European industrial establishment and the U.S. innovation ecosystem.”\nTrevithick and Wiese said Volkswagen had a top priority when it agreed to invest in the fund: make money.\n“First and foremost, this is about setting up a successful venture firm,” Wiese said.\nWhile Volkswagen Group rakes in hundreds of billions of dollars per year in revenue, Wiese said making money is still important in part because it’s “how the industry keeps score.”\nAfter that, the VC firm said it plans to invest in “category-defining companies within our fields of interest,” according to Wiese, and also identify “new pockets of innovation” that could benefit the Volkswagen Group.\nWiese said he expects roughly one quarter of Leitmotif’s portfolio over time to interact with Volkswagen and its myriad brands.\nEV truck startup Harbinger is one example. Leitmotif co-led Harbinger’s $100 millionSeries B in January, and Wiese said the startup has had discussions about collaborating with Volkswagen’s trucking division.\nGeographically, Leitmotif’s investment strategy is structured so that roughly 70% of its capital will be deployed in the U.S., with the other 30% being invested in the EU. The firm will maintain offices in both Palo Alto and in Munich.\nTrevithick said 70% of Leitmotif’s global investments in this first fund will be made in startups that are “solving today’s known problems” and exist in “billion-dollar-plus markets with customers ready to buy the innovation.”\nThe other 30% of the fund will be focused on what he called “revolutionary innovation” that will create “billion-dollar-markets in the 2030s and beyond.”\nSo far, this strategy has led to investments in battery recycling company Redwood Materials, reusable rocket company Stoke Space, and even circular polyester startup Syre. Leitmotif has publicly backed 13 startups to date, though there are more in its portfolio that have not been announced.\nLeitmotif will eventually have other funds; Trevithick and Wiese said they’re particularly eyeing robotics and AI next. Volkswagen will have the right to invest in those if it chooses, but Leitmotif is independent and, for now, focused on finishing out its first fund.\nLate 2023 was arguably the worst time for startups in recent memory to lock down large funding rounds, especially ones focused on hardware or “deep tech,” thanks to high interest rates.\nTrevithick said that made it a great time to start Leitmotif.\n“It’s in down markets when the strong companies separate from the weak. In a bubble, everyone gets funded,” he said.\nThat fundraising slowdown caused other firms to take fewer risks outside the startups they were already invested in, Trevithick said.\n“There were less new dollars available to fund good companies that were there, because everyone got myopic about their own portfolio,” he said. “I think that’s why we got a lot of inbound interest to participate in rounds that, in the bubble time, maybe we wouldn’t have had access to.”\nThat interest came in large part thanks to Wiese and Trevithick’s backgrounds.\nWiese spent nearly eight years at Volkswagen Group, where he ran mergers, acquisitions, and investments for the German automaker. During this stint at Volkswagen, Wiese developed what he called “quite a deep network into the venture community, both in Europe and in the U.S.” That included forging a relationship with battery maker QuantumScape, where Wiese was a board member until 2024.\nTrevithick, meanwhile, was a partner at Venrock for a decade. There, he focused on making investments in green energy during the original clean tech boom in the early 2010s, with his highest-profile bet being an early one on battery maker Atieva — the company that eventually became Lucid Motors.\nInvesting, advising, and guiding companies through the subsequent clean tech bust was valuable experience for navigating the uncertainty currently plaguing the industry, Trevithick said.\nWhile many corporate “net zero” goals are being either hedged or abandoned outright, Trevithick said the clean tech industry is “starting in a much better position this time around.”\nPlus, Trevithick said he believes the unpredictability will present more opportunity for firms like Leitmotif — and the startups it backs.\n“I think we can all agree it’s just going to be a highly volatile environment. Which should disproportionately favor entrepreneurs, startups, and venture capitalists,” he said.\n“We feel very confident about our portfolio,” Wiese added. “Yes, [decarbonization] is our overarching theme. At the same time, we invest in companies where we are convinced they have the business case to succeed regardless of what, let’s say, the theme of the day is.”\nThis story has been updated with comments from Volkswagen Group CEO Oliver Blume.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/11/learn-what-vcs-want-to-see-from-founders-at-techcrunch-sessions-ai/",
        "date_extracted": "2025-03-14T13:36:02.833203",
        "title": "Learn what VCs want to see from founders at TechCrunch Sessions: AI",
        "author": null,
        "publication_date": null,
        "content": "It’s no secret that AI has eaten the lion’s share of funding over the past couple of years, with investments into the sectorsurging 62%to $110 billion in 2024 alone, while startup funding overall declined 12%.\nStartups may think that just adding “AI” to their company’s name might help them secure that funding. But as the frenzy around foundation models has given way to a focus onreal-world applications,AI agents, and long-term profitability, investors are seeking startups that can turn technical ingenuity into sustained traction.\nAtTechCrunch Sessions: AI, happening on June 5 in Zellerbach Hall at UC Berkeley, top VCs Zeya Yang (IVP), Jill Chase (CapitalG), and Kanu Gulati (Khosla Ventures) will break down exactly what they look for at each stage of investment, from seed rounds to Series C. And they’ve got the investment history and on-the-ground expertise to back it up.\nZeya Yanghas invested in winners such as Grammarly and Figma and has a track record of working directly with founders to refine product-market fit and drive growth.\nJill Chaseleads CapitalG’s investments in Magic, /dev/agents, Motif, and Abridge, and has spent the last several years focusing on emerging use cases for AI and ML, data infrastructure, and enterprise technology.\nKanu Gulatihas backed AI leaders PolyAI, Kognitos, and Moonhub and brings over 10 years of experience as a research scientist at Intel and Cadence and as an early engineer at Heavy.ai, Spyglass, and Nascentric.\nBuy your tickets now to lean in on the conversation atTC Sessions: AIon June 5 in Zellerbach Hall at UC Berkeley to get an inside look at what VCs really want to see in AI startups. Take advantage of Early Bird deals now to save up to $210 —register here.\nIs your company interested in sponsoring or exhibiting at TechCrunch Sessions: AI? Contact our sponsorship sales team byfilling out this form.\nSign up for the TechCrunch Events newsletterand be the first to grab special promotions.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/02/Jill-Chase-headshot-1080x1080-1.png?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/02/Kanu-Gulati-khosla-ventures_Headshot_1080x1080.png?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/11/general-fusion-fires-up-its-newest-steampunk-fusion-reactor/",
        "date_extracted": "2025-03-14T13:36:05.627971",
        "title": "General Fusion fires up its newest steampunk fusion reactor",
        "author": null,
        "publication_date": null,
        "content": "General Fusionannounced on Tuesday that it had successfully created plasma, a superheated fourth state of matter required for fusion, inside a prototype reactor. The milestone marks the beginning of a 93-week quest to prove that the outfit’s steampunk approach to fusion power remains a viable contender.\nThe reactor, called Lawson Machine 26 (LM26), isGeneral Fusion’s latest iteration in a string of devices that have tested various parts of its unique approach. The company assembled LM26 in just 16 months, and it hopes to hit “breakeven” sometime in 2026.\nGeneral Fusion is one of the oldestfusion companiesstill operating. Founded in 2002, it has raised $440 million to date, according to PitchBook. Over that time, it has seen competitors rise and fall, and, like the fusion industry writ large, it has failed to meet breakeven promises, including one madeover 20 years ago.\nIn fusion power, there are two points at which a reaction is said to breakeven. The one most people think of is called commercial breakeven. That’s when a fusion reaction produces more power than the entire facility consumes, allowing the power plant to put electricity on the grid. No one has reached this milestone yet.\nThe other is known as scientific breakeven. In this case, the fusion reaction needs to produce at least as much power as was delivered directly to the fuel. Scientific breakeven only looks within the boundaries of the experimental system, ignoring the rest of the facility. Still, it’s an important milestone for any fusion attempt. So far, only the U.S. Department of Energy’s National Ignition Facilityhas reached it.\nGeneral Fusion’s approach to fusion power differs significantly from other startups. Called magnetized target fusion (MTF), it’s similar in some regards to inertial confinement, the technique the National Ignition Facility used inlate 2022to prove that fusion reactions could generate more power than was required to start them.\nBut where the National Ignition Facility uses lasers to compress a fuel pellet, General Fusion’s MTF reactor design relies on steam-driven pistons. Inside the chamber, deuterium-tritium fuel is zapped with a bit of electricity to generate a magnetic field, which helps keep the plasma contained. The pistons then drive a liquid lithium wall inward on the plasma, compressing it.\nAs the fuel is compressed, its temperature rises until it sparks a fusion reaction. The reaction then heats the liquid lithium, which the company plans to circulate through a heat exchanger to create steam and spin a generator.\nMTF emergedin the 1970sfrom the U.S. Naval Research Laboratory, where researchers were developing concepts for compact fusion reactors. Those efforts didn’t bear fruit. General Fusion says that’s because the pistons compressing the liquid liner weren’t controlled precisely enough, and that modern computers now provide a better chance at executing the complex choreography.\nWhatever LM26 accomplishes, General Fusion still has more work to do. The device doesn’t have the liquid lithium wall, instead relying on solid lithium compressed by electromagnets. That limits the number of test runs the company can take since it takes longer to reset the device. The company hasmade progresson a prototype of the liquid wall, performing over 1,000 tests to see how it holds up over time, but integrating everything will still be a monumental engineering challenge.\nFlipping the switch on LM26 is nonetheless a significant step for a company that is now racing to deliver a power plant alongside a host of newcomers with their owndeep pocketbooksand aggressive timelines.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/11/zolve-a-neobank-for-global-citizens-moving-to-the-us-raises-51m-and-secures-200m-debt/",
        "date_extracted": "2025-03-14T13:36:08.368323",
        "title": "Zolve, a neobank for global citizens moving to the US, raises $51M and secures $200M debt",
        "author": null,
        "publication_date": null,
        "content": "Zolve, a neobank that helps provide financial access to high-skilled and high-spending global citizens moving to the U.S., has raised $251 million in a new (equity and debt mix) funding round as the startup aims to expand its presence and enter new geographies.\nEvery year, millions of highly skilled people move to countries like the U.S. for new opportunities. However, one major challenge they face is gaining access to financial services, even once they begin earning good salaries. Banks often deny them credit cards and loans due to the lack of a credit history in their new country — despite a good credit history in their home country. This becomes especially difficult when these people want to purchase assets like a new home to live in, or a car to commute daily.\nZolve aims toaddress this with its neobank, which helps newcomers access credit and banking on the day they enter the U.S. without requiring credit history. The startup currently targets global citizens entering the U.S., offering them credit cards and checking accounts using their home credit data.\n“Financial institutions in one country don’t talk to financial institutions in another country because sufficiently low-risk individuals end up being treated as high-risk. That’s the problem we are trying to solve,” said Raghunandan G, founder and CEO of Zolve, in an interview.\nSince its launch in 2021, Zolve has amassed 750,000 customers, processing over $1.2 billion in transactions to date. The startup also generated $25 million in net revenue last year, the founder told TechCrunch.\nNow, Zolve aims to increase these numbers by introducing loans, starting with auto loans and gradually expanding to personal and education loans.\nThe founder said that car dealers in the U.S. demand a 40% upfront payment and provide an interest rate of around 19-21% to expats as they do not have a credit history — the same dealers can offer cars to a local American for a 10% upfront payment and a credit with a 6-7% interest rate. Zolve can address this parity by accessing people’s credit history from their home country and underwriting risk.\nThe startup also plans to enter Canada by July or August of this year and step into the U.K. and Australia next year.\nZolve has raised $51 million in equity for its Series B round, led by Creaegis, with participation from HSBC, SBI, GMO, and DG Daiwa to support its expansion.Existing investorsAccel, Lightspeed Venture Partners, Sparta Group, and DST Global also participated. Additionally, the round involved a debt of $200 million to buy expats’ books from its partner banks to underwrite risks.\nThe startup ultimately aims to serve not only global users relocating to the U.S. and Canada but also individuals in the West moving between countries or shifting to Asia and other regions by building a connected financial network, the founder said.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/11/some-say-passkeys-are-clunky-this-startup-wants-to-change-that/",
        "date_extracted": "2025-03-14T13:36:10.998346",
        "title": "Some say passkeys are clunky — this startup wants to change that",
        "author": null,
        "publication_date": null,
        "content": "Passwords areubiquitous, despite not being foolproof and cannot alone protect your online identity. Almostone-third of data breachesreported over the past decade happened due to stolen credentials, per Verizon, including some ofthe biggest breachesof all time.\nInstead, the industry has largely foundpasskeysarguably the most prominent solution to replace passwords.More than 15 billion accounts onlinecan use passkeys, and big tech companies —Amazon,Apple,Google, andMicrosoft, and others — areworking togetherto promote passkey adoption.\nBut users are still shying away from passkeys due to their lack of portability and a general state of clunkiness.\nCybersecurity startupHawcxaims to fix some of the headaches with passkeys by using its new passwordless authentication technology, which takes the best of passkeys but without their limitations.\nUsers can find setting up passkeys on their accounts cumbersome and challenging when logging in using passkeys across multiple devices, asnotedby Dan Goodin at Ars Technica. While passkeys undoubtedly offer better security over passwords, account lock-outs and recoveries can become a costly affair for businesses that use passkeys at scale.\nFounded in 2023 by Riya Shanmugam, who spent almost two decades at Adobe, Google, and New Relic; along with chief technology officer Selva Kumaraswamy and chief scientist Ravi Ramaraju, Hawcx says it offers a platform-agnostic solution that allows developers to add five lines of code to enable its passwordless tech.\nHawcx said its solution doesn’t rely on transmitting or storing private keys from devices, like passkeys. Instead, Shanmugam told TechCrunch that Hawcx cryptographically generates private keys every time the user signs in.\nBecause the generated private keys are not stored on users’ devices, Hawcx says its technology works on older devices that don’t have the modern chips to support the typical passkey setup.\n“We are not reinventing the wheel fundamentally in most of the processes we have built,” Shanmugam told TechCrunch.\nIn one example, if a user switches from one device to another, Hawcx’s solution asks if they want the new device to be registered on their account and verify the user’s authenticity to let them in.\nHowever, in this case, the solution will not create another private key that will be stored on the new device or in a cloud service — unlike a typical passkey setup in which a new private key is either generated and stored on the new hardware, validated using the older device, or synced via a cloud service.\n“No one is challenging beyond the foundation,” Shanmugam said while referring to the competition in the digital identity management space. “What we are challenging is the foundation itself. We are not building on top of what passkeys as a protocol provides. We are saying this protocol comes with an insane amount of limitations for users, enterprises, and developers, and we can make it better.”\nHawcx has filed patents, but has not seen its technology deployed by companies or validated by third parties, which could hamper trust in its service.\nNonetheless, Hawcx has raised $3 million in a pre-seed round led by Engineering Capital, along with participation from Boldcap, to speed up its product development and get to the market.\nShanmugam told TechCrunch that the startup is in discussions with large banks and gaming companies to start its pilots in the next few weeks, which will run between three to six months with a limited set of users. The startup also plans to get the tech validated with a “couple of cryptography experts” at Stanford University.\n“As we are rolling out passkeys, the adoption is low. It’s clear to me that as good as passkeys are and they have solved the security problem, the usability problem still remains,” Tushar Phondge, director of consumer identity at ADP, told TechCrunch.\nPhondge is bullish on Hawcx’s tech and is set to deploy it at ADP for a pilot to test if it addresses the issues passkeys bring along, including device dependencies and core system lockups.\nUltimately, Shanmugam said Hawcx aims to be a unified authentication platform for businesses over time and partner with different players to integrate services such as document verification, live video verification, and even background checks.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/hawcx-co-founders.jpg"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/11/reshape-energy-is-using-an-acquisition-playbook-to-drive-energy-upgrades-for-commercial-real-estate/",
        "date_extracted": "2025-03-14T13:36:13.800747",
        "title": "Reshape Energy is using an acquisition playbook to drive energy upgrades for commercial real estate",
        "author": null,
        "publication_date": null,
        "content": "Reshape Energyis betting on a more integrated approach to accelerate the decarbonization of the built environment. Founded in Munich, Germany, back in May 2024, the startup is led by a team with expertise scaling energy businesses, including the German division of Octopus energy and energy price comparison platform Verivox. It’s focusing on selling energy system upgrades to commercial real estate, targeting property owners with portfolios of buildings.\nCarbon emissions from heating buildings significantly contribute to climate change. Therefore, accelerating the transition to lower-carbon forms of heat management, such as heat pumps and solar panels, is a key piece of meeting climate goals. Hence why, in Europe, there’s considerable regulatory pressure being applied to building owners to carry out energy upgrades.\nAt the same time, accessing the specialist skills required to pull off these energy upgrade projects — or even just understand what needs to be done to optimize a particular building — can slow momentum for installing low-carbon solutions.\nReshape Energy is hoping a one-stop-shop model will help to vent some of the friction out of the system — starting in the German market but with its eye on expanding elsewhere in Europe as it scales the approach.\n“Why isn’t enough happening?” was a key question the founders kicked around as they were thinking how to structure a business targeting commercial buildings with energy upgrades, co-founder and CFO Benjamin Stanzl tells TechCrunch.\n“We’ve seen a lot of momentum on [energy upgrades for] single family homes … But when you look at commercial real estate, which is really our focus, it’s very, very slow,” he says. “The biggest [competitive] threat is definitely the ‘do nothing’ option.”\nThe reasons why the sector has been so slow on the uptake are complex, he suggests — it’s not one single missing piece that, say, a new piece of tech could fix; rather it’s the systemic complexity of orchestrating all the various bits needed to successfully deliver such projects that’s holding back the pace of change.\n“The complexity of executing these projects is unbelievably high,” he argues. “Commercial property owners just don’t have the expertise. And some of them don’t even want to deal with it, because it’s not their core business.”\nStanzl also points out that construction is a sector that hinges heavily on trust — so a low level of trust can also slow down progress.\nThe startup is taking on this energy upgrade inertia via an acquisition model that sees it buying existing companies in the sector to bring key capabilities and customer relations in-house — powering up an energy-optimization-as-a-service offering.\nThe idea is to cover all stages of a project — from initial assessments and determining what’s needed, to installation of the new systems and ongoing servicing and maintenance. It also includes financing when customers want to spread the up-front cost of installing new energy systems.\nBy covering the full chain of what’s required for an energy upgrade, the startup believes it can unlock efficiencies of scale while also leaning into (and leveraging) trusted customer relationships. It is breaking out of the siloed workflow that more typically characterizes the sector, per Stanzl.\nHe says the startup has picked up some more piecemeal energy upgrade project work so far, attached to the capabilities it has brought in house. But the idea is to continue to expand what it can offer and work toward taking on projects with many moving parts and much higher complexity — say, such as district heating installations — as they continue to build out the business.\nReshape has already made some acquisitions to build out its offering. More are on the cards — and the company will be using some of a new €5 million funding round for this purpose, its first external capital raise.\nBy buying up smaller, often regional companies, it can shortcut customer acquisition and plug into relationships and contacts these other businesses have amassed over the years, as well as onboarding key skills to deliver projects. An acquisition model also gives it full control of where and how skills are deployed, says Stanzl.\n“Over the life of these businesses, they’ve served hundreds if not thousands [of customers],” he notes of the businesses Reshape has brought in-house. So far, it’s picked up an energy consulting business and a commercial solar planning, installation, and maintenance company.\n“The control piece is critical, because we do need these companies all to work together — and we need them to use common systems and common technology,” he adds, sketching out their strategy to unlock efficiencies in project delivery by pooling trust and risk.\nThe founders are putting their money where their mouth is, contributing some of their own funds to the €5 million raise, which is being loosely labeled as a seed round. Although Stanzl says they’re not convinced that a typical venture funding model is for them, other approaches, such as private equity, might be a better fit, he posits.\nOther investors in the round include PostScriptum Ventures, Vireo Ventures, and some unnamed industry insiders.\nGermany has seen a boom in energy upgrade startups in recent years, following Russia’s invasion of Ukraine in 2022 and the resulting spike in gas prices. But the first wave of energy upgrade activity — much of which focused on single-family homes — that followed that shock has “definitely calmed down,” says Stanzl.\nPlayers in the space have more incentive to get out of their lanes and take a more joined up approach to delivering the next wave of upgrades, he says. In turn, it enables tackling more complex challenges like commercial real estate upgrades.\n“You cannot deploy heat pump if you don’t know what the electrical infrastructure of a building is, right? And if you do it, all of a sudden you may promise your customer a whole bunch of savings and then they come back and you realize they need to upgrade their transformer or something like that. Then all your savings are out the window,” he suggests.\n“So I think a number of people are realizing that if they just sort of focus on their little silo it’s just not enough anymore.”\nReshape’s model of offering energy optimization services to building owners looks more capital efficient than some other approaches — such as those that involve buying up real estate to transform via modernizing its energy infrastructure.\nGerman startupReneo, for example, recently closed a €600 million funding round for building out another decarbonization play but that involves it buying up target real estate to improve. Though, on the flip side, Reneo’s ownership model means it is positioned to benefit from any increase in real estate value — whereas Reshape remains purely a service provider, but with far lower capital requirements to spin up its business.\nStanzl says as they were developing the business, they did consider taking on property ownership — which would have meant needing to do things like property and tenant management services, too — but they decided it was not core to the energy transition mission. He also points out that commercial real estate owners may not want to sell their buildings — which would have created barriers to scaling.\nAnother element that’s often associated with energy transitions is upgrading building insulation, as better insulation can be a boon to energy system performance. Asked about this, Stanzl says that while they can provide it, they don’t “necessarily seek it out” — again, since it may amp up project complexity.\nThey have also categorically decided against involving themselves in cosmetic improvements to buildings.\n“We’re energy focused, right? We want to look at the energy infrastructure and the energy fabric,” he emphasizes. “So the issues [for target customers] are more … how can we use the waste heat? How do you optimize that, along with the cooling loads — less so around ‘how do you insulate the walls?’”\nThis report was updated with a correction to Benjamin Stanzl’s job title.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/10/startup-studio-hexa-acquires-majority-stake-in-veevart-a-vertical-saas-for-museums/",
        "date_extracted": "2025-03-14T13:36:16.578235",
        "title": "Startup studio Hexa acquires majority stake in Veevart, a vertical SaaS platform for museums",
        "author": null,
        "publication_date": null,
        "content": "Hexais trying something new. Instead of fostering startups from the ground up and incubating them for the first year or so, the Paris-based startup studio is acquiring a majority stake inVeevart, a vertical software-as-a-service company for museums that provides solutions for ticketing, fundraising, CRM, and collection management.\nHexa is a familiar name in the French tech ecosystem. The startup studio originally started its life in 2011 as eFounders and regularly comes up with ideas for new tech companies. It tries to find the right founding team and helps them with product design, go-to-market strategy, hiring, and fundraising.\nAfter this first phase, the companies become proper, independent startups, but Hexa keeps a significant stake on the cap table. Some successful Hexa portfolio companies includeFront,Aircall,Spendesk, andSwan.\nBut Veevart isn’t a new startup. It was founded in 2014 and now works with 160 museums and cultural institutions of all sizes around the world. With its team of 70 people, Veevart is already profitable.\nThe product has been designed as an all-in-one platform for museums, built on top of Salesforce. Museums that use Veevart can create and manage events, sell tickets online and on-site, manage memberships, automate communications to donors and integrate with the museum shop.\nMany museums use multiple tools for all those tasks. Having a single platform makes it easier to manage and maintain over time.\nThe reason why Veevart relies heavily on Salesforce comes down to Veevart’s founder, Antonio Velasco Echeverry — earlier in his career, he had worked with Accenture and Salesforce.\n“I wouldn’t say I ‘chose’ to build on top of Salesforce. People often assume these decisions are intentional, but honestly, luck plays a big part. We didn’t choose Salesforce — it was simply the technology I knew best,” Velasco Echeverry told TechCrunch.\nDespite some platform limitations, he added that building on top of Salesforce has some advantages such as security, scalability, and access to the entire Salesforce ecosystem.\nVeevart has bootstrapped itself for the past decade and has been profitable for a while — “not incredibly profitable, but profitable,” Velasco Echeverry said.\n“So when we started conversations with Hexa, we were not looking too much for money, but more for a partner that could help us get to our revenue targets faster and with less pain,” he added.\nWith this investment, Hexa acts as a sort of hands-on private equity partner. The startup studio is investing €5 million ($5.4 million at current exchange rates) to become the main shareholder in Veevart.\n“Our objective is that Hexa can help us achieve $20 million in [annual recurring revenue], implement best practices around product, [go-to-market], sales, and leadership,” Velasco Echeverry said.\nPrivate equity firms typically do not engage in small deals like this, while VC firms typically seek companies with high growth potential. But Hexa believes it can elevate Veevart to the next level by providing operational expertise to accelerate the company’s growth.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/Veevart-Team.png"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/10/radiology-ai-software-provider-gleamer-expands-into-mri-with-two-small-acquisitions/",
        "date_extracted": "2025-03-14T13:36:20.551910",
        "title": "Radiology AI software provider Gleamer expands into MRI with two M&A transactions",
        "author": null,
        "publication_date": null,
        "content": "Medical imaging is a broad term that encompasses several distinct technologies. After working on AI-powered tools to enhance X-rays and mammographies, French startupGleamernow aims to tackle magnetic resonance imaging (MRI).\nInstead of starting from scratch, Gleamer acquired a startup that has already been working on AI-powered MRI analysis,Caerus Medical, and is merging withPixyl.\nGleamer is part of the second wave of startups trying to improve medical imaging using artificial intelligence. Several tech founders created startups around this topic in 2014 or 2015. While most of them went nowhere, there has been some consolidation in the space. For instance, Zebra Medical Vision and Arterys were both acquired byNanoxandTempus, respectively.\nFounded in 2017, Gleamer has been building an AI assistant for radiologists, a sort of copilot for medical imaging. With Gleamer, radiologists can theoretically improve the diagnostic accuracy when interpreting medical images.\nThe startup has already persuaded 2,000 institutions across 45 countries to use its software solution. Overall, Gleamer has processed 35 million examinations. The company has received CE and FDA certifications for its bone trauma interpretation product. In Europe, it also offers products specifically focused on chest X-rays, orthopedic, and bone age measurements with CE certification.\n“Unfortunately, the one-size-fits-all approach to radiology doesn’t work,” Gleamer co-founder and CEO Christian Allouche told TechCrunch. “It’s very complicated to have a large model that covers all medical imaging and delivers the level of performance expected by doctors.”\nThat’s why the company created small internal teams focused on mammographies and CT scans. “Three weeks ago we released our mammography product, which we have been working on for 18 months,” Allouche said. It’s based on a proprietary AI model that has been trained on 1.5 million mammographies.\n“We have a partnership with Jean Zay, the French government’s GPU cluster,” Allouche said. The company is also working on CT scans for cancers.\nBut what about MRI? “MRI is a different technological space,” Allouche said. “You have a lot of tasks in MRI. It’s not just detection; you’ve got segmentation, you’ve got detection, you’ve got characterization, classification, multi-sequence imaging.”\nThat’s why Gleamer is acquiring a small startup (Caerus Medical) and merging with a larger one (Pixyl) to move faster. These two companies have been working in this space for several years. Gleamer isn’t disclosing the terms of the deals.\n“These two companies will become our two MRI platforms, with the clear ambition of covering all use cases over the next two to three years,” Allouche said.\nWhile Gleamer’s models show promising results, they are not yet perfect. For example, with the company’s new mammography model, the startup claims it can detect four out of five cancers. In comparison, a human radiologist without AI assistance typically identifies cancer in three out of five cases.\nHowever, the productivity gains from a tool like Gleamer could radically change medical imaging. A missed tumor is likely to appear in a follow-up exam a few months later.\n“In the not-too-distant future, I think we’ll all be getting routine whole-body MRIs paid for by our insurance companies — since they’re not irradiating,” Allouche said.\nHowever, in some cities, there are already too few radiologists to meet the demand for reactive imaging. If the industry shifts toward preventive imaging, AI tools will become indispensable.\nGleamer’s CEO thinks AI could become an “orchestrating and triaging” tool. Most medical imaging examinations are conducted as a way to rule out some diagnoses. “So, there’s a real need to automate all this with a very solid AI model that has a much higher level of sensitivity than a human,” Allouche said.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/10/infinite-uptime-bags-35m-to-help-factories-optimize-equipment-usage/",
        "date_extracted": "2025-03-14T13:36:23.231771",
        "title": "Infinite Uptime bags $35M to help factories optimize equipment usage",
        "author": null,
        "publication_date": null,
        "content": "Infinite Uptime, an Indian startup that offers predictive maintenance solutions for factories, has raised $35 million in a Series C funding round to expand its footprint in the U.S. and other markets.\nThe manufacturing industry has lagged many industries in its adoption of tech, and much of the world’s heavy industry still depends on machines, many of which are aging and consume lots of energy. That said, modern tech is slowly but surely making its way into factories, particularly for maintenance and repairs — the space Infinite Uptime is targeting.\nThe company says it provides predictive maintenance and repair recommendations using proprietary sensors, software analytics, and AI-based diagnostics. It also has a smart dashboard that provides live monitoring capabilities.\n“We give manufacturers pinpointed recommendations and intervention points, exactly what needs to be done in the plant, what parameters need to be looked at, which asset needs to be corrected,” Infinite Uptime’s founder, Raunak Bhinge, told TechCrunch.\nThe startup says its piezoelectric sensors can offer diagnostics in high temperatures as well as complex acidic environments such as phosphoric acid, nitric acid, and sulphuric acid plants. It has secured about five patents in this space, Bhinge said.\nTo be clear, this isn’t an entirely new opportunity in the market — large manufacturers like Rockwell, Siemens, and Honeywell have enabled factories with AI-based automation for some time. Similarly, some startups likeAuguryhelp factories detect problems with their machines using sensors and AI.\nBut Bhinge feels Infinite Uptime is “fairly unique in terms of the tech stack,” explaining that the startup’s approach is not top-down, like its larger competitors, which use programmable logic controllers (PLC) or programmable limit switches (PLS). He argued that even the battery-based microelectromechanical systems (MEMS) that some startups offer have limited use cases and effectively do not work for high-temperature applications.\nInfinite Uptime targets manufacturers in the steel, cement, metals, mining, fertilizers, chemicals, and paper industries. It also partners with OEMs to plug its AI layer into their new products.\nCumulatively, Infinite Uptime says its solutions have helped customers see downtime savings of 74,274 hours as well as 5% to 10% improvement in productivity, energy efficiency, safety, and compliance.\nThe startup currently serves 800 plants in nearly 30 countries, and with the new funding, it aims to expand its presence in the U.S. further. The Series C was led by Avataar Ventures and saw participation from StepStone Group and LGVP, along withexisting investors Tiger Global and GSR Ventures. The round brings the company’s total capital raised to about $65 million since its inception in 2015, perCrunchbase.\nBhinge said the startup’s revenue has increased by 2x every year for the past three years, and it is operationally cash-flow positive. The company is looking to put the fresh cash toward product development and intends to evaluate M&A opportunities to scale further.\nInfinite Uptime, which has about 350 employees, also plans to invest more in R&D and data science to enhance its AI insights and “further close the gap between build capacity and actual production and also improve production efficiency,” Bhinge said.\n“We’re investing in how we can help manufacturers … use less energy per ton of production from their existing build capacity,” he said.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/10/eric-schmidt-joins-relativity-space-as-ceo/",
        "date_extracted": "2025-03-14T13:36:26.488095",
        "title": "Eric Schmidt joins Relativity Space as CEO",
        "author": null,
        "publication_date": null,
        "content": "Former Google CEO Eric Schmidt is taking over as the CEO of Relativity Space, a 9-year-old rocket startup, a company spokesperson confirmed in a statement to TechCrunch. This is Schmidt’s first CEO job since he left Google nearly 15 years ago.\nOn Monday, Schmidt told employees of Relativity Space that hemade a significant investment and had taken a controlling stake in the company, The New York Times first reported.\nSchmidt is succeeding the startup’s co-founder, Tim Ellis, as chief executive. In apost on X, Ellis noted he will continue to support Relativity Space as a director on the company’s board.\nSchmidt is joining Relativity Space right as the company gears up forthe 2026 launch of Terran R, a larger rocket than what the startup has launched before, that would compete with SpaceX’s Falcon 9 and Falcon Heavy. In anticipation of Terran R’s first launch, Relativity Space has struck nearly $3 billion in launch contracts with customers, the Times reported.\nSchmidt was the CEO of Google for roughly 10 years. He was brought on to lead the rapidly growing search company in 2001, as Google’s board pressured its young founders, Sergey Brin and Larry Page, to allow an experienced business leader to take the reins.\nNow, Schmidt will become CEO of Relativity Space at a critical moment in the company’s history. He may offer the rocket startup both capital and experience to help guide it through the launch of Terran R. Additionally, Schmidt is quite well-connected in Washington, D.C., which could potentially assist Relativity Space in working with government officials on future launches.\nRelativity Space is known for producing its rockets with unusual techniques, including the use of 3D printers, automated robots, and artificial intelligence. The company previously announced a plan tolaunch the first private space mission to Marsby 2024. However, certain challenges have delayed those audacious milestones.\nIn 2023, Relativity Space successfully launched its Terran 1 rocket, demonstrating that its 3D-printed technology could function effectively. However, Terran 1 failed to reach orbit. A month later, the startup announced that it would discontinue Terran 1 to focus entirely on developing the Terran R.\nThe Long Beach-based rocket company reportedly faced cash shortages in 2024 andstruggled to raise additional funding, Bloomberg previously reported. Previous investors in Relativity Space include Mark Cuban, BlackRock, and Fidelity.\nWhile running a rocket company is quite different from managing a search engine company, Schmidt has proven to be a valuable operator who can effectively grow startups in the past. With fierce competition in the space industry — from companies such as SpaceX, Rocket Lab, and Blue Origin — it seems Relativity Space could benefit from someone like Schmidt at the helm.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/10/open-web-initiatives-project-liberty-and-solid-could-be-teaming-up/",
        "date_extracted": "2025-03-14T13:36:29.161638",
        "title": "Open web initiatives Project Liberty and Solid could be teaming up",
        "author": null,
        "publication_date": null,
        "content": "Two initiatives to create a more open web, where users are in control of their own digital identities and data, may be coming together. At SXSW 2025, entrepreneur Frank McCourt, whoseProject Libertyis developing open internet infrastructure (and isthrowing its hat in the ringasa potential buyer for TikTok), announced that his organization has been in discussions with internet pioneer Tim Berners-Lee about an integration withSolid, hisopen source project aimedat giving people control over their own data.\nIn apanelat SXSW, McCourt shared that his team had “talked to Tim Berners-Lee about Solid,” adding that “Project Liberty is compatible with Solid.”\nThough he didn’t announce an official partnership, McCourt suggested that discussions were underway on a future collaboration.\n“We’re debating, or talking, right now about how to incorporate that — him and Solid, his Solid Pods — into the project,” McCourt teased.\nBerners-Lee, known as thefather of the World Wide Web,announced in 2018 he had been workingwith a small team at the Massachusetts Institute of Technology to developSolid. He had also tapped British engineer John Bruce to head upInrupt, a startup built on top of the open source project.\nInrupt has gone on to launch a privacy platform aimed at enterprises, where people control their data in online storage entities called Personal Online Data Stores, or Pods for short.\nWith similar missions in mind, Berners-Lee has been supportive of Project Liberty’s efforts. He evenbacked its TikTok bid, saying: “This project has my support. The web I invented was to provide power and value to individuals, which they do not have at the moment.”\nHowever,there has notbeen a formal collaboration between Solid and Inrupt and Project Liberty, the latter of which is focused on the development ofDecentralized Social Networking Protocol (DSNP).\nThat protocol today is being adopted by a handful of apps and other projects, includingMeWe;Soar.com(founded by Ancestry.com’sPaul Allento build apps through a studio model); and the permissionless blockchainFrequency(developed byProject Liberty Labs).\nProject Liberty alsorecently announced a partnershipwithFree Our Feeds, an effortfocused on protecting the AT Protocol, which powers Bluesky’s social network.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/10/applications-are-open-for-startup-battlefield-200-apply-today/",
        "date_extracted": "2025-03-14T13:36:31.914260",
        "title": "Applications are open for Startup Battlefield 200 — apply today!",
        "author": null,
        "publication_date": null,
        "content": "Are you a pre-Series A startup founder looking to make your mark on a global stage? This is the opportunity you’ve been waiting for. Applications forTechCrunch Startup Battlefield 200— the premier startup pitch competition — are officially open. We want to see you showcase your game-changing innovations to the world at TechCrunch Disrupt 2025.\nGet an unbeatable chance to gain exposure and pitch your startup to world-class VC judges — and the entireTechCrunch Disrupt 2025audience at Moscone West in San Francisco from October 27-29 — as you compete for the coveted $100,000 equity-free prize. Don’t let this rare chance to make a major impact pass you by.\nThe competition is expected to be fierce. Thousands of startups applied last year, and 2025 is likely to have another large swath of innovators competing for their shot. If you think your startup has what it takes,apply early to get an edge on the competition.Of course, TechCrunch reviews every application in detail, but the sooner you enter, the better.\nAnd that’s not all! Go to the officialStartup Battlefield 200 pageto learn more.\nStartup Battlefield 200 has over 1,500 alumni, including game-changing startups like Trello, Mint, Dropbox, Discord, Getaround, and more. That legacy makes Startup Battlefield the ultimate launchpad for the next generation of disruptors — and your startup could be the next success story.\nIf you’re part of a bold, early-stage startup with a transformative vision,we want to hear from you. Whether you’re bootstrapped, pre-seed, or seed-funded — Startup Battlefield is the place to take your startup to the next level. Series A startups in capital-intensive industries may also qualify.\nDon’t miss your chance to participate in the biggest startup pitch competition of the year and to compete on a global stage.Apply today to make your mark!\nIs your company interested in sponsoring or exhibiting at TechCrunch Disrupt 2025? Contact our sponsorship sales team byfilling out this form.\nSee the impact for yourself — watch the video below to hear how our partners thrive with us.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/Startup-Battlefield-200-contestant_Disrupt-2024.jpg?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/10/heres-your-chance-to-host-a-side-event-at-techcrunch-sessions-ai/",
        "date_extracted": "2025-03-14T13:36:36.129919",
        "title": "Here’s your chance to host a Side Event at TechCrunch Sessions: AI",
        "author": null,
        "publication_date": null,
        "content": "If you want to amplify your brand to over 1,000 AI experts and innovators, there’s no better way than by hosting a Side Event duringTechCrunch Sessions: AI Week.\nFrom June 1 to June 7, TechCrunch is looking for fun and thought-provoking events to coincide withTC Sessions: AI, which takes place on June 5 in Zellerbach Hall at UC Berkeley. Whether it be a cocktail party, an industry meetup, or a thought-provoking panel, we’re open to a wide range of Side Events.\nTC Sessions: AIis the event that will give you insights into the cutting-edge and ever-evolving industry through expert-led main-stage sessions, hands-on demos, and unparalleled networking opportunities. Apply to host a Side Event to make sure your brand is part of the conversation.\nIn addition to receiving an exclusive discount code on your and your network’sTC Sessions: AItickets, TechCrunch will fully promote your Side Event to our TechCrunch audience and TC Sessions: AI attendees:\nAs the host, you will be responsible for managing your event’s registration, promotion, creative, communication, insurance, and cost. There is no fee to be a part of the TC Sessions: AI Side Events lineup. See thefull terms and conditions hereand read throughour official event guideto learn everything you need to know about hosting a Side Event.\nSide Events offer a powerful way to build your brand in Berkeley’s AI scene while making valuable connections. Gain exposure to 1,000+ startup, VC, and AI leaders at TC Sessions: AI. Don’t miss out —apply now!\nPaid sponsor events can take place at any time during TechCrunch Sessions: AI or during TechCrunch Sessions: AI Week. Paid sponsored events get additional and guaranteed promotional benefits that Side Events do not. If you want to learn more about sponsored opportunities,fill out this form here.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/10/showcase-your-innovation-exhibit-at-techcrunch-sessions-ai/",
        "date_extracted": "2025-03-14T13:36:40.458647",
        "title": "Showcase your innovation — exhibit at TechCrunch Sessions: AI",
        "author": null,
        "publication_date": null,
        "content": "On June 5, 1,200 of the brightest minds in AI and VC leaders will converge in Zellerbach Hall at UC Berkeley forTechCrunch Sessions: AI— the must-attend AI event of the year.\nWhat does this mean for your startup? A prime opportunity to showcase your breakthrough to a crowd hungry for AI innovation. We’ve made it seamless — just visitthis exhibit pageand claim your booth today!\nBroaden your impact:Present your cutting-edge solutions on the lively TC Sessions: AI Expo floor, where more than 1,200 AI experts, investors, and enthusiasts gather. This is your chance to showcase your startup’s unique value and forge connections that could drive your business ahead.\nFull conference access to engage and network:Leverage six full conference passes, giving you and your team full access to TC Sessions: AI. Dive into main-stage sessions, participate in roundtables, network with industry leaders, and present your startup to an AI-focused audience, building valuable connections throughout.\nEnhance your brand awareness:Showcase your startup on the TC Sessions: AI website and event app, ensuring your startup stands out to investors and partners, and giving you an edge over the competition.\nAffordable and high impact:Priced at just $7,500, this Exhibitor program offers exceptional value for startups looking to stand out to an AI audience. Benefit from unmatched visibility, networking, and marketing assistance.\nWe ensure attendees can’t miss your showcase by putting innovation front and center. Here’s how we do it.\nWith only 12 exhibit tables available, they’ll be sure to go fast. Don’t miss your chance to boost your brand —claim your table now for TC Sessions: AI.Learn more and get your exhibit table here.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/10/maximize-your-exposure-secure-an-exhibit-table-at-techcrunch-all-stage-2025/",
        "date_extracted": "2025-03-14T13:36:43.066106",
        "title": "Maximize your brand: Secure an exhibit table at TechCrunch All Stage 2025",
        "author": null,
        "publication_date": null,
        "content": "On July 15, 1,200 founders and VCs across all stages will gather at SoWa Power Station in Boston forTechCrunch All Stage 2025— the ultimate summit for startup founders.\nWhat does this mean for you? A golden opportunity to showcase your brand to a powerhouse crowd eager to scale. It’s easy — just head tothis exhibit pageand grab your booth now!\nExpand your reach:Exhibit your cutting-edge solutions on the energetic TC All Stage Expo floor, where more than 1,200 founders and VCs will be present. Take advantage of this chance to demonstrate your startup’s distinct value and establish partnerships that can accelerate your success.\nUnlock full conference access to connect and engage:Get six full-access conference passes, giving you and your team unrestricted entry to TC All Stage. Attend breakout sessions on the main stages, participate in roundtable discussions, engage in unparalleled 1:1 and small-group networking, and showcase your startup to a growth-focused audience, creating valuable opportunities for scaling.\nElevate your brand presence:Highlight your brand on the TC All Stage website and event app, ensuring it captures the attention of founders, investors, and partners, giving you a clear advantage over competitors.\nHigh-value, low-cost:For just $5,500, this Exhibitor program delivers outstanding value for brands eager to make an impact with the TC All Stage audience. Get unmatched visibility, networking opportunities, and comprehensive marketing support from TechCrunch.\nWith only eight exhibit tables up for grabs, they won’t last long. Secure your spot to boost your brand — claim your table now for TC All Stage.Get all the details and reserve your table here.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/10/supercharge-your-brand-visibility-with-an-exhibit-table-at-techcrunch-disrupt-2025/",
        "date_extracted": "2025-03-14T13:36:45.682936",
        "title": "Supercharge your brand visibility with an exhibit table at TechCrunch Disrupt 2025",
        "author": null,
        "publication_date": null,
        "content": "From October 27-29,TechCrunch Disrupt 2025will bring together over 10,000 startup pioneers, VC leaders, and tech enthusiasts at Moscone West in San Francisco — the epicenter of innovation set to reshape the future of technology.\nWhat’s in it for your startup? A golden opportunity to put your innovation in front of an eager audience for all three days. The process is easy — simplyvisit this exhibit pageand reserve your booth today!\nExpand your reach: Showcase your innovative solutions in the bustling Disrupt Expo Hall for three full days, with over 10,000 tech leaders and VCs in attendance. Seize the opportunity to highlight your startup’s unique value and forge partnerships that can drive your growth.\nMaximize connection opportunities: Receive 11 conference passes for you and your team to fully engage with Disrupt 2025. Attend main stage discussions, breakout sessions, roundtables, and network one-on-one with decision-makers, all while positioning your startup in front of a highly engaged audience.\nBoost your brand visibility: Promote your brand to Disrupt attendees and the whole TechCrunch audience before, during, and after Disrupt 2025 across multiple platforms — Disrupt’s website, event app, and a TechCrunch post — ensuring your startup stands out to founders, investors, and potential partners and clients.\nUnmatched ROI: For just $10,000, this Exhibitor package offers extraordinary value — delivering maximum exposure, essential networking, and extensive marketing support from TechCrunch to amplify your brand.\nThe Disrupt Expo Hall has limited booth spaces, and they won’t last long. Act fast to secure your spot and amplify your brand at Disrupt 2025.Reserve your table now and get all the details here.\nIf you’re looking to sponsor TechCrunch Disrupt 2025, get in touch with our sales team bysubmitting this form.See the impact for yourself — watch the video below to hear how our partners thrive with us.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/Disrupt-2024-Exhibitors_Nebius.jpg?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/03/Disrupt-2024-Exhibitors_Fye-Labs.jpg?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/09/colossal-ceo-ben-lamm-says-humanity-has-a-moral-obligation-to-pursue-de-extinction-tech/",
        "date_extracted": "2025-03-14T13:36:48.244380",
        "title": "Colossal CEO Ben Lamm says humanity has a ‘moral obligation’ to pursue de-extinction tech",
        "author": null,
        "publication_date": null,
        "content": "The CEO of Colossal, a startup that aims to use genetic editing techniques to bring back extinct species, including the wooly mammoth, assured audiences at SXSW that the company has no plans to create a real-life Jurassic Park — lest there was any doubt.\n“Modern conservation isn’t working […] and we’re gonna need a ‘de-extinction’ toolkit,” Colossal CEO Ben Lamm said during an onstage interview Sunday in Austin, responding to questions from actor and board member Joe Manganiello. “I think that we have a moral obligation and an ethical obligation to pursue technologies [that] undo some of the things that we [as a species] have done.”\nColossal is working to bring back the dodo bird and thylacine, commonly known as the Tasmanian tiger, well as the wooly mammoth, Lamm added. But the de-extinction of dinosaurs wouldn’t be possible due to the lack of usable sources of dinosaur DNA.\nDallas-based Colossal, founded in 2023 by Lamm and George Church, has stated that it wants to have woolly mammoth hybrid calves by 2028, which it hopes to reintroduce to the Arctic tundra habitat. The company is also leading a research project to release Tasmanian tiger joeys back to their original Tasmanian and broader Australian habitat after a period of captivity.\nThat vision has resonated with investors. Colossal has raised hundreds of millions of dollars in venture capital, and it’scurrently valued at $10.2 billion.\nColossal has spun out two companies focused on specific applications, including a third that hasn’t yet been announced. Lamm also said he thinks there’s “billions of dollars” to be made from the “re-wilding” of species and carbon sequestration.\nOne of Colossal’s recent high-profile projects isthe gene-edited “woolly mouse,”a mouse species with mutations inspired by woolly mammoths. The mice, which exhibit long, shaggy, tawny-toned fur, were developed using a mix of mammoth-like and known mouse hair-growth mutations.\nSome experts have expressed skepticism of the new species, arguing that the experiment was more about mouse genetics than a breakthrough in de-extinction.\nLamm, however, said the project validated Colossal’s work on wooly mammoth research.\n“It showed us that, initially, our edits that we were making for the mammoth are the right edits,” Lamm said.\nLamm touched on AI during the interview, saying that he believes that the combination of access to computing, AI, and synthetic biology will be the most “dangerous” set of technologies the world has seen. But he also painted an idealistic picture of the future, predicting that synthetic biology advances in particular will lead to cures for cancer, means of removing plastics from the oceans, and the widespread availability of clean water.\n“We will have true dominion over life, where we can eradicate species that are invasive or we can bring back lost species,” Lamm said, “and I think we’ll also have the ability to engineer plants — not just for food consumption, but you will be able to engineer plants with different types of proteins.”\nLamm also said that he anticipates humanity will “achieve longevity escape velocity” in the next 20 years, adding years to the average human life expectancy and making immortality a theoretical possibility.\nBeyond human longevity, Lamm said de-extinction may require a “Manhattan Project-scale project” to back up endangered species specifically in “bio vaults” to create stem and egg cells. Lamm said he’s talked to “a country that seems excited about it” — without naming any names.\nOn the subject of public sector work, Lamm mentioned that Colossal meets “quarterly” with U.S. government agencies and that the government has invested in Colossal, presumably via grants.\n",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/image002-1.gif?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/09/tammy-nam-joins-ai-powered-ad-startup-creatopy-as-ceo/",
        "date_extracted": "2025-03-14T13:36:50.986781",
        "title": "Tammy Nam joins AI-powered ad startup Creatopy as CEO",
        "author": null,
        "publication_date": null,
        "content": "Creatopy, a startup that uses AI to automate the creation of digital ads, has brought on a new CEO:Tammy Nam.\nNam waspreviously COO and CMO at photo-editing startup Picsart, and before that the CEO of video streamer Viki. She told TechCrunch via email that Creatopy was looking for a U.S.-based executive who knows how to scale early-stage startups, has worked with European founders (the product was first developed in Romania), and understands marketing tech.\n“Fortunately, I fit that bill,” she said.\nNam is also joining the Creatopy board, while the startup’s previous CEO Dan Oros has stepped into an advisory role.\nThe startupannounced a $10 million Series Aled by European VCs 3VC and Point Nine last year. In a statement, 3VC partner Eva Arh described Nam as “one of the best operators I know.”\nBetween February 2024 and February 2025, the company claims to have grown mid-market and enterprise revenue by 400%, with much of that growth coming in the past six months. Customers include AstraZeneca, NASCAR, and The Economist.\n“What’s remarkable about Creatopy — especially for a relatively unknown company — is our ability to land major enterprise customers in demanding industries like pharma and banking,” Nam said.\nShe added that customers love the product for “our intuitive interface, unique product capabilities, and excellent customer service.” In fact, she suggested that as large language models become “ubiquitous,” Creatopy differentiates itself based on its “ability to understand customer needs and deliver — perhaps ironically — high-touch value on top of the AI.”\nNam also described brand safety as a “top priority,” with marketing managers uploading brand kits during account setup, and those kits ensuring that every AI-generated ad adheres to their brand guidelines.\n“Our AI doesn’t replace strategic thinking; it amplifies it,” she said. “Some of our customers have reported a 10x or more increase in productivity because we eliminate the tedious, manual work of generating hundreds of ad variations across sizes, formats, languages, etc.”",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/08/9-us-ai-startups-have-raised-100m-or-more-in-2025/",
        "date_extracted": "2025-03-14T13:36:53.748176",
        "title": "9 US AI startups have raised $100M or more in 2025",
        "author": null,
        "publication_date": null,
        "content": "Last year was a monumental year for the AI industry in the U.S. and beyond.\nThere were49 startups that raised funding rounds worth $100 millionor more in 2024, per our count at TechCrunch. Three companies raised more than one “mega-round” last year, and seven companies raised rounds at $1 billion or larger.\nHow will 2025 compare? It’s still early in the year but the number of U.S. AI companies that have raised more than $100 million is almost in double digits, and there has already been one round larger than $1 billion.\nHere are all the U.S. AI companies that have raised more than $100 million so far this year.\nThis piece has been updated to remove that Abridge is based in Pittsburgh, the company was founded there.\n",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/07/cursor-in-talks-to-raise-at-a-10b-valuation-as-ai-coding-sector-booms/",
        "date_extracted": "2025-03-14T13:36:57.150825",
        "title": "Cursor in talks to raise at a $10B valuation as AI coding sector booms",
        "author": null,
        "publication_date": null,
        "content": "Investor interest in AI coding assistants is exploding.\nAnysphere, the developer of AI-powered coding assistant Cursor, is in talks with venture capitalists to raise capital at a valuation of nearly $10 billion,Bloomberg reported.\nThe round, if it transpires, would come about three months after Anysphere completed its previous fundraise of $100 million at a pre-moneyvaluation of $2.5 billion, as TechCrunch was first to report. The new round is expected to be led by returning investor Thrive Capital.\nThrive Capital and Anysphere didn’t immediately respond to a request for comment.\nWhile Anysphere’s previous round valued the company at 25 times its $100 million ARR (per TheNew York Times), investors seem to be willing to value fast-growing companies at even higher multiples now. Anysphere’s current annualized recurring revenue (ARR) may have already climbed to $150 million,The Information reported, which means the new deal, should it happen would be a whopping 66 times ARR.\nAnysphere isn’t the only company receiving such a high valuation from investors.\nCodeium, a company behind AI coding editor Windsurf, is raising capital at a valuation of nearly $3 billion,TechCrunch reportedlast month. Kleiner Perkins, which is leading the round into Codeium, valued the company at about 70 times ARR of about $40 million.\nAI is adapting fastest in coding tools, outpacing its use in sales, law, healthcare, and other sectors, according to investors.\nIn recent weeks, investors have been approaching Poolside, another AI-powered coding company that is also developing its own LLM, sources tell TechCrunch and The Information. Poolside didn’t immediately respond to a request for comment.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/07/sxsw-2025-what-were-paying-attention-to/",
        "date_extracted": "2025-03-14T13:36:59.886224",
        "title": "SXSW 2025: What we’re paying attention to",
        "author": null,
        "publication_date": null,
        "content": "TechCrunch will be on the ground at SXSW 2025 — the annual tech, music, comedy, and film conference that kicked off Friday in Austin — in search of the zeitgeist of this AI-centric era.\nYup, we’re one sentence in and AI has already made its entrance. And why not? A quick scan of the massive SXSW schedule illustrates that AI is on center stage in Austin — and globally. It’s worth noting that this year there seems to be an emphasis on how AI is being applied to the real world, not just speculation on what it could be.\nSXSW tends to reflect what the tech ecosystem of founders and backers are working on. And it often coincides with the hype cycle. Autonomous vehicles, scooter mania, crypto, psychedelics — they’ve all had their moment at SXSW.\nThe tech portion of the annual event kicked off Friday and will run through March 13. The conference begins with several tracks that fall squarely in TechCrunch’s area of interest, including the creator economy, culture, startups, health and medtech, and energy. The AI track officially begins Sunday, but it’s already making cameos. For instance, Signal President Meredith Whittaker, who was interviewed onstage Friday, called outagentic AI as a security and privacy threat, and a health expert warned that it can bedangerous for people to be too reliant on AI for companionship.\nDeep tech like space and quantum computing will also make its mark at the show, as will climate, sustainability — look out for Rivian founder and CEO RJ Scaringe’skeynote March 11— and transportation.\nAutonomous vehicles are back, but this time they’re on the road — not just the topic of conversation in a panel. Earlier this week, Uber and Waymo launched arobotaxi servicein Austin. The so-called “Waymo on Uber” robotaxi service is available to any member of the public who has an Uber account. And you better believe TechCrunch will be hailing those robots and talking to human Uber drivers about what they think.\nTechCrunch will also be talking to the VCs, founders, and industry experts at SXSW to get the pulse of how the tech world is adjusting to the Trump administration and, of course, to find the next newnewthing. We’ll also be paying attention to the numerous keynotes and interviews with tech and business luminaries, notably Alan Baratz of D-Wave Quantum, Qualcomm President and CEO Cristiano Amon, Colossal Biosciences founder Ben Lamm, and Arm CEO Rene Haas.\nDon’t worry, we’ll have a bit of fun, too.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/07/discord-is-discussing-an-ipo/",
        "date_extracted": "2025-03-14T13:37:02.533546",
        "title": "Discord is discussing an IPO",
        "author": null,
        "publication_date": null,
        "content": "Discord — the chat app with over 200 million monthly users — is in early-stage talks to IPO, The New York Timesreports. Discord’s discussions with investment bankers are still exploratory and plans could change, per the NYT’s sources.\nDiscord understands there is a lot of interest about its plans, but does not comment on rumors or speculation, a spokesperson told TechCrunch.\nThis isn’t the first time Discord has mulled over an IPO.\nThe San Francisco-based startupwalked away from a $10 billion purchase by Microsoftin 2021 as it considered staying independent and going public.\nDiscord waslast valued at $14.7 billionin a 2021 fundraise for $500 million.\nDiscord is especially popular in certain communities like video games and crypto, but it has alsoemerged as an unlikely center for the AI boom, with image generation companies like Midjourney operating on its server.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/07/google-removes-underrepresented-language-from-its-grant-website/",
        "date_extracted": "2025-03-14T13:37:05.311909",
        "title": "Google removes ‘underrepresented’ language from its grant website",
        "author": null,
        "publication_date": null,
        "content": "Just weeks after Google said itwould reviewits diversity, equity, and inclusion programs, the Google for Startups Founders Fund web page is peppered with changes. Most notably Google is now using past tense to describe all of its fund programs for underrepresented founders.\nThis is a change that took place after December, according to the internet archives. And the site currently says that there are zero fund programs available.\nGoogle’s Startup Founders Fund launched in 2020 to provide monetary grants, mentorship, and product support for startups with underrepresented founders, including women and those from African and Latino descent.\nThe site says it has given more than $50 million in support to more than 600 founders. Aside from capital, founders received mentorship and product support, such as credits to Google Cloud.\nBut the grant landscape — especially regarding programs that targeted minorities — has changed greatly since 2020. Some tech founders and investors that TechCrunch spoke to wondered what would happen to grant programs, such as Google Startups Founders Fund, amid the fierce political and legal attacks on any program labeled “DEI.”\nThe programs listed as “past” funds on this site now include the Women’s Founders Fund, Latino Founders Fund, Ukraine Support Fund, Black Founders Fund U.S., and Black Founders Fund Brazil.\nAdditionally, the site says “zero” grant programs are currently available in any region, although programs that train founders on its AI products and U.S. accelerators for startups in certain industries (energy and climate) are accepting applications.\nIt’s unclear which of these programs have formally ended, been suspended, or are being restructured in other ways. Google’s response when asked about their status was vague but implied a focus shift away from underrepresented founders and toward AI startups.\n“We have not yet opened applications in the U.S. for Google for Startups Funds in 2025. Google for Startups is supporting all past cohorts of Founders Funds in our alumni community. In 2025, we’ll invest in AI-focused startups in the U.S. and we will share more specifics at a later date,” a spokesperson said.\nTechCrunch observed other changes in the language of this program’s web pages.\nIn December the site specificallystated that the grants “provided more than $50 million to support underrepresented founders,” whereas today,the word “underrepresented”has been removed.\nAnarchived pagefrom January 21, shows Google used to describe the program’s purpose as “financial support for underrepresented communities” and “to help underrepresented and at-risk founders build and grow their businesses.”\nCurrently,Google says the programprovides “financial support for innovators,” and hands-on support “to help founders build and grow their businesses.”\nGoogle did not respond to our request for comment about the language change on the site.\nIn the past month, Googleand other tech giants, like Meta and Amazon, started adjusting their DEI wording and activities as the Trump administration puts pressure on the public and private sector to roll back such programs. Googleannounced earlier this monthit would no longer have diversity targets andalso removed mentionof DEI in its annual 10-K filing.\nReutersreported this weekthat companies that have publicly distanced themselves from DEI have done the opposite in private, revealing the delicate balance businesses are facing today as they seek to avoid DEI legal challenges.At the same time, U.S. grant programs targeted toward specific segments of underrepresented communities have been under attack for a while. Fearless Fund famously had to settle a lawsuit over its grant program for Black Women founders andshut down the program in September.PayPal is alsocurrently being sued forits grant commitment to Black and Latino founders over allegations that it discriminates against other races.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/07/techcrunch-sessions-ai-speaker-applications-close-today-submit-yours-now/",
        "date_extracted": "2025-03-14T13:37:09.430341",
        "title": "TechCrunch Sessions: AI speaker applications close today, submit yours now",
        "author": null,
        "publication_date": null,
        "content": "On June 5,TechCrunch Sessions: AIwill kick off — and you can be part of the industry-changing conversations that will be taking place. We have an open invitation for members of the AI community to lead breakout sessions and discussions with over 1,200 startup founders, VC leaders, and AI aficionados attending our newest event, which will be held in Zellerbach Hall at UC Berkeley. There’s just one catch: You have to apply by midnight tonight, March 7, to be considered as a speaker,so head right here to do so.You only have four days left to get your application in front of our team before we make our choices!\nAs the AI field rapidly develops, we want to make sure that the innovators driving the discourse are able to take center stage, so at TechCrunch Sessions: AI, you can apply to lead a 50-minute session, complete with a presentation, panel discussion, audience Q&A, and up to four speakers included in a discussion of a topic that you think will send shock waves through the community.\nHere’s how it works: You just have to hit the “Apply to Speak” button andsubmit your topic on the events page. We’re open to a variety of topics, ranging from the startups within the space, the emerging AI tools changing the way we work and build, the infrastructure and teams it takes to support all of this innovation, and beyond. It could be your idea is something no one’s ever even thought of before!\nOur TechCrunch audience will then vote on the submitted topics and choose the titular sessions that will fill the programming of our AI industry event.\nIf your topic is chosen, you don’t just get to lead a discussion and take home some bragging rights. Breakout session speakers get access to our exclusive main stage of AI event programming, additional breakout sessions, and the opportunity to join in on small-group or even one-on-one networking opportunities. Your next investor or hire could come from this very event!\nAs if getting a chance to drive a conversation amongst your peers wasn’t enough, you’ll also get some additional perks: Speakers and their companies get prominently featured across all of our event listings and agendas, both on our site and app. TechCrunch’s editorial team will be on the ground covering the event, and the breakout sessions, with associated social media promotion from TechCrunch in the lead-up to and after the event.\nYou’ve made it this far, so what’s the holdup? Get your brightest ideas together and make a pitch to help steer the future of AI conversations by applying to speak today.The clock’s ticking with today as the final day left to apply!",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/07/startups-raised-funding-to-help-others-navigate-challenges/",
        "date_extracted": "2025-03-14T13:37:13.024688",
        "title": "Startups Weekly: Startups raised funding to help others navigate challenges",
        "author": null,
        "publication_date": null,
        "content": "Welcome to Startups Weekly — your weekly recap of everything you can’t miss from the world of startups. Want it in your inbox every Friday?Sign up here.\nSometimes problems are just that: problems. But often, they are also fodder. This week brought us a mix of startups facing adversity, sometimes of their own doing, and others that are thriving.\nSome startups racked up revenue and contracts; others racked up lawsuits.\nRamping up: Fintech startup Rampmore than doubled its annualized revenueto $700 million. In a recent secondary share sale, it alsonearly doubled its valuationto $13 billion.\nBang a gong: Revenue prediction startup Gongsurpassed $300 million in annualized revenue, putting the AI company on the path to a potential IPO.\nMach speed: Mach Industries, a defense tech startup backed by Sequoia,landed a contract with the U.S. Armyand has plans for its first factory, its 21-year-old founder Ethan Thornton said.\nBoomerang: After years of controversy, including a now-settled legal battle, Ryan Breslow isonce again the CEO of Bolt, the fintech company he founded, which was once valued at $11 billion.\nOne lawsuit: Passes, a direct-to-fan monetization platform for creators that raised a $40 million Series A led by Bond Capital in 2024,has been suedfor allegedly distributing child sexual abuse material.\nAnother lawsuit:One board member of climate-friendly fintech startup Aspirationplead guilty to wire fraudand one co-founder was arrested for allegedly conspiring to defraud investors, according to a federal criminal complaint.\nSeveral startups announced large rounds this week — in AI as usual, but also in different categories that help others navigate hairy situations.\nAI maker: Anthropicraised a $3.5 billion Series Eled by Lightspeed Venture Partners at a $61.5 billion post-money valuation.\nAI partner: Turing, which contributes to the building of LLMs,raised a $111 million Series Eled by Malaysia’s sovereign wealth fund Khazanah Nasional Berhad at a $2.2 billion valuation.\nHR competition: Indian HR unicorn Darwinboxraised $140 millionto expand internationally and challenge competitors like Deel.\nCounter drones: U.S. defense tech startup Epirus raiseda $250 million Series Dto counter drone swarms. Germany-based Alpine Eagle securedaround $10.96 million in fundingfor its airborne solution to the same problem.\nAvoiding volatility: Tel Aviv-based startup Grain emerged from stealth with$50 million in fundingto help businesses hedge against FX volatility.\nNavigating tariffs: With cross-border trading barriers in the spotlight, Swapraised $40 millionto build tools that help merchants deal with tariffs and other hurdles.\nAvoiding chemo: New York-based startup Ataraxis AIraised a $20.4 million Series Ato predict the cancer outcome of individual patients and whether chemo can be avoided.\nLarger fund: Thirty-year-old firm Foundation Capital, an early backer of Solana and Cerebras,raised an 11th flagship fund of $600 million— 20% more than its predecessor.\nEd Zitron, host of the Better Offline podcast, has no patience for growth at all costs and what he calls the “rot economy,” but don’t mistake this for tech hate. In a recent episode of the Equity podcast, heargued there’s an opportunity for startupsto do better than Big Tech in putting users first.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2022/03/20211130_Ramp_Founders-1-e1647826565802.jpg?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/02/Anthropic-Dario-Amodei.jpeg?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-586217837-1.jpg?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/podcast/the-california-ai-bill-is-back-and-it-lost-its-teeth/",
        "date_extracted": "2025-03-14T13:37:16.373143",
        "title": "No Title Found",
        "author": null,
        "publication_date": null,
        "content": "California’s mostcontroversial AI safety billof 2024 might be dead, but its authorisn’t backing down. State Senator Scott Wiener is back with SB 53, a new AI bill that strips away the most debated parts of last year’s failed legislation while keeping key whistleblower protections and a public cloud computing initiative called CalCompute.\nWith the AI industry and even the federal government shifting away from AI safety regulation in favor of innovation, will the bill gain any traction? Today, on TechCrunch’sEquitypodcast, hosts Kirsten Korosec, Max Zeff, and Anthony Ha are unpacking the latest moves in AI regulation, along with the week’s top stories in tech and startups.\nListen to the full episode to hear about:\nEquity will be back next week, so stay tuned!\nEquity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. Subscribe to us onApple Podcasts,Overcast,Spotifyand all the casts. You also can follow Equity onXandThreads, at @EquityPod. For the full episode transcript, for those who prefer reading over listening, check out our full archive of episodeshere.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/07/last-day-to-apply-to-be-a-techcrunch-sessions-ai-speaker/",
        "date_extracted": "2025-03-14T13:37:19.005674",
        "title": "Last day to apply to be a TechCrunch Sessions: AI speaker",
        "author": null,
        "publication_date": null,
        "content": "TechCrunch Sessions: AIkicks off on June 5 in Zellerbach Hall at UC Berkeley — and we want AI leaders to take part in industry-changing conversations. Make your mark by leading breakout sessions and discussions with over 1,200 startup founders, VC leaders, and other industry pioneers at TC Sessions: AI. But don’t wait, you haveuntil tonight at 11:59 p.m. PTto apply.\nAre you an innovator driving the discourse and want a rare chance to take center stage?TC Sessions: AIwants to highlight your expertise. Apply to lead a 50-minute breakout session, complete with a presentation, panel discussion, and audience Q&A, on a topic that you think will help impact and inform the industry.\nHead to theTC Sessions: AI event pageand click the “Apply to Speak” button to submit your topic. Whether the focus is on the startups within the space, the tools changing the way we work and build, or the infrastructure it takes to support further innovation, we’re open to a wide range of discussions.\nOnce applications are submitted, our TechCrunch audience will vote on their favorite sessions that they want to see at our premiere AI industry event.\nSure, you’ll be able to lead a discussion and take home some bragging rights, but there’s plenty of other perks if your topic is selected. Selected speakers will get access to our exclusive main stage of AI event programming, additional breakout sessions, and the opportunity to join in on small-group and 1:1 networking opportunities.\nSpeakers will also be prominently featured across all of our event listings and agendas and will receive social media promotion.\nIf this sounds up your alley, don’t wait. Put your brightest ideas together for a chance to inspire, educate, and shape the future of AI innovation. The clock is ticking — apply to speak bytonight at 11:59 p.m. PTbefore time runs out!\nIs your company interested in sponsoring or exhibiting at TechCrunch Sessions: AI? Contact our sponsorship sales team byfilling out this form.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2024/04/53679979052_da1066fe91_o.jpg?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/06/google-co-founder-larry-page-reportedly-has-a-new-ai-startup/",
        "date_extracted": "2025-03-14T13:37:23.305733",
        "title": "Google co-founder Larry Page reportedly has a new AI startup",
        "author": null,
        "publication_date": null,
        "content": "Google co-founder Larry Page is building a new company called Dynatomics that’s focused on applying AI to product manufacturing,according to The Information.\nPage is reportedly working with a small group of engineers on AI that can create “highly optimized” designs for objects and then have a factory build them, per The Information. Chris Anderson, previously the CTO of Page-backed electric airplane startup Kittyhawk, is running the stealth effort, The Information reports.\nPage isn’t the only entrepreneur exploring ways AI could be used to improve manufacturing processes (although he might beone of the richest).\nOrbital Materialsis creating an AI platform that can be used to discover materials ranging from batteries to carbon dioxide-capturing cells.PhysicsXprovides tools to run simulations for engineers working on project areas like automotive, aerospace, and materials science. Elsewhere,Instrumentalis leveraging vision-powered AI to detect factory anomalies.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/06/scale-ai-is-being-investigated-by-the-us-department-of-labor/",
        "date_extracted": "2025-03-14T13:37:26.004083",
        "title": "Scale AI is being investigated by the US Department of Labor",
        "author": null,
        "publication_date": null,
        "content": "The U.S. Department of Labor (DOL) is investigating the data-labeling startup Scale AI for compliance with the Fair Labor Standards Act, TechCrunch has learned.\nThat’s a federal law that regulates unpaid wages, misclassification of employees as contractors, and illegal retaliation against workers.\nThe investigation has been active since at least August 2024, a document seen by TechCrunch shows. And it’s ongoing, according to a person directly familiar with the matter.\nThe mere existence of an investigation doesn’t mean Scale AI has done anything wrong, of course, and the investigation could find in favor of the company or be dismissed.\nScale AI is based in San Francisco andwas valued last year at $13.8 billion. It relies on an army of workers it categorizes as contractors to do essential AI work, like labeling images for Big Tech and other organizations.\nScale AI spokesperson Joe Osborne told TechCrunch that the investigation was initiated during the previous presidential administration and that Scale AI felt that its work building, testing, and evaluating AI was misunderstood by regulators then.\nOsborne said that Scale AI has worked extensively with the DOL to explain its business model and that conversations have been productive. More generally, Osborne said that Scale AI brings more “flexible work opportunities in AI” to Americans than any other company and that feedback from its contributors is “overwhelmingly positive.”\n“Hundreds of thousands of people use our platform to showcase their skills and earn extra money,” Osborne said.\nScale AI is indeed a popular gig work platform. But it has recently faced legal challenges from some ex-workers over its labor practices.Two lawsuits were filedagainst the startup — one in December 2024 and the other in January 2025 — from former workers alleging they were underpaid and misclassified as contractors instead of employees, denying them access to protections like overtime pay and sick days.\nScale AI has strongly disputed the lawsuits, saying that it fully complies with the law and works to ensure its pay rates meet or surpass local living wage standards.\nScale AI’s international labor practices were also the subject of an investigation by theWashington Post in 2023. Workers overseas described to the Post demanding work at low pay as contractors. The company said at the time that pay rates were continually improving.\nThe U.S. Department of Labor’swebsitesays it is able to resolve most cases administratively but that employers who violate the law may be subject to fines and potentially imprisonment. The DOL also has the power to force employers to reclassify their workers as employees.\nFor example, in February 2024, hotel staffing startup Qwick settled a DOL case by paying $2.1 million and announcing that all California workers performing work using the Qwick app would be classified as employees, Bloomberg Lawreported.\nScale AI also appears to be among the Silicon Valley firms seeking and seeing favor with the new presidential administration. Its CEO and founder Alexandr Wang, for instance,attendedDonald Trump’s inauguration in Januarylike many other tech CEOs.\nMore telling, Scale AI’sformer managing director, Michael Kratsios, is President Trump’s nominee as new director of the White House’s Office of Science and Technology Policy. Kratsios previously served as the U.S.’s chief technology officer during the first Trump administration.\nIn this position, Kratsios will advise Trump on science and technology matters. This position has no oversight over the Department of Labor. Kratsios was part of a Senatehearingon February 25 but has not been confirmed yet. Kratsios didn’t respond to a request for comment.\nU.S. Department of Labor spokesperson Michael Petersen told TechCrunch that it cannot confirm or deny the existence of any investigation, per long-standing policy.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/06/shield-ai-raises-240-million-at-a-5-3-billion-valuation-to-commercialize-its-ai-drone-tech/",
        "date_extracted": "2025-03-14T13:37:29.348821",
        "title": "Shield AI raises $240M at a $5.3B valuation to commercialize its AI drone tech",
        "author": null,
        "publication_date": null,
        "content": "Shield AI, the San Diego defense tech startup that builds drones and other AI-powered military systems, has raised a $240 million round at a $5.3 billion valuation,it announced today.\nShield AI says its Hivemind software already enables fighter jets and drones to fly autonomously. Now, Shield AI wants to sell Hivemind to a broader range of customers like robotics companies.\nThe round’s investors include L3Harris, one of the U.S.’s biggest defense contractors, and Hanwha Aerospace. Existing investors like Andreessen Horowitz also joined.\nThis makes Shield AI the second-largest defense tech startup in the U.S. by valuation, after Anduril, which israising at a $28 billion valuation.\nAutonomy is a hot field in defense, with autonomous warship startup Saronicquadrupling its valuation to $4 billionin a $600 million round last month.\nShield AI didn’t immediately respond to a request for comment.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/06/what-is-mistral-ai-everything-to-know-about-the-openai-competitor/",
        "date_extracted": "2025-03-14T13:37:33.616347",
        "title": "What is Mistral AI? Everything to know about the OpenAI competitor",
        "author": null,
        "publication_date": null,
        "content": "Mistral AI, the French company behind AI assistant Le Chat and several foundational models, is officially regarded as one ofFrance’s most promising tech startupsand isarguably the only European company that could compete with OpenAI. But compared to its $6 billion valuation, its global market share is still relatively low.\nHowever, the recent launch of its chat assistant on mobile app stores was met with some hype, particularly in its home country. “Go and download Le Chat, which is made by Mistral, rather than ChatGPT by OpenAI — or something else,” French president Emmanuel Macron saidin a TV interviewahead of the AI Action Summit in Paris.\nWhile this wave of attention may be encouraging, Mistral AI still faces challenges in competing with the likes of OpenAI — and in doing so while keeping up with its self-definition as “the world’s greenest and leading independent AI lab.”\nMistral AI has raised significant amounts of funding since its creation in 2023 with the ambition to “put frontier AI in the hands of everyone.” While this isn’t a direct jab at OpenAI, the slogan is meant to highlight the company’s advocacy for openness in AI.\nIts alternative to ChatGPT, chat assistant Le Chat, is now alsoavailable on iOS and Android. It reached1 million downloadsin the two weeks following its mobile release, even grabbing France’s top spot for free downloads on the iOS App Store.\nThis comes in addition to Mistral AI’s suite of models, which includes:\nIn March 2025, the companyintroduced Mistral OCR, an optical character recognition (OCR) API that can turn any PDF into a text file to make it easier for AI models to ingest.\nMistral AI’s three founders share a background in AI research at major U.S. tech companies with significant operations in Paris. CEO Arthur Mensch used to work at Google’s DeepMind, while CTO Timothée Lacroix and chief scientist officer Guillaume Lample are former Meta staffers.\nCo-founding advisers also includeJean-Charles Samuelian-Werve(also a board member) and Charles Gorintin from health insurance startup Alan, as well as former digital minister Cédric O, whichcaused controversydue to his previous role.\nNot all of them. Mistral AI differentiates its premier models, whoseweightsare not available for commercial purposes, from its free models, for which it provides weight access under the Apache 2.0 license.\nFree models include research models such as Mistral NeMo, which was built in collaboration with Nvidia that the startupopen-sourcedin July 2024.\nWhile many of Mistral AI’s offerings are free ornow have free tiers, Mistral AI plans to drive some revenue from Le Chat’s paid tiers. Introduced in February 2025, Le Chat’s Pro plan is priced at $14.99 a month.\nOn the purely B2B side, Mistral AI monetizes its premier models through APIs with usage-based pricing. Enterprises can also license these models, and the company likely also generates a significant share of its revenue from its strategic partnerships, some of which it highlightedduring the Paris AI Summit.\nOverall, however, Mistral AI’s revenue is reportedly still in the eight-digit range, according to multiple sources.\nIn 2024, Mistral AI entered a deal with Microsoft that included a strategic partnership for distributing its AI models through Microsoft’s Azure platform and a €15 million investment. The U.K.’s Competition and Markets Authority (CMA)swiftly concludedthat the deal didn’t qualify for investigation due to its small size. However, it also sparked somecriticismin the EU.\nIn January 2025, Mistral AIsigned a deal with press agency Agence France-Presse(AFP) to let Chat query the AFP’s entire text archive dating back to 1983.\nMistral AI also secured strategic partnerships with France’sarmyandjob agency, German defense tech startupHelsing,IBM,Orange, andStellantis.\nAs of February 2025, Mistral AI raised around €1 billion in capital to date, approximately $1.04 billion at the current exchange rate. This includes some debt financing, as well as several equity financing rounds raised in close succession.\nIn June 2023, and before it even released its first models, Mistral AI raised arecord $112 million seed roundled by Lightspeed Venture Partners. Sources at the time said the seed round —Europe’s largest ever— valued the then-one-month-old startup at $260 million.\nOther investors in this seed round included Bpifrance, Eric Schmidt, Exor Ventures, First Minute Capital, Headline, JCDecaux Holding, La Famiglia, LocalGlobe, Motier Ventures, Rodolphe Saadé, Sofina, and Xavier Niel.\nOnly six months later, it closeda Series A of €385 million($415 million at the time), at a reported valuation of $2 billion. The round was led by Andreessen Horowitz (a16z), with participation from existing backer Lightspeed, as well as BNP Paribas, CMA-CGM, Conviction, Elad Gil, General Catalyst, and Salesforce.\nThe$16.3 million convertible investmentthat Microsoft made in Mistral AI as part of their partnership announced in February 2024 was presented as a Series A extension, implying an unchanged valuation.\nIn June 2024, Mistral AI then raised€600 million in a mix of equity and debt(around $640 million at the exchange rate at the time). Thelong-rumored roundwas led by General Catalyst at a $6 billion valuation, with notable investors, including Cisco, IBM, Nvidia, Samsung Venture Investment Corporation, and others.\nMistral is “not for sale,”Mensch said in January 2025 at the World Economic Forum in Davos. “Of course, [an IPO is] the plan.”\nThis makes sense, given how much the startup has raised so far: Even a large sale may not provide high enough multiples for its investors, not to mention sovereignty concerns depending on the acquirer.\nHowever, the only way to definitely squash persistent acquisition rumors is to scale its revenue to levels that could even remotely justify its nearly $6 billion valuation. Either way, stay tuned.\nThis story was originally published on February 28, 2025 and will be regularly updated.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/06/intangible-ai-a-no-code-3d-creation-tool-for-filmmakers-and-game-designers-raises-4m/",
        "date_extracted": "2025-03-14T13:37:37.881979",
        "title": "Intangible, a no-code 3D creation tool for filmmakers and game designers, raises $4M",
        "author": null,
        "publication_date": null,
        "content": "Intangible, now backed by $4 million in seed funding, offers an AI-powered creative tool that allows users to create 3D world concepts with text prompts to aid creative professionals across a variety of industries.\nThe company’s mission is to make the creative process accessible to everyone, including professionals such as filmmakers, game designers, event planners, and marketing agencies, as well as everyday users looking to visualize concepts. For instance, everyday users could generate home design and small art projects using the tool.\nWith its new fundraise, Intangible plans a June launch for its no-code web-based 3D studio, it says.\nLeading Intangible isCharles Migos,a former lead designer for Apple’s first-party iPad apps (iBooks, Notes, and News) and the vice president of product design at Unity. His co-founder,Bharat Vasan, is an entrepreneur who previously co-founded Basis, a wearables companyacquiredby Intel.\nMigos conceived the idea after working at Unity, a platform used by millions of game developers. He wanted to build a tool forallcreatives that leveraged the power of generative AI.\n“Unity Editor is an incredible tool, but the people actually making the creative decisions aren’t using that tool,” Migos told TechCrunch. “With the advent of AI, I realized that it was going to be entirely possible to make 3D accessible to people who can’t now, and package that in a way where generative AI and 3D creation tools were designed for professional creatives,” he added.\nIntangible’s product is designed to make it easy for users to dive into 3D creation without needing to learn complex coding. By simply providing prompts, users can use AI to construct a comprehensive 3D world, designing a city or landscape from scratch.\nStarting with a 3D canvas editor, users can easily drag and drop elements from a library of around 6,000 3D assets, including people in different poses (like walking, running, or sitting), trees, roads, vehicles, and more.\nPlus, with storyboard capabilities, filmmakers can also manipulate camera angles and organize scenes in order.\nAfter the initial design phase, users can switch to “Visualizer mode,” which uses AI image generation to render the scene more vividly. Intangible leverages DeepSeek, Llama, and Stable Diffusion, among others.\nAdditionally, Intangible has a collaboration capability. Teams can share links to their web-based projects and work together in real-time, gathering feedback and making adjustments on the fly.\nIntangible is currently in closed beta, and users can apply for early access. The company reports that it has already attracted interest from “hundreds” of creatives, including major film and gaming studios. (Specific names will be announced later, the startup says.)\nIn June, Intangible will officially launch, offering both a free tier and paid subscription options, ranging from $15 to $50 per month. Users will also have the option to purchase additional credits for image and video generation.\na16z Speedrun, Crosslink Capital, and several angel investors led the recent funding round.\nThe capital raised will be allocated not only for product development but also for hiring. The company currently has a team of 10 people, including Philip Metschan, the lead product designer who previously worked at Pixar and ILM. Intangible plans to double its team size this year.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/Intangible-AI-GIF.gif?w=640",
            "https://techcrunch.com/wp-content/uploads/2025/03/IntangibleDragon.png?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/06/google-deepmind-cohere-and-twelve-labs-explain-how-founders-can-build-with-their-ai-models-at-tc-sessions-ai/",
        "date_extracted": "2025-03-14T13:37:42.267170",
        "title": "Google DeepMind, Cohere, and Twelve Labs explain how founders can build with their AI models at TechCrunch Sessions: AI",
        "author": null,
        "publication_date": null,
        "content": "There seems to be a new, more impressive AI model every week. Given the rapid pace, how can founders best position themselves to build on top of this technology? AtTechCrunch Sessions: AI, on June 5 in Zellerbach Hall at UC Berkeley, we’ll host a panel on “How Founders Can Build on Existing Foundational Models” to answer some existential questions facing AI startups.\nWe’re thrilled to have leaders from Google DeepMind, Cohere, and Twelve Labs — three companies at the forefront of AI model development — to help us answer some of these questions.\nAttendees can hear straight from the source about what AI model developers are trying to build next, how AI models are improving, and where startup founders should (and shouldn’t) be building. If you want to learn how to grow with the AI model developers, and not get squashed by them or left behind, this is the panel for you.\nTC Sessions: AIwill be joined by Logan Kilpatrick, senior product manager at Google DeepMind. Kilpatrick leads product for Google AI studio and helps developers build on top ofGoogle Gemini,one of the industry’s top performing AI models. Kilpatrick previously led developer relations at OpenAI.\nWe’ll also be joined by Sara Hooker, the head of Cohere for AI — the AI research lab inside one of Silicon Valley’s hottest AI startups,Cohere. Specializing in AI for enterprise, Cohere has a unique insight into how businesses are using AI foundation models today. Hooker is a widely respected AI researcher who spent many years at Google, and she was named one of Time’s 100 most influential people in AI in 2024.\nFinally, our panel will feature Jae Lee, the founder and CEO ofTwelve Labs, a startup building AI foundation models that can analyze and search through videos. Twelve Labs — which is backed by Nvidia, Samsung, and Intel — is building AI models that can help you find exact moments in videos, just by asking for them in plain English. The startup has raised more than $100 million to date, and its backers believe its video models will create new businesses and use cases for AI in the video world.\nThere’s a lot of money pouring into AI startups these days, but not all of them will survive. One of the keys to success is learning where the industry is going next. Join us and 1,200 fellow AI leaders and enthusiasts for what’s sure to be a fascinating discussion at TC Sessions: AI. Tickets are available now at Early Bird rates, saving you up to $210.Register here to save.\nCalling all AI experts! Time is running out —apply here by tomorrow, March 7, to join the conversation with leading tech innovators and entrepreneurs. This is your opportunity to showcase your expertise and shape the future of AI.\nIs your company interested in sponsoring or exhibiting at TechCrunch Sessions: AI? Contact our sponsorship sales team byfilling out this form.\nSign up for the TechCrunch Events newsletterand be the first to grab special promotions.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/Logan-Kilpatrick.jpeg?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/03/Sara-Hooker_headshot.jpg?w=510",
            "https://techcrunch.com/wp-content/uploads/2025/02/Jae-Lee-Headshot-1080x1080-1.png?w=680"
        ]
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/06/turing-a-key-coding-provider-for-openai-and-other-llm-producers-raises-111m-at-a-2-2b-valuation/",
        "date_extracted": "2025-03-14T13:37:45.049711",
        "title": "Turing, a key coding provider for OpenAI and other LLM producers, raises $111M at a $2.2B valuation",
        "author": null,
        "publication_date": null,
        "content": "As AI companies race to improve the accuracy of large language models (LLMs) and apps built on top of them, a startup that has emerged as a key partner in that effort is announcing a significant round of funding.Turing, which works with armies of engineers to contribute code to AI projects — including assisting in the building of LLMs for OpenAI and others, as well as creating generative AI apps for enterprises — has secured a $111 million Series E round, doubling its valuation to $2.2 billion.\nTuring currently generates around $300 million in ARR (annualized revenue run rate), and when this latest round was priced, it stood at $167 million. That means the company is growing fast. It has also been profitable for around a year, according to CEO Jonathan Siddharth, who tells TechCrunch the company plans to use the funding to expand its business to more customers and broaden its use cases.\nTuring today says that it works with some 4 million coders around the world. The actual number of Turing employees is much smaller — it’s a figure in the hundreds, one of its investors said.\nMalaysia’s sovereign wealth fund Khazanah Nasional Berhad is leading the new round, with participation also from WestBridge Capital, Sozo Ventures, UpHonest Capital, AltaIR Capital, Amino Capital, Plug and Play, MVP Ventures, Fortius Ventures, Gaingels, and Mastodon Capital Management. Palo Alto-based Turing has raised $225 million to date.\nTuring’s turn as a major partner to AI companies was not how the company got its start. Originally, it was effectively an HR tech startup.\nSpecifically, its early product was a platform for vetting and hiring remote coders, a business thatstarted to take offduring the COVID-19 pandemic, as the world sought better tools to source and manage remote teams. That business was strong enough to catapult the company to “unicorn” status, impressing both customers and investors.\n“When I first met them in 2018 my jaw dropped,” Sumir Chadha, a co-founder and managing partner at WestBridge, said in an interview, referring to how Siddharth seemingly upended the whole management consultancy and offshoring model. “You don’t need any of that. You don’t even need an HR staff. You can do it all with Turing and remote engineers.”\nIt was also strong enough to start catching a different kind of attention.\nAs aSemaforreport from last year recounts, Siddharth was summoned in 2022 to OpenAI for a meeting, which he thought would be to talk about recruiting engineers for the startup. Instead, it turned out to be a proposition. OpenAI researchers had discovered that code added into training datasets helped improve the model’s reasoning capabilities, and it wanted Turing’s help to generate that code.\nSiddharth obliged and that set off a whole new business focus for the startup, which he says now works with a number of foundational AI companies to provide similar services, as well as with companies that build apps on top of those LLMs.\n“We could not have predicted the ChatGPT moment,” he said this week, and he couldn’t have predicted how the infrastructure he built for hiring coders would place Turing itself into the middle of the action. “I don’t think people knew how important software engineering tokens [would be] to teach an LLM to think and reason and code.”\nBut it hasn’t been a pivot. Siddharth was quick to correct me when I used the word, and he pointed out that Turing still generates substantial revenue from its older business sourcing coding talent, although he would not disclose how much.\n“They are all growing,” he said of the different business lines. “We are stepping on the gas to scale up R&D, and scale up sales and marketing across all three businesses. We are in rapid expansion mode.”\nHowever, the main focus in terms of new business, it seems, will be to continue doubling down on its work in AI as a coding provider for the building of future LLMs — a division Turing optimistically calls “Turing AGI Advancement” — and in its work on apps and services built on those LLMs — under the banner of “Turing Intelligence.”\nUpdated to include a more recent ARR figure.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/05/alpine-eagle-secures-funding-from-european-backers-for-counter-drone-tech-amid-rising-threats/",
        "date_extracted": "2025-03-14T13:37:48.510048",
        "title": "Alpine Eagle secures funding from European backers for counter-drone tech amid rising threats",
        "author": null,
        "publication_date": null,
        "content": "The war in Ukraine has brought drones to the forefront of modern warfare, creating a surge in demand for counter-drone systems.\nHowever, legacy solutions to counter drones, such as ground-based defense systems and cyber warfare, often come with a hefty price tag. For German startupAlpine Eagle, these solutions fall short: When now-ubiquitous $500 first-person-view (FPV) drones have the capacity to destroy multi-million-dollar tanks, cost-effective answers are needed.\n“We use inexpensive, mass-producible systems to establish a symmetry against the numerical advantage of cheap strike drones,” Dutch entrepreneur Jan-Hendrik Boelens told TechCrunch. Munich-based Alpine Eagle, which he co-founded in 2023, develops Sentinel, a mix of software and hardware focused on cost-efficiency.\nUnlike ground-based competing solutions, such asHover’s counter-drone turret, Sentinel is airborne, with modular sensors that aren’t hindered by terrain and other obstacles, while avoiding becoming a stationary target.\nIts mothership, which is sophisticated but not meant to be expendable, carries kamikaze interceptors that also help it do more than detecting threats or jamming them: They can either capture objects with nets or destroy hostile drones altogether.\nWhile potential applications exist in law enforcement and other sectors, the current geopolitical climate has driven demand for this technology, primarily in the military. The Munich-based startup secured the German army as its launch customer, in addition to other government agencies, and said it achieved seven-digit revenue in the first 12 months of operation.\nThis helped it close a €10.25 million (around $10.96 million) seed round led by British deep tech VC firmIQ Capital. The new funding will help the startup expand its current team of machine learning practitioners and aeronautical engineers, with new hires across product, engineering, business development, and sales bringing its headcount to 40.\nThe fact that the round is led by a British VC firm is no coincidence, as the startup will have the U.K. as a key market in its expansion. That’s also because its market goes beyond battlefields, withrecent eventsalso highlighting the need to protect military bases and broader infrastructure.\nStill, there’s no doubt that Alpine Eagle is part of the rise of European defense tech, and ofVC interest in the sector, especially in countries that feel the most at threat.\nIn addition to returning investors General Catalyst and HCVC, its cap table now also includes funds from Estonia, Germany, and Poland. “We were looking for a consortium of European investors that share both the urgency for building [a] European defense tech ecosystem and that are located in key countries,” Boelens said.\nDespite this sense of urgency, Boelens didn’t want to rush Sentinel’s entry into Ukraine. “Our approach there was to make sure that we first have a mature system to deliver to them so that we don’t waste their time with something that’s not working yet. We’ve seen too many startups doing that, and we felt we should only go there once the system is actually doing what it’s supposed to do.”\nAfter validating its system with the German army, it is now testing its system in Ukraine and talking to different brigades that helped identify use cases on the front line. One isfiber-optic drones; using cables instead of radio frequency makes them harder to detect or jam.\nDrones that are immune to RF interference can be a challenge even for Epirus, the U.S. defense tech startup co-founded by Joe Lonsdale that just raiseda $250 million Series Dand whose flagship product Leonidas beams high-powered microwaves.\nIn contrast, Alpine Eagle’s airborne system can integrate various sensors, including radar panels to detect low-flying drones that often evade ground-based systems.\nJamming goes both ways, though. That’s one of the aspects in which Alpine Eagle is using AI, with data processing done onboard the hardware itself for navigation purposes, as well as data collection in order to retrain its algorithms “to have more adaptive tactics based on what they’ve actually perceived in reality.”\nOne key tactical aspect of Sentinel is swarming, which is also a selling point of thelatest drone modelsfrom German defense tech company Helsing. Applying it to counter drone strategies follows the same logic of limiting costs and casualties, with modern warfare that is increasingly unmanned.\n“We realized that all Western powers have the problem of not having enough soldiers, so we try to build a system where many, many drones can be operated by a single operator by using high automation levels and really promoting the soldier to a mission manager rather than a pilot,” Boelens said.\nThis article has been updated to correct the round’s stage; it is a seed round, not a Series A.",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/05/revenue-prediction-startup-gong-surpasses-300m-arr-indicating-potential-ipo-path/",
        "date_extracted": "2025-03-14T13:37:53.002963",
        "title": "Revenue prediction startup Gong surpasses $300M in annualized revenue, indicating potential IPO path",
        "author": null,
        "publication_date": null,
        "content": "Gong, a startup that helps companies predict their revenue from potential sales, has surpassed $300 million in annualized recurring revenue, the company announced on Wednesday.\nSince its founding in 2016, Gong has used AI to analyze customer interactions. The addition of generative AI capabilities in recent years has helped to fuel the company’s growth.\n“We’re seeing great momentum. That’s why we’re excited to share the numbers,” Gong CEO Amit Bendov told TechCrunch.\nGong waslast valued at $7.25 billionwhen it raised a $250 million Series E in 2021 in a deal led by Franklin Templeton with participation from Coatue, Salesforce Ventures, Sequoia, Thrive Capital, and Tiger Global.\nMany companies funded in 2020 and 2021 received inflated valuations relative to their revenue and have since struggled to justify them.\nAssuming that Gong is still valued at $7.25 billion, the latest ARR figure implies that the company is now valued at roughly 24 times ARR and puts Gong in the same bucket as some of the largest, most watched AI companies.\nBut Gong’s valuation may still be elevated relative to certain newer, exceptionally fast-growing AI startups. For instance, Anysphere, the maker of the AI-powered coding assistant Cursor, was recently valued at25 times ARR. Anysphere reached $100 million in ARR from low-single millionsin less than a year. (Investors typically assign higher valuation multiples to startups with faster growth rates.)\nAlthough Bendov didn’t share Gong’s revenue growth, he said it’s in the range of “top-quartile public SaaS companies.” (TheBessemer Ventures Cloud Indexindicates that top cloud companies have annual revenue growth rates between 25% and 56%.) It counts among its 4,500 corporate customers’ companies like Canva, Google, LinkedIn, and Square, Bendov said.\nGong’s current ARR and growth trajectory likely puts the company on the path to IPO, and Bendov admitted that a public offering would be an important milestone but said it’s not in the works for 2025. “[An IPO] is very interesting but not the most important thing. We are focusing on building amazing products,” he said.\nIf not an IPO, as for raising another round from venture sources, Bendov said that Gong is nearly profitable and still has plenty of cash from its 2021 round. “We almost haven’t touched it.”",
        "tags": [],
        "images": []
    },
    {
        "category": "Startups",
        "url": "https://techcrunch.com/2025/03/05/not-all-cancer-patients-need-chemo-ataraxis-ai-raised-20m-to-personalize-treatment/",
        "date_extracted": "2025-03-14T13:37:57.747000",
        "title": "Not all cancer patients need chemo — Ataraxis AI raised $20M to personalize treatment",
        "author": null,
        "publication_date": null,
        "content": "Artificial intelligence is a big trend in cancer care, and it’s mostly focused on detecting cancer at the earliest possible stage. That makes a lot of sense, given that cancer is less deadly the earlier it’s detected.\nBut fewer are asking another fundamental question: If someone does have cancer, is an aggressive treatment like chemotherapy necessary? That’s the problem Ataraxis AI is trying to solve.\nThe New York-based startup is focused on using AI to accurately predict not only if a patient has cancer, but also what their cancer outcome looks like in five to 10 years. If there’s only a small chance of the cancer coming back, chemo can be avoided altogether — saving a lot of money, while avoiding the treatment’s notorious side effects.\nAtaraxis AI now plans to launch their first commercial test, for breast cancer, to U.S. oncologists in the coming months, its co-founder Jan Witowski tells TechCrunch. To bolster the launch and expand into other types of cancer, the startup has raised a $20.4 million Series A, it told TechCrunch exclusively.\nThe round was led by AIX Ventures with participation from Thiel Bio, Founders Fund, Floating Point, Bertelsmann, and existing investors Giant Ventures and Obvious Ventures. Ataraxisemergedfrom stealth last year with a $4 million seed round.\nAtaraxis was co-founded by Witowski and Krzysztof Geras, an assistant professor at NYU’s medical school who focuses on AI.\nAtaraxis’ tech is powered by an AI model that extracts information from high-resolution images of cancer cells. The model is trained on hundreds of millions of real images from thousands of patients, Witowski said. A recent study showed Ataraxis’ tech was 30% more accurate than the current standard of care for breast cancer, per Ataraxis.\nLong term, Ataraxis has big ambitions. It wants its tests to impact at least half of new cancer cases by 2030. It also views itself as a frontier AI company that builds its own models, toutingMeta’s chief AI scientist Yann LeCunas an AI adviser.\n“I think at Ataraxis we are trying to build what is essentially an AI frontier lab, but for healthcare applications,” Witowski said. “Because so many of those problems require a very novel technology.”\nThe AI boom has led to a rush of fundraises for cancer care startups. Valar Labsraised $22 millionto help patients figure out their treatment plan in May 2024, for example. There’s also a bevy of AI-powered drug discovery firms in the cancer space, like Manas AI, whichraised $24.6 million in January 2025and was co-founded by Reid Hoffman, the LinkedIn co-founder.",
        "tags": [],
        "images": []
    }
]