[
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/13/y-combinators-police-surveillance-darling-flock-safety-raises-275m-at-7-5b-valuation/",
        "date_extracted": "2025-03-14T13:23:23.364478",
        "title": "Y Combinator’s police surveillance darling Flock Safety raises $275M at $7.5B valuation",
        "author": null,
        "publication_date": null,
        "content": "Flock Safetyand one of its long-time VCs, Bedrock Capital,announcedThursday that the startup raised a fresh $275 million at a $7.5 billion valuation.\nFlock makes computer vision-enabled video surveillance technology used by law enforcement as well as businesses, property management companies, and so on. It’s best known for itsautomatic license plate recognition tech, but Flock also makes gunshot detection tech marketed to schools, and recentlyacquired public safety drone company Aerodome.\nFlock was founded in 2017 and went through Y Combinator that same year. Growth exploded in the subsequent years. Flock crossed over $300 million in annual recurring revenue last year, which is 70% year-over-year growth, Flock spokesperson Holly Beilin told TechCrunch.\nThe Atlanta-based startup has now raised over $950 million in total funding,according to PitchBook data, and its last valuation a year ago was $4.8 billion. Return investors Andreessen Horowitz, Greenoaks, Meritech Capital, Matrix Partners, and Y Combinator participated in this round.\nGiven that it makes surveillance tech, Flock has unsurprisingly had its share of controversies. For instance, theACLU cited concerns with Flockover the kind of mass surveillance it enables and, a year ago, urged the company to allow independent review of its products. Privacy advocates in Norfolk, Virginiaare currently suingto stop Flock from being deployed there.\nFlock is also facing a wrongful termination lawsuit from a sitting mayor of a small California town,as TechCrunch recently reported.\nThat said, Flock has been a VC darling for years.\nFor instance, Bedrock’s founder, Geoff Lewis, recounted how he flew to Atlanta in 2018 to beg Flock co-founder Garrett Langley (pictured above) to take a $10 million Series A-1, one of the first checks from Lewis’ new firm. But Langley had just closed Flock’s Series A.\nThat deal was a “totally insane” $60 million valuation, asBedrock described it— about triple the valuation of the A round just a few months earlier. Langley took the money — and has gone on to take more than $164 million in investments from Bedrock since.\nBy the way, Lewis, who hailed from Founders Fund, now has other big names in Bedrock’s portfolio, like OpenAI, Rippling, andMach Industries.\nMeanwhile, a16z’s American Dynamism fund lead, David Ulevitch, led other rounds for Flock. “Beyond protecting property, Flock Safety is literally helping to save lives,” Ulevitch and a16z growth VC David Georgeopinedin 2021.\nYC’s Garry Tan took to LinkedIn justa few months agoto applaud the success rate Flock claims it has achieved in fighting crime.But it’s Flock’s revenue growth, in addition to its public safety products, that’s caused investors to “continue to double and triple down on Flock,” Beilin said.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/13/y-combinator-urges-the-white-house-to-support-europes-digital-markets-act/",
        "date_extracted": "2025-03-14T13:23:26.220093",
        "title": "Y Combinator urges the White House to support Europe’s Digital Markets Act",
        "author": null,
        "publication_date": null,
        "content": "Y Combinator, one of the world’s most prolific startup accelerators, sent a letter on Wednesday urging the Trump administration to openly support Europe’s Digital Markets Act (DMA), a wide-ranging piece of legislation thataims to crack open Big Tech’s market power.\nThe DMA designates six tech companies as “gatekeepers” to the internet — Alphabet, Amazon, Apple, ByteDance, Meta, and Microsoft — and limits these technology kingpins from engaging in anticompetitive tactics on their platforms, in favor of interoperability. The law became applicable in May 2023, and it’salready had a major impact on American tech companies.\nIn a letter to the White Houseposted on Xby YC’s head of Public Policy, Luther Lowe, the startup accelerator argued that the DMA shouldn’t be lumped in with other European tech legislation, which U.S. officials often criticize as being overbearing.\nInstead, YC argues in the letter that the spirit of Europe’s DMA is in line with values that promote — not hinder — American innovation.\n“[W]e respectfully urge the White House to recalibrate its stance toward Europe’s digital regulation, drawing a clear line between measures that hamper innovation and those that foster it,” states YC’s letter, which was also signed by YC-backed startups, independent tech companies, and trade associations.\nIt’s not entirely surprising that YC would come out in explicit public support of the DMA. After all, the accelerator markets itself as a champion of “Little Tech” — an American venture-backed ecosystem of technology startups.\nYC argues in the letter that the DMA opens up key avenues to create opportunities for American startups in AI, search, and consumer apps, and prevents Big Tech companies from boxing out smaller ventures.\nSpecifically, YC in its letter points to Applereportedly delaying its LLM-powered version of Siri until 2027, years after competitors brought generative AI voice assistants to market. YC argues this represents a lack of competitive pressure, noting that third-party developers of AI voice assistants are unable to integrate their services into Apple’s operating systems\nYC might take Big Tech to task for its reported anticompetitive behavior and take shots at companies like Apple, which it argues harms the venture-backed startup ecosystem. But YC and other supposedly Little Tech-aligned VCs are actually becoming quite influential in Washington.\nAndreessen Horowitz (a16z), which published a “Little Tech Agenda” last year, spends millions of dollars trying to influence policy battles at the federal and local levels. According to data fromOpen Secrets, a16z’s contributions during the 2024 U.S. election cycle totaled $89 million. YC, still a smaller player in American politics,contributed around $2 million.\nWhat’s less clear here is how the Trump administration will respond to the DMA in the long run — and YC’s endorsement of it.\nPresident Trump signaled in January that he wouldprotect American tech companies from overzealous European regulators. However, Trump has alsohistorically been tough on Big Tech firmslike Apple, Google, and Meta.\nDuring the Paris AI Action Summit in February, Vice President J.D. Vance criticized a few of the EU’s laws against tech companies, including the Digital Services Act and General Data Protection Regulation. However, Vance didn’t mention the DMA, which more narrowly targets anticompetitive tech industry practices.\nLowe told TechCrunch last yearduring a StrictlyVC eventthat the DMA is “not perfect, but at least they’re taking a stab at figuring out how do we curb the most egregious forms of self-preferencing by these large firms.”\nLowe did not immediately respond to TechCrunch’s request for comment.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/13/techcrunch-all-stage-unveils-a-powerhouse-agenda-for-founders/",
        "date_extracted": "2025-03-14T13:23:28.989494",
        "title": "TechCrunch All Stage unveils a powerhouse agenda for founders",
        "author": null,
        "publication_date": null,
        "content": "TechCrunch All Stage(formerly Early Stage) returns toBoston on July 15, and the agenda for our tentpole East Coast founder event is almost complete. We’re excited to share this sneak peek at some of the fantastic speakers and sessions we have on tap.\nFor builders who are just starting on their founder journey, ourFoundation Stageis absolutely the place to be. We’re enlisting a stellar cast of leading investors and entrepreneurs to dig deep into founder-focused topics such as:\nNew for 2025, we’re calling all growth-stage founders and startups for a full-day track dedicated to advice on how to scale your company from Series A and beyond. On theScale Stage, you can check out:\nTC All Stageis unlike any other TechCrunch event. Instead of panels and fireside chats, speakers present their areas of expertise and then answer your questions. As always, all attendees get transcripts and visual assets from the presentations, so you can take what you learn with you!\nAnd if you’re the chatty type, you’ll enjoy the roundtable discussions and our networking platform Braindate for lots of time to mingle with other founders, builders, and investors. You have loads of founder questions, and we’ll have the answers for you. More topics will be announced soon.\nSo come down and hang with us on July 15 in Boston andgrab your early-bird pass to save up to $320. We’ll see you there!\nAll the Ways You Don’t Realize VCs Are Evaluating Your Company at Pre-Seed\nWith Charles Hudson, Managing Partner and Founder,Precursor Ventures\nMVP in the Age of AI: When to Bot and When to Not\nWith Chris Gardner, Partner,Underscore.vc\nThe TAM Myth: How the Best Startups Reshape Markets\nWith Jahanvi Sardana, Partner,Index Ventures\nHow to Craft a Killer Pitch Deck\nWith Tiffany Luck, Partner,NEA\nFounders selected to take part in this session will have four minutes to wow a panel of judges, including leading VCs, who will then provide feedback.Check the event pagesoon for how to apply!\nThe Operator’s Playbook for Building and Scaling Sustainable Companies\nWith Jon McNeill, CEO and Co-Founder,DVx Ventures\nHow to Raise for Series C and Beyond\nWith Cathy Cao, Partner,Sapphire Ventures\nMore agenda announcements are on the way, but the best way to experience TC All Stage is to be there in person. Whether you’re looking for hands-on founder insights or scouting the next big investment, this is the must-attend summit for founders and VCs of all stages. Join us on July 15 at SoWa Power Station in Boston—register now and save up to $320 on select tickets!\nGo beyond attending—exhibit your brand and innovation in front of 1,200 top AI minds. Space is limited, so don’t miss your chance to make an impact!Grab your exhibit table here before they run out.\nOr, explore sponsorship opportunities and activations at TC Sessions: AI. Get in touch with our team by fillingout this form.\nSubscribe to the TechCrunch Eventsnewsletter for early access to special deals and the latest event news.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2019/09/GettyImages-849201940.jpg?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/03/Cathy_Gao_Headshot.png?w=680"
        ]
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/13/could-europes-16b-deeptech-bet-be-a-path-to-autonomy-from-the-us/",
        "date_extracted": "2025-03-14T13:23:31.856403",
        "title": "Could deep tech serve as Europe’s  path to autonomy from the US?",
        "author": null,
        "publication_date": null,
        "content": "Amid geopolitical tensions and volatile markets, the question of Europe’s ability to weather the storms ahead, especially as President Trump seems intent on having his pound of tariffs from the continent, is looming large.\nBut an extensive new report claims deep tech is poised to become a key pillar of Europe’s security, defense, and future autonomy, in particular from the U.S.\nDeep tech attracted €15 billion ($16.3 billion) in venture investments in 2024, according to a 184-page report by venture firms Lakestar, Walden Catalyst, Dealroom, and the deep tech conference Hello Tomorrow. The report also found that nearly one-third of all venture capital invested in Europe is now going to deep tech.\nM&A activity in the space increased to $12.2 billion last year, the report said, but it also found that European deep tech startups still rely on the U.S. for exits. Furthermore, 50% of the growth capital raised by deep tech startups comes from outside the continent.\nStill, deep tech could also be seen as a hedge against normal “momentum investing” among venture capitalists, said the report.\nThe report’s co-author, Lukas Leitner, also a deep tech investor at Lakestar, told TechCrunch that while geopolitical tensions pose significant challenges, Europe needs to embrace the moment, and deep tech could be the key that unlocks future resilience for the continent.\nHowever, the road ahead is not without challenges. The U.S. has a “flywheel effect” in deep tech while Europe’s ecosystem is still immature, Leitner noted. “We have a flywheel in the ‘shallow’ tech scene. You see a lot of second-time founders, coming out of Revolut and so on, building great companies. But not yet from deep tech companies.”\n“Europe has strong research institutions, engineering talent, and supportive public sentiment for deep tech, but there need to be policy changes to foster a culture that supports taking risks,” he added.\nArnaud de la Tour, the CEO of Hello Tomorrow, said that the notion that compute-poor Europe would always lag in AI was recently challenged by the appearance of open source DeepSeek: “It’s a huge opportunity for Europe, because we have great AI talent … Many are looking to come back to Europe because of the geopolitical landscape. But we definitely need to have the right policy framework in order to unlock the kind of potential that we have.”\nLeitner pointed out that Europe’s relative weakness in computing power is offset by its strengths in photonics computing, which offers major advantages in speed and efficiency. “We’re really good in Europe with photonics, because we have good laser systems, and we have good fundamental research on the photonic side,” he said.\nDe la Tour added that Europe could also take advantage of a brain drain in the U.S. as science is defunded by the Trump administration. “The National Science Foundation, which is the biggest supporter of founder-applied research in the U.S. has had its budget cut by half. A lot of those great scientists don’t have a job anymore, and many could come to Europe,” he said.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/Deeptech-Europe-2024.jpeg?w=680"
        ]
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/12/vento-hopes-new-e75m-fund-for-italian-founders-anywhere-will-kick-italys-ecosystem-into-life/",
        "date_extracted": "2025-03-14T13:23:34.734336",
        "title": "Vento rolls out new €75M fund for Italian founders, no matter where they live",
        "author": null,
        "publication_date": null,
        "content": "Over the last 15 years or so, as European venture capital shifted into a higher gear, one way to help a nation’s ecosystem flourish was to invest in founders from that country, regardless of where they were based. This would help re-patriate the entrepreneurial mindset back home. In Europe, the approach was pioneered in part by Paris-basedKima Ventures. Now a new venture firm hopes to replicate that idea from Italy.\nVento, one of Italy’s most active private early-stage VCs, is launching its second fund, hard-capped at €75 million, specifically to back Italian startup founders at home and abroad.\nThe sector-agnostic fund originated from the organizers ofItalian Tech Week(ITW), held annually in Turin, which has hosted the likes of Sam Altman, Reid Hoffman, and Elon Musk, among others.\nThe event was originally launched by Fiat family scion John Elkann, chairman of Vento, as well as chairman of Stellantis (the parent company of Fiat) and Exor (the holding company of the Agnelli family, which controls Fiat and other assets).\nUnderstandably for someone of his status, Elkann has an extensive network both in Europe and Silicon Valley, which he helps bring to ITW. So it’s perhaps no coincidence that Vento’s Investment Committee includes such tech industry veterans as Diego Piacentini, Mike Volpi (formerly of Index Ventures), and Jean de La Rochebrochard. Ironically, Rochebrochard recently joined the very same Kima Ventures that Vento hopes to emulate, after being controversiallyremovedfrom Newwave, a French venture outfit, last year.\nTo date, Vento has already invested in 100 startups, including Bee, JetHR, and Qomodo. Fund II plans to invest in 375 investments over five years, said the company.\nDiyala D’Aveni, CEO of Vento, told TechCrunch over a call that “Italy is quite behind compared to other European countries, but we think the trajectory is the same as the others. So that’s why we’re doing this. Italian Tech Week is a way for us to bring people from outside of Italy, on the one side, to push incredible investors to meet Italian founders and see the potential of the Italian ecosystem, and inspire the talent in Italy to build their own companies. We think the fact that there are not many success stories in Italy is kind of preventing the ecosystem to grow.”\nAdded D’Aveni, “There’s no lack of capital. It’s a lack of companies, but we just need some success stories, and then the whole flywheel will kick off, and we will see what we saw in France.”\nItalian Tech Week feeds usefully into this strategy, allowing Vento to evaluate over 3,500 startups that apply to appear at the event, maintaining a selective 2.5% conversion rate with a standardized €150,000 ticket size, and with some follow-on investments being made.\nBut what was the problem with previous Italian tech founders that Elkann felt this fund would solve?\n“When we launched Vento’s first fund in 2022, we recognized that Italy’s technological and entrepreneurial potential was significantly underserved,” he told TechCrunch.\n“Italian founders have always demonstrated exceptional … entrepreneurial spirit, but the ecosystem was not there. Vento was created to address this gap by providing not just capital, but a comprehensive platform that combines direct investment, venture building, and network development through Italian Tech Week.”\nHowever, Italian company law is often considered less favorable to startup founders compared to U.K. or U.S. company vehicles. Does he expect the startups that Vento funds to be Italy-domiciled or will it be agnostic?\n“Our primary commitment is to identify exceptional Italian founders and support them in their global entrepreneurial journey,” he said. “Italy is making significant strides to become increasingly competitive in the international technology landscape, and we are confident that soon these regulatory differences between countries will become less and less relevant.”\nTo be fair, Italy’s tech scene is improving. According toDealroom data, venture capital investment in Italian startups totaled $5.72 billion across the last five years (2020 to 2024), a more than threefold increase from the previous five years, when it hit only $1.7 billion.\nD’Aveni added that there were already plans to reach out internationally: “We already have a network of founders outside of Italy who are sending us deals, as well as micro-communities of Italians in New York, London, Berlin, and Paris, among others.”",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/podcast/vc-aileen-lee-still-sees-the-most-promise-in-unsexy-tech/",
        "date_extracted": "2025-03-14T13:23:38.890217",
        "title": "No Title Found",
        "author": null,
        "publication_date": null,
        "content": "In this episode of StrictlyVC Download, TechCrunch Editor in Chief Connie Loizos is joined by Aileen Lee, the founder ofCowboy Ventures. Leecoined the term “unicorn”in a TechCrunch article all the way back in late 2013. In this conversation, they discuss the ongoing liquidity crisis in the startup ecosystem, the secondary market’s evolution, and how VCs and founders alike are grappling with the post-ZIRP era. Plus Lee shares what’s on the horizon for Cowboy Ventures and how she’s thinking about AI’s impact on job creation, automation, and new business models — while also giving listeners a glimpse into Cowboy’s own recent team changes.\nStrictlyVC Download posts every Tuesday. Subscribe onApple,Spotify,orwherever you listen to podcaststo be alerted when new episodes drop.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/12/tech-layoffs-2025-list/",
        "date_extracted": "2025-03-14T13:23:41.705247",
        "title": "A comprehensive list of 2025 tech layoffs",
        "author": null,
        "publication_date": null,
        "content": "The tech layoff wave is still kicking in 2025. Last year sawmore than 150,000 job cutsacross 549 companies, according to independent layoffs trackerLayoffs.fyi. So far this year, more than 22,000 workers have been the victim of reductions across the tech industry, with a staggering 16,084 cuts taking place in February alone.\nWe’re tracking layoffs in the tech industry in 2025 so you can see the trajectory of the cutbacks and understand the impact on innovation across all types of companies. As businesses continue to embrace AI and automation, this tracker serves as a reminder of the human impact of layoffs — and what could be at stake with increased innovation.\nBelow you’ll find a comprehensive list of all the known tech layoffs that have occurred in 2025, which will be updated regularly. If you have a tip on a layoff, contact ushere. If you prefer to remain anonymous, you can contact ushere.\nWill cut 22 jobs, affecting nearlya quarter of its total workforce,following the announcement of the AI startup’s strategicpartnership with Microsoft.\nAnnounced it will beshutting down several of its officesin accordance with Elon Musk’s DOGE, including its Office of Technology, Policy, and Strategy and the DEI branch in the Office of Diversity and Equal Opportunity.\nHas reportedly laid off some staff, according toLinkedIn posts from ex-employees.The company has not confirmed the layoffs, and it is currently unknown how many workers were affected.\nAnnounced plans tolet go of 340 employeesin its technology division as part of a new restructuring effort.\nWill cut2,500 employees,or 5% of its total staff, in response to its shares sliding 19% in the first fiscal quarter.\nWill cutup to 300 workers in Dublin,accounting for roughly 10% of the company’s workforce in Ireland.\nAnnounced it willlay off 65 employees,affecting 5% of its total workforce.\nIs reportedly set to lay offover 1,000 employees and contractorsin a cost-cutting effort. It’s the second round of cuts for the company in just five months.\nReduced itstotal headcount by 16%as the gaming startup shifts its focus to be “scrappier” and “more efficient.”\nWasshut downjust three years after it was acquired by Flipkart. It is currently unknown how manny employees were affected.\nWill cutup to 2,000 jobsas part of its “Future Now” restructuring plan that hopes to save the company $300 million before the end of its fiscal year.\nAnnounced500 job cutsafter it wassold to Wonder Group for $650 million.The number of cuts affected more than 20% of its previous workforce.\nAnnounced plansto lay off 1,350 employees,affecting 9% of its total workforce, in an attempt to reshape its GTM model. The company is alsomaking reductions in its facilities,though it does not plan to close any offices.\nIs planning to cut employees in itsPeople Operations and cloud organizations teamsin a new reorganization effort. The company is offering a voluntary exit program to U.S.-based People Operations employees.\nReduced its headcountby 25 employees,accounting for 16% of its total workforce. The company is planning to release a commercial version of its proteome analysis platform in 2026.\nWill reportedlycut a few dozen employees in Israel,potentially affecting 10% of its 250-person workforce in the country.\nCut1,100 jobs in a reorganizing effortthat affected its tech workers. The coffee chain will now outsource some tech work to third-party employees.\nLaid offdozens of employeesover the last few weeks, including around 10% of staff in one day, after failing to meet its sales growth targets. The “headless commerce” platformraised money at a $1.9 billion valuationjust a few years ago.\nWill cutroughly 5% of its current workforcein a new efficiency drive to increase profitability and growth.\nLaid off more employeesin a new effort to cut costs, though the total number is unknown. Last year, the travel giantcut about 1,500 rolesin its Product & Technology division.\nHasceased operationsand has laid off its employees after selling its business and technology to Israeli cybersecurity company Tufin. The cuts affect roughly 300 people.\nIsshutting down its operationsamid “ongoing challenges in healthcare.” It’s unclear the number of employees affected. In 2023, the women’s healthcare startupraised $18 millionto fund its expansion.\nCut51 jobs in its San Francisco headquarters,according to state filings with the Employment Development Department. The SaaS startup previously reduced its headcount by 8% in 2023.\nHascut 120 employees,impacting 44% of its total staff. It’s the Y Combinator-backed Nigerian startup’s second layoff round in just five months.\nReportedlylaid off dozens of employeesas part of a new cost-cutting effort that aims to ensure “long-term success” in the startup’s mission to curb misinformation online.\nWill lay off about 10% of its workforce, affectingmore than 1,000 employees.According to an email to staff obtained by CNN, the cuts will largely have an impact on positions in engineering and program management.\nAnnounced in an SEC filing that it willcut around 450 positionsbetween February and July 2025, with a complete restructuring set to be completed in the fall, following its new partnership with Zillow.\nIs laying off6% of its total workforce,the cybersecurity firm confirmed to TechCrunch. The cuts come less than two weeks after Sophos acquired Secureworks for $859 million.\nWill cutnearly 200 employeesas it introduces redundancy measures and closes down its operations in Poland and Kenya.\nReportedlyconducted another round of layoffs.It’s unknown how many employees were affected.\nCut nearly 200 employees, CEO Mike Seckler announcedin a note to employees, citing “potential adverse events” like a recession or rising interest rates.\nCut 120 jobs, affecting roughlyone-third of its total workforce,TechCrunch exclusively learned. The move comes just a year after the Dutch startupcut 90 employeesfollowing its rebrand.\nLaid offabout 500 employees,affecting 15% of its workforce, citing poor business performance. The new cuts follow twoearlierlayoff roundsfor the company that affected roughly 200 employees.\nReportedly let go ofapproximately 200 employees,according to The Verge. The company previouslycut 100 employeesas part of a layoff round in August 2024.\nLaid off1,750 employees,as originally reported by Bloomberg and confirmed independently by TechCrunch. The cuts affect roughly 8.5% of the enterprise HR platform’s total head count.\nLaid off 180 employees,the company confirmed to TechCrunch.The cuts come just over one year after the access and identity management giantlet go of 400 workers.\nIs laying off50% of its workforce, including CEO Marc Whitten and several other top executives, as it prepares to shut down operations. What remains of the autonomous vehicle company will move under General Motors.\nIs reportedly eliminatingmore than 1,000 jobs.The cuts come as the giant is actively recruiting and hiring workers to sell new AI products.\nHas shut down operations, CEO Paul Kesserwaniannounced on LinkedIn.The fintech startup’s post-money valuationin 2022 was $82.4 million,according to PitchBook.\nLaid off150 employees based in the U.S., affecting roughly 18% of its total workforce, in an effort to reach profitability.\nLaid offdozens of workers in its communications departmentin order to help the company “move faster, increase ownership, strengthen our culture, and bring teams closer to customers.”\nIslaying off 300 people,according to a leaked memo reported by Business Insider. However, according to the memo, the fintech giant is planning to grow its total headcount by 17%.\nLaid off15 employeesas the augmented writing startup undergoes a restructuring effort.\nIscutting 75 employeesin an effort to “ensure the long-term sustainability and success” of the company. The audio company last cut 200 writers in July 2024 months afterpartnering with ElevenLabs.\nIs planning tocut 58 employeesin response to an “ongoing macroeconomic challenges and continued uncertainty in the solar industry.”\nAnnounced in an internal memo that it willcut 5% of its stafftargeting “low performers” as the company prepares for “an intense year.”As of its latest quarterly report,Meta currently has more than 72,000 employees.\nWill cut up to 730 jobs,impacting 3% of its total workforce,as it plans to exit operations in Germany and focus on physical retailers.\nIs shutting down its operations,impacting 63 employees.The delivery startup said employees will be paid through January 15 without severance.\nIslaying off 114 employeesas part of a team realignment, per a new WARN notice filing, focusing its efforts on a robotic printing system.\nEliminated 37 jobs, impacting roughly 10% of its total workforce, even as the companypursues “aggressive” hiring.\nIs cuttingdozens of employeesacross its global markets as part of a strategic reorganization to increase profitability.\nPlans to lay off400 employees globally.It’s the company’s fourth layoff roundsince January 2024as the solar industry as a whole faces a downturn.\nThe fintech startup, founded in 2018,abruptly shut down earlier this year.Per an email from CEO Paul Aaron, the closure follows anunsuccessful attempt to find a buyer, thoughEmployer.com has a new offer under considerationto acquire the company post-shutdown.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/11/y-combinator-founders-raising-less-money-signal-a-vibe-shift-vc-says/",
        "date_extracted": "2025-03-14T13:23:44.546872",
        "title": "Y Combinator founders raising less money signals a ‘vibe shift,’ VC says",
        "author": null,
        "publication_date": null,
        "content": "Silicon Valley has been captivated by the prospect of AI, not only as a productivity enhancer but also as a catalyst for creating successful companies with much leaner teams than in the past.\nStories abound of AI startups quickly reaching tens of millions in revenue with headcountas low as 20 people. With less overhead, some startups may be inspired to take less venture capital funding, especially at the earliest stages.\nTerrence Rohan, an investor with Otherwise Fund who’s been investing in Y Combinator since 2010, says he’s noticing a “vibe shift” from some founders in the current batch of the famed accelerator.\nHe described how one founder felt about iton Xlast week: “People used to climb Everest and they needed oxygen. Today, people climb it without oxygen. I want to summit Everest and use as little oxygen (VC) as possible.”\nThis founder wasn’t just saying this because of lack of VC interest. The round was oversubscribed, Rohan said, meaning lots of VCs wanted in.\n“Smart founder” was the reaction of Alexis Ohanian, the founder of VC firm Seven Seven Six and co-founder of Reddit.\nRaising less means founders maintain a larger ownership stake of their companies. By doing that, founders give themselves more ongoing business, and perhaps eventually exit, options, Rohan told TechCrunch. It’s actually becoming more common for YC startups to raise less capital than was offered to them by investors, TechCrunchreported last year.\nBut Parker Conrad, co-founder and CEO of Rippling, the HR tech startup with a$13.4 billion valuation, disagreed that having less capital will help a startup succeed.\n“The way this will play out is a competitor will raise a ton of financing, invest more deeply in R&D, build a better product, and absolutely crush this guy with sales and marketing. You have to play the game on the field,” hewrote on X.\nWhile building a good product with a small engineering team may be possible, Conrad points out that having more funding can accelerate company growth.\nRohan told TechCrunch that Conrad’s point is a classic one, but he thinks the “game on the field is changing.”\n“Folks are getting to substantial revenue quicker and with fewer people, and it’s a belief that maybe they can sustain that revenue with fewer people,” Rohan said.\nIt’s too early in the AI market to say if Rohan and the upstart founders are right. The initial examples suggest that fast-growth AI companies are still raising as much as they can.\nFor instance, Anysphere, which makes the popular AI-coding assistant Cursor,reportedly reached $100 millionin annual recurring revenue (ARR) earlier this year with a team of only 20 people. Anysphere is reportedly now in talks tosecure capitalat a $10 billion valuation mere months after raising its previous round.\nMeanwhile, ElevenLabs, an AI-powered voice-cloning startup, hit a similar ARR with only 50 people. The company announced its$180 million Series Cat a $3.3 billion valuation in January, a round that was likely secured when the company’s ARR was around$80 million, as TechCrunch previously reported.\nIn the meantime, Anysphere’s headcount grew to 90 people and ElevenLabs’ to 200, according to data provided by PitchBook.\nOther AI startupsare securing funding at a rapid pace, too, demonstrating that startups are still eager to accumulate capital even if they are maintaining a relatively low staff size.\n“VCs are very charming and persuasive, and they’re throwing money,” said Rohan, adding that these companies are likely obtaining funding with low dilution, meaning they aren’t giving up significant ownership.\nBut YC founders are now much more aware of the pros and cons of venture capital, he said.\nMany startups that secured funding at inflated valuations in 2020 and 2021 were later forced to raise capital at significantly lower valuations, known as a down round.\nPerhaps more importantly, raising a lot of venture capital from elite VC firms is no longer the goal for some YC founders.\n“It’s just a different tone and conversation versus, ‘I want to raise this round, and then I want to have Sequoia and Benchmark lead my Series A,’” Rohan said.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/11/yet-another-ai-robotics-firm-lands-major-funding-as-dexterity-closes-latest-round/",
        "date_extracted": "2025-03-14T13:23:47.075551",
        "title": "Yet another AI robotics firm lands major funding, as Dexterity closes latest round",
        "author": null,
        "publication_date": null,
        "content": "The intersection of robotics and AI continues to attract attention from investors and Big Tech alike. The latest indicator?Dexterity, a startup specializing in industrial robots with “human-like” finesse, has raised$95 millionat a post-money valuation of $1.65 billion, per Bloomberg.\nThe investment, which includes backing from Lightspeed Venture Partners and Sumitomo Corp., highlights the growing demand for machinery powered by AI and comes amid a wave of excitement from companies likeMetaandApple, which are reportedly exploring investments into AI-powered humanoid robots, and startups like humanoid robot makersFigure AIandApptronikthat have recently secured enormous funding rounds to develop robots for a variety of tasks.\nAs for Dexterity, its robots are designed to perform repetitive and sometimes dangerous tasks in warehouses and factories, such as loading boxes and sorting parcels, for customers that include FedEx and UPS. Founder and CEO Samir Menon — whose last role was as a PhD student at Stanford —  tells Bloomberg the robots use specialized AI models, each focused on a specific task. The outfit has now raised nearly $300 million altogether.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/11/meet-the-new-vc-firm-secretly-backed-by-volkswagen/",
        "date_extracted": "2025-03-14T13:23:49.878966",
        "title": "Meet the new VC firm secretly backed by Volkswagen",
        "author": null,
        "publication_date": null,
        "content": "A new venture firm calledLeitmotifhas been on a quiet blitz for the last 16 months, funding around 20 startups broadly focused on decarbonization. Its portfolio includes EV companies, space and battery plays, and four nuclear fusion startups. But the firm has only said its funding is from “European industrial interests.”\nNow, Leitmotif has told TechCrunch where the money came from: the Volkswagen Group.\nThe German automotive giant has committed $300 million to Leitmotif’s first fund and is its sole limited partner; Leitmotif has deployed roughly one third of that so far. During a conference on Tuesday, Volkswagen Group’s CEO Oliver Blume said Leitmotif’s investments could help lower the automaker’s carbon footprint and develop a “circular economy inside and outside” the company.\n“Volkswagen culture is team culture,” he said.\nLeitmotif wants to go even further, according to the young firm’s managing partners Matt Trevithick and Jens Wiese. They hope to spin up successive funds that draw in more European industrial interest beyond Volkswagen.\nIt’s an ambitious effort. Securing funding for hardware startups, especially ones with a serious manufacturing component, has been tough the last few years. But Trevithick believes it’s the right time to try to invest in these kinds of companies.\n“Technology has always been a driver of human progress, and I think the United States is about to supercharge that,” he told TechCrunch. “I think the next several years are about to produce a number of technical capabilities in the United States that the rest of the world will marvel at.”\nLeitmotif is also building a transatlantic fund while the geopolitical environment is being strained by the Trump administration.\nDespite that turmoil, Wiese — who was the head of Volkswagen Group’s M&A, Investment Advisory, and Partnerships division before starting Leitmotif — said the overarching goal of the new firm is to “create a bridge between the European industrial establishment and the U.S. innovation ecosystem.”\nTrevithick and Wiese said Volkswagen had a top priority when it agreed to invest in the fund: make money.\n“First and foremost, this is about setting up a successful venture firm,” Wiese said.\nWhile Volkswagen Group rakes in hundreds of billions of dollars per year in revenue, Wiese said making money is still important in part because it’s “how the industry keeps score.”\nAfter that, the VC firm said it plans to invest in “category-defining companies within our fields of interest,” according to Wiese, and also identify “new pockets of innovation” that could benefit the Volkswagen Group.\nWiese said he expects roughly one quarter of Leitmotif’s portfolio over time to interact with Volkswagen and its myriad brands.\nEV truck startup Harbinger is one example. Leitmotif co-led Harbinger’s $100 millionSeries B in January, and Wiese said the startup has had discussions about collaborating with Volkswagen’s trucking division.\nGeographically, Leitmotif’s investment strategy is structured so that roughly 70% of its capital will be deployed in the U.S., with the other 30% being invested in the EU. The firm will maintain offices in both Palo Alto and in Munich.\nTrevithick said 70% of Leitmotif’s global investments in this first fund will be made in startups that are “solving today’s known problems” and exist in “billion-dollar-plus markets with customers ready to buy the innovation.”\nThe other 30% of the fund will be focused on what he called “revolutionary innovation” that will create “billion-dollar-markets in the 2030s and beyond.”\nSo far, this strategy has led to investments in battery recycling company Redwood Materials, reusable rocket company Stoke Space, and even circular polyester startup Syre. Leitmotif has publicly backed 13 startups to date, though there are more in its portfolio that have not been announced.\nLeitmotif will eventually have other funds; Trevithick and Wiese said they’re particularly eyeing robotics and AI next. Volkswagen will have the right to invest in those if it chooses, but Leitmotif is independent and, for now, focused on finishing out its first fund.\nLate 2023 was arguably the worst time for startups in recent memory to lock down large funding rounds, especially ones focused on hardware or “deep tech,” thanks to high interest rates.\nTrevithick said that made it a great time to start Leitmotif.\n“It’s in down markets when the strong companies separate from the weak. In a bubble, everyone gets funded,” he said.\nThat fundraising slowdown caused other firms to take fewer risks outside the startups they were already invested in, Trevithick said.\n“There were less new dollars available to fund good companies that were there, because everyone got myopic about their own portfolio,” he said. “I think that’s why we got a lot of inbound interest to participate in rounds that, in the bubble time, maybe we wouldn’t have had access to.”\nThat interest came in large part thanks to Wiese and Trevithick’s backgrounds.\nWiese spent nearly eight years at Volkswagen Group, where he ran mergers, acquisitions, and investments for the German automaker. During this stint at Volkswagen, Wiese developed what he called “quite a deep network into the venture community, both in Europe and in the U.S.” That included forging a relationship with battery maker QuantumScape, where Wiese was a board member until 2024.\nTrevithick, meanwhile, was a partner at Venrock for a decade. There, he focused on making investments in green energy during the original clean tech boom in the early 2010s, with his highest-profile bet being an early one on battery maker Atieva — the company that eventually became Lucid Motors.\nInvesting, advising, and guiding companies through the subsequent clean tech bust was valuable experience for navigating the uncertainty currently plaguing the industry, Trevithick said.\nWhile many corporate “net zero” goals are being either hedged or abandoned outright, Trevithick said the clean tech industry is “starting in a much better position this time around.”\nPlus, Trevithick said he believes the unpredictability will present more opportunity for firms like Leitmotif — and the startups it backs.\n“I think we can all agree it’s just going to be a highly volatile environment. Which should disproportionately favor entrepreneurs, startups, and venture capitalists,” he said.\n“We feel very confident about our portfolio,” Wiese added. “Yes, [decarbonization] is our overarching theme. At the same time, we invest in companies where we are convinced they have the business case to succeed regardless of what, let’s say, the theme of the day is.”\nThis story has been updated with comments from Volkswagen Group CEO Oliver Blume.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/11/learn-what-vcs-want-to-see-from-founders-at-techcrunch-sessions-ai/",
        "date_extracted": "2025-03-14T13:23:52.832995",
        "title": "Learn what VCs want to see from founders at TechCrunch Sessions: AI",
        "author": null,
        "publication_date": null,
        "content": "It’s no secret that AI has eaten the lion’s share of funding over the past couple of years, with investments into the sectorsurging 62%to $110 billion in 2024 alone, while startup funding overall declined 12%.\nStartups may think that just adding “AI” to their company’s name might help them secure that funding. But as the frenzy around foundation models has given way to a focus onreal-world applications,AI agents, and long-term profitability, investors are seeking startups that can turn technical ingenuity into sustained traction.\nAtTechCrunch Sessions: AI, happening on June 5 in Zellerbach Hall at UC Berkeley, top VCs Zeya Yang (IVP), Jill Chase (CapitalG), and Kanu Gulati (Khosla Ventures) will break down exactly what they look for at each stage of investment, from seed rounds to Series C. And they’ve got the investment history and on-the-ground expertise to back it up.\nZeya Yanghas invested in winners such as Grammarly and Figma and has a track record of working directly with founders to refine product-market fit and drive growth.\nJill Chaseleads CapitalG’s investments in Magic, /dev/agents, Motif, and Abridge, and has spent the last several years focusing on emerging use cases for AI and ML, data infrastructure, and enterprise technology.\nKanu Gulatihas backed AI leaders PolyAI, Kognitos, and Moonhub and brings over 10 years of experience as a research scientist at Intel and Cadence and as an early engineer at Heavy.ai, Spyglass, and Nascentric.\nBuy your tickets now to lean in on the conversation atTC Sessions: AIon June 5 in Zellerbach Hall at UC Berkeley to get an inside look at what VCs really want to see in AI startups. Take advantage of Early Bird deals now to save up to $210 —register here.\nIs your company interested in sponsoring or exhibiting at TechCrunch Sessions: AI? Contact our sponsorship sales team byfilling out this form.\nSign up for the TechCrunch Events newsletterand be the first to grab special promotions.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/02/Jill-Chase-headshot-1080x1080-1.png?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/02/Kanu-Gulati-khosla-ventures_Headshot_1080x1080.png?w=680"
        ]
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/11/equator-closes-55m-fund-for-early-stage-climate-tech-startups-in-africa/",
        "date_extracted": "2025-03-14T13:23:55.630710",
        "title": "Equator closes $55M fund to bring more private capital to African climate tech",
        "author": null,
        "publication_date": null,
        "content": "African venture capital firmEquatorhas raised $55 million for its first fund, which will back climate tech startups through one of the most difficult and often overlooked phases in their journey: the early stage.\nClimate tech startups in African countries have to navigate a tougher funding landscape than their counterparts in more developed economies, where governments often subsidize companies working on greener technologies. They have to instead rely heavily ondevelopment finance institutions (DFIs), foundations, and endowments, making them especially vulnerable to shifts in global capital flows.\nAs aid and development finance budgetsshrink, DFIs deploy less capital, which adds to the pressure on African startups. The situation is worse for climate tech companies, which require more capital than traditional tech startups.\nWith its fund, Equator feels it can bridge this gap and back scalable solutions that can attract private capital.\n“We are needed more than ever to invest in technology and scalable ventures tackling fundamental climate challenges,” said the firm’s managing partner,Nijhad Jamal. “These investments will help reduce dependence on aid and instead bring more global private capital into the region.”\nThat’s a lofty goal to aim for, but like many Africa-focused funds, Equator’s base of limited partners still is composed of the very institutions it aims to wean startups off. Its backers include DFIs such as British International Investment (BII), Proparco, and IFC, as well as foundations and endowments like the Global Energy Alliance for People and Planet (funded by IKEA, Rockefeller, and Jeff Bezos’ Earth Fund) and the Shell Foundation.\nEquator plans to invest the fund in 15 to 18 startups, writing $750,000 to $1 million checks for companies at the seed stage and $2 million for those at Series A.\nAside from capital, the firm wants to help founders figure out unit economics, governance, and regional expansion. The fund wants to also reserve capital for follow-on investments and later-stage rounds, and aims to mobilize its LPs as co-investors to bring in equity, debt, or blended financing.\n“In several of our portfolio companies, we’re the only Africa-focused investor on the cap table — that’s the role we see ourselves playing in this ecosystem,” Jamal said. “Until our most recent investments, we had a 100% success rate in bringing our investors directly into the ventures we backed.”\nAfricaaccounts for less than 3%of global energy-related CO2 emissions but bears some of the harshest climate impacts. Equator wants to address that, saying it invests in ventures “addressing economic and sustainability challenges emerging from these impacts.”\nWhenwe covered the firm in 2023 after it had reached the first close for this fund, Jamal stressed the importance of backing technical founders building in the energy, agriculture, and mobility sectors. At the time, investments in climate tech had surged, making it Africa’s No. 2 VC sector after fintech.\nThe market has changed since then, however, and investor conversations have evolved alongside those changes. Initially, founders and investors mainly focused on impact; now, Jamal says, the emphasis is shifting to sales — climate solutions must deliver clear economic value to customers with purchasing power.\nListing examples of such solutions, Jamal pointed to electric vehicles that cost less than fuel-powered ones; climate insurance that accurately covers extreme weather; or AI-powered logistics optimization for businesses. Some of Equator’s portfolio companies,Roam Electric, Ibisa, and Leta, are building these solutions.\n“The narrative has shifted,” Jamal said. “It’s no longer just about development and impact. It’s about mobilizing private capital for scalable ventures that solve problems. The focus today is even more on things like unit economics and the path to profitability, because people know there isn’t just [enough] capital to throw at ventures to scale without thinking about monetization, real economics, profitability, or exits.”\nJamal feels climate tech startups today are different from their first-generation clean tech counterparts like Sun King, M-KOPA, and d.light, which raised billions and are now looking ready for IPOs.\nThese new startups, he said, operate in a more mature ecosystem, allowing them to use capital and time more efficiently — key factors in becoming attractive acquisition targets. Rather than billion-dollar IPOs, Jamal anticipates $100 million exits, saying that can still deliver strong returns for investors.\nThe space is already seeing some consolidation, though most of it is undisclosed. We did see notable M&A, like Bboxx’sacquisitionof PEG Africa in 2022, and more recently, Equator-backed SteamaComergedwith Shyft Power Solutions last year.\nAs the sector hopes to see more exits, Jamal stressed the importance of capital structuring. Climate tech attracted the most debt financing last year, and he argues startups need the right mix to avoid excessive equity dilution.\n“If equity is used for everything, including working capital, dilution will be too high for investors or founders to see meaningful returns. But as debt and other financial instruments become more available, we’ll start seeing commercial exits, even if they’re more bite-sized,” he said.\nJamal previously held roles at BlackRock and impact investor Acumen Fund, where he led the clean tech group. He later founded Moja Capital, a personal fund through which he made early-stage investments aligned with Equator’s current strategy. He runs Equator alongside partnerMorgan DeFoort.\nOne of Jamal’s early bets wasSunCulture, a Kenya-based, off-grid solar company backed by the Schmidt Family Foundation, which Equator has since supported. Equator has also invested in other growth-stage startups like SoftBank-backedApollo AgricultureandOdyssey Energy Solutions.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/10/deepseek-isnt-taking-vc-money-yet-here-are-3-reasons-why/",
        "date_extracted": "2025-03-14T13:23:58.479315",
        "title": "DeepSeek isn’t taking VC money yet — here are 3 reasons why",
        "author": null,
        "publication_date": null,
        "content": "DeepSeek’s founder Liang Wenfeng is in no hurry to get investment from outsiders, the WSJreportedMonday.\nDeepSeek is one of the hottest AI startups in the world right now after the Chinese AI companytook Silicon Valley by stormwithits latest modelearlier this year.\nUnlike DeepSeek’s AI model provider counterparts, who regularly announce mega-rounds filled with prominent investors, Liang hasn’t announced any fundraises, despite lots of VC interest. Rumors about its supposed investors have evenfueled (baseless) ralliesin some Chinese stocks.\nAn analysis of Chinese corporate records done by TechCrunch shows that DeepSeek is 84% owned by Liang. The rest of the startup is owned by individuals affiliated with Liang’s hedge fund, High-Flyer.\nThat means that unlike most startups, which require outside capital and are thus used to at least some external influence, DeepSeek is basically a one-man show. And Liang doesn’t have the highest regard for VCs’ opinions.\nWhen Liang was trying to raise capital in the past, he was put off by VCs’ focus on rapidly monetizing AI as opposed to fundamental research, he said ina 2023 interview with Chinese media.\nSo one big reason why Liang hasn’t said yes to the investors pounding down his door is that he doesn’t want to share control of his company, the WSJ reported.\nMost startups need capital from investors from the start. But DeepSeek is a unique beast. Liang has been able to fund DeepSeek through High-Flyer’s profits, reducing his need for outside investment.\n“Money has never been the problem for us; bans on shipments of advanced chips are the problem,” Liang said in 2023.\nAs a Chinese company, DeepSeek operates under strict Chinese laws that grant its government broad data access.\nConcerns over this have prompted DeepSeek bans froma rising number of governmentsand evensome private companies.\nThose bans could get even worse if DeepSeek accepts funding from a Chinese investor, who face similar issues.\nThe U.S. government has a history of sanctioning Chinese tech companies it says are close to the Chinese government, like telecom giant Huawei and popular drone maker DJI.\nThat hasn’t stopped some Chinese state entities from approaching DeepSeek for investment, The Informationreported, although there’s no indication DeepSeek has accepted any.\nThis doesn’t mean DeepSeek will never raise outside capital, though.\nEarlier this month, DeepSeekannounced a (largely theoretical) profit marginfor the first time, signaling a shift toward monetization — something VCs value but that Liang previously dismissed.\nTo keep up with other AI heavyweights, DeepSeek will also likely need access to more and better AI chips — the biggest bottleneck on its development, Liang said in 2023. Those chips are expensive and heavily restricted in China due toU.S. export controls.\nDeepSeek’s ability to be self-funding may also be fading. While High-Flyer has done well in the past, some of its flagship funds have underperformed since 2022, the WSJ reported.\nIt also doesn’t help that the Chinese government has beencracking downon quant funds like High-Flyer since 2024.\nWhile few concrete names are circulating, DeepSeek has already drawn interest from Tencent and Alibaba, according to multiple news reports.\nDeepSeek didn’t immediately respond to a request for comment.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/10/insight-vc-explains-the-biggest-mistake-that-keeps-founders-from-raising-a-big-round/",
        "date_extracted": "2025-03-14T13:24:01.347245",
        "title": "Insight VC explains the biggest mistake that keeps founders from raising a big round",
        "author": null,
        "publication_date": null,
        "content": "Given how much money VCs are pouring into AI startups these days, it may seem like VCs have decided: If it’s not AI, they won’t write a big check.\nBut that’s not exactly what’s happening. Dealmaking at the moment is more nuanced, said VC Insight Partners Managing Director Ryan Hinkle during a recent Equity podcast.\nWith $90 billion in assets under management, Insight Partners invests at all stages. It’s known to both write huge checks itself and pile into huge rounds. For instance, Insightco-led Databricks’ $10 billion deal in December; participated in Abnormal Security’s$250 million series Din August (led by Wellington Management); and co-led the$4.4 billion PE take-private deal for Alteryxat the end of 2023 with Clearlake.\nHinkle, who started as an intern in 2003 when the company was 10 years old, explained how the firm’s check-writing pace has grown.\n“When I joined Insight, we had raised a cumulative $1.2 billion ever, across four funds. We had put only $750 million of capital into investments at that point. We do more than a billion dollars per quarter today,” he said.\n“In all of those 10 years, $750 million invested, which is like a good month for us today,” he joked. (Insight just raised$12.5 billion for its XIII flagship fund.)\nGood, growing companies that are not selling AI as their core technology (for example, last cycle’s darling, SaaS companies) can still raise healthy checks, he said. But the multiples they can expect — value compared to revenue — won’t be as high.\nFunding rounds are still “30% lower on a multiple of ARR basis than 2019. Forget the 2021 bubble times,” he said. “The stocks are up because the companies’ revenues are up a lot, but the multiples are still lower.”\nHinkle likes to call these current times “the ‘great reset’” and says “it’s a super healthy thing.”\nBut there is one big thing founders can do to maximize the deal that growth VCs will offer, and it doesn’t involve just stamping AI all over the company’s marketing materials. It’s much more important and much more mundane: financial infrastructure.\nWhile startups entering their growth rounds (Series B and beyond) don’t necessarily need a CIO, they do need systems that show the details beyond recent customer acquisition and its cousin, annual recurring revenue — which has become something of a joke these days.\nThat number came into vogue with the rise of SaaS, when startups would sign multi-year contracts with customers but could only recognize the revenue after it was billed — not allowing them to show their true growth. Today, startups like to take their most recent month of revenue, multiply it by 12 and voilà, ARR.\nWhat financiers like Hinkle want is for the startup’s leadership to be able to answer everything about the business the way they can about the product: influences on margin, customer retention rates, all the steps from “quote to cash,” meaning from giving customers a quote to being paid.\n“Can you produce for me an anonymized customer record of all transactions with each customer?” Hinkle asks. This should include both the invoices and some contract details.\n“And if that takes more than a button push, the question is, ‘OK, where is it all stored? And why is it potentially scattered?’” he said.\nOften young startups start with a kluged system where invoicing data is in one place, contract specifics somewhere else. Booking data and duration of contracts might even be somewhere else. And no one is reconciling it all.\nFor many, especially those with impressive growth rates, working on these mundane financial systems just never takes priority over adding product features that lead to more contracts.\n“I totally get it when you’re growing 100% like, spoiler alert, the metrics are good,” Hinkle said. But at some point, he warned, growth will hit the skids, maybe from competitors.\n“All of a sudden, you’ve got to refine the sales math, the unit math,” he said. ”And if you can’t see it, it’s hard to know which levers you’re affecting.”\nFounders who haven’t documented the financial minutiae will hurt themselves during the VC’s diligence process — and that will almost certainly result in a hit on check size or valuation.\n“We’re still in this hangover aftermath of the great reset, post COVID comedown,” he said. “A lot of us were badly burned.”\nWhere once a founder could walk away with a big check from just a good revenue growth chart and well-articulated vision of the future, today, “If I can’t see it with my own eyes, it doesn’t exist,” Hinkle said. “So the emphasis on these metrics is heightened.”\nIt’s true that some VCs will overlook that level of diligence and invest anyway, because VCs still get “intoxicated” by fast-growth numbers too, Hinkle admitted.\nBut, he warned, the problem won’t go away. As the company grows and accrues more customers with more transactions, financial governance will get more unwieldy if systems to track and reconcile are not in place. The sooner a founder deals with it, the better the business will be later, he said.\nHere’s the full interview, where he discusses this, as well as other topics like:",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/10/applications-are-open-for-startup-battlefield-200-apply-today/",
        "date_extracted": "2025-03-14T13:24:04.193169",
        "title": "Applications are open for Startup Battlefield 200 — apply today!",
        "author": null,
        "publication_date": null,
        "content": "Are you a pre-Series A startup founder looking to make your mark on a global stage? This is the opportunity you’ve been waiting for. Applications forTechCrunch Startup Battlefield 200— the premier startup pitch competition — are officially open. We want to see you showcase your game-changing innovations to the world at TechCrunch Disrupt 2025.\nGet an unbeatable chance to gain exposure and pitch your startup to world-class VC judges — and the entireTechCrunch Disrupt 2025audience at Moscone West in San Francisco from October 27-29 — as you compete for the coveted $100,000 equity-free prize. Don’t let this rare chance to make a major impact pass you by.\nThe competition is expected to be fierce. Thousands of startups applied last year, and 2025 is likely to have another large swath of innovators competing for their shot. If you think your startup has what it takes,apply early to get an edge on the competition.Of course, TechCrunch reviews every application in detail, but the sooner you enter, the better.\nAnd that’s not all! Go to the officialStartup Battlefield 200 pageto learn more.\nStartup Battlefield 200 has over 1,500 alumni, including game-changing startups like Trello, Mint, Dropbox, Discord, Getaround, and more. That legacy makes Startup Battlefield the ultimate launchpad for the next generation of disruptors — and your startup could be the next success story.\nIf you’re part of a bold, early-stage startup with a transformative vision,we want to hear from you. Whether you’re bootstrapped, pre-seed, or seed-funded — Startup Battlefield is the place to take your startup to the next level. Series A startups in capital-intensive industries may also qualify.\nDon’t miss your chance to participate in the biggest startup pitch competition of the year and to compete on a global stage.Apply today to make your mark!\nIs your company interested in sponsoring or exhibiting at TechCrunch Disrupt 2025? Contact our sponsorship sales team byfilling out this form.\nSee the impact for yourself — watch the video below to hear how our partners thrive with us.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/Startup-Battlefield-200-contestant_Disrupt-2024.jpg?w=680"
        ]
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/10/maximize-your-exposure-secure-an-exhibit-table-at-techcrunch-all-stage-2025/",
        "date_extracted": "2025-03-14T13:24:07.099371",
        "title": "Maximize your brand: Secure an exhibit table at TechCrunch All Stage 2025",
        "author": null,
        "publication_date": null,
        "content": "On July 15, 1,200 founders and VCs across all stages will gather at SoWa Power Station in Boston forTechCrunch All Stage 2025— the ultimate summit for startup founders.\nWhat does this mean for you? A golden opportunity to showcase your brand to a powerhouse crowd eager to scale. It’s easy — just head tothis exhibit pageand grab your booth now!\nExpand your reach:Exhibit your cutting-edge solutions on the energetic TC All Stage Expo floor, where more than 1,200 founders and VCs will be present. Take advantage of this chance to demonstrate your startup’s distinct value and establish partnerships that can accelerate your success.\nUnlock full conference access to connect and engage:Get six full-access conference passes, giving you and your team unrestricted entry to TC All Stage. Attend breakout sessions on the main stages, participate in roundtable discussions, engage in unparalleled 1:1 and small-group networking, and showcase your startup to a growth-focused audience, creating valuable opportunities for scaling.\nElevate your brand presence:Highlight your brand on the TC All Stage website and event app, ensuring it captures the attention of founders, investors, and partners, giving you a clear advantage over competitors.\nHigh-value, low-cost:For just $5,500, this Exhibitor program delivers outstanding value for brands eager to make an impact with the TC All Stage audience. Get unmatched visibility, networking opportunities, and comprehensive marketing support from TechCrunch.\nWith only eight exhibit tables up for grabs, they won’t last long. Secure your spot to boost your brand — claim your table now for TC All Stage.Get all the details and reserve your table here.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/10/supercharge-your-brand-visibility-with-an-exhibit-table-at-techcrunch-disrupt-2025/",
        "date_extracted": "2025-03-14T13:24:09.930763",
        "title": "Supercharge your brand visibility with an exhibit table at TechCrunch Disrupt 2025",
        "author": null,
        "publication_date": null,
        "content": "From October 27-29,TechCrunch Disrupt 2025will bring together over 10,000 startup pioneers, VC leaders, and tech enthusiasts at Moscone West in San Francisco — the epicenter of innovation set to reshape the future of technology.\nWhat’s in it for your startup? A golden opportunity to put your innovation in front of an eager audience for all three days. The process is easy — simplyvisit this exhibit pageand reserve your booth today!\nExpand your reach: Showcase your innovative solutions in the bustling Disrupt Expo Hall for three full days, with over 10,000 tech leaders and VCs in attendance. Seize the opportunity to highlight your startup’s unique value and forge partnerships that can drive your growth.\nMaximize connection opportunities: Receive 11 conference passes for you and your team to fully engage with Disrupt 2025. Attend main stage discussions, breakout sessions, roundtables, and network one-on-one with decision-makers, all while positioning your startup in front of a highly engaged audience.\nBoost your brand visibility: Promote your brand to Disrupt attendees and the whole TechCrunch audience before, during, and after Disrupt 2025 across multiple platforms — Disrupt’s website, event app, and a TechCrunch post — ensuring your startup stands out to founders, investors, and potential partners and clients.\nUnmatched ROI: For just $10,000, this Exhibitor package offers extraordinary value — delivering maximum exposure, essential networking, and extensive marketing support from TechCrunch to amplify your brand.\nThe Disrupt Expo Hall has limited booth spaces, and they won’t last long. Act fast to secure your spot and amplify your brand at Disrupt 2025.Reserve your table now and get all the details here.\nIf you’re looking to sponsor TechCrunch Disrupt 2025, get in touch with our sales team bysubmitting this form.See the impact for yourself — watch the video below to hear how our partners thrive with us.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/03/Disrupt-2024-Exhibitors_Nebius.jpg?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/03/Disrupt-2024-Exhibitors_Fye-Labs.jpg?w=680"
        ]
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/08/in-defense-tech-lithuanias-sovereign-vc-fund-is-one-step-ahead/",
        "date_extracted": "2025-03-14T13:24:12.915711",
        "title": "In defense tech, Lithuania’s sovereign VC fund is one step ahead",
        "author": null,
        "publication_date": null,
        "content": "Europe is waking up to the need to invest in defense, andso are European VCs. But with a painful history of Soviet occupations, Lithuania didn’t wait for the third anniversary of Russia’s invasion of Ukraine to reach its third anniversary to commit5% to 6% of its GDPto military spending — and fund defense startups.\nLithuania’s sovereign VC fundCoinvest Capitalwas a pioneer in that regard, and it still is an outlier in not requiring civilian use cases. “We were the first in the region [to be] fully authorized to do defense investments back in March 2023,” said Viktorija Trimbel, its managing partner since February 2023.\nUnlike many Lithuanians, Trimbel is not tall at all. But what she lacks in basketball potential, she makes up for in energy and relentlessness, especially when it comes to advocating for innovation in defense tech to strengthen Europe’s security.\nUnmanned Defense Systems(UDS), a Vilnius-based company focused on optimizing the “kill chain,” received Coinvest’s largest investment in that domain, but it is not the only one. According to Trimbel, the evergreen fund has invested some €6.8 million (approximately $7.37 million) into aerospace, defense, and dual-use startups since 2023.\nCompared to thebillion-dollar roundsflooding into U.S. defense tech companies, the amount may not sound very impressive. That’s unless you consider it per capita, something people often urge you to do in this small Baltic country of 2.89 million inhabitants.\nCo-creation is another notion that Lithuania often emphasizes, as does Coinvest. As its name suggests, the early-stage fund is co-investing into startups with business angels and other VCs. For early-stage deals, it adopted a cappedprofit-sharing structurethat Trimbel is particularly passionate about.\nAs a board member of the Lithuanian Business Angel Network (LitBAN), which now has 324 members, she’s particularly keen to see more smart money flow into the market. While the collective value of Lithuania’s startup ecosystemincreased 39 times in 10 years, the country still lacks an exit as impactful as Skype’s was for Estonia.\nStill, liquidity events such asVinted’s secondary salehad a drip-down effect, and Trimbel thinks Coinvest can multiply these euros fast. When it exited Interactio after just 18 months, its rules boosted angel investors’ returns from 9x to 34x. “I believe that was one of the factors which facilitated an explosive growth of the business angel ecosystem,” Trimbel said.\nIn defense tech, too, Trimbel champions the success of others in securing capital. Coinvest’s sole limited partner, Lithuania’s national development bank, also provided “major capital injections to other local VCs like BSV Ventures or ScaleWolf, including [the] Lithuanian contribution to the NATO Innovation Fund (NIF),” shecelebratedon LinkedIn.\nSimilarly, Trimbel ispleasedto see governments across Europe embracing the trend of “investing in deterrence and defense to further support competitiveness and resilience of European countries.”\nThat’s a need Lithuania is sorely aware of, often deeply personally. “When I was 18, I saw with my own eyes, Russian tanks killing people. So for us, it’s not a textbook story,” Trimbel said, referring to the 1991’sJanuary Eventsin which the Soviet military attempted to suppress Lithuania’s independence movement.\nThe trauma of Soviet rule that’s deeply ingrained in Lithuania’s collective memory stretches far beyond 1991. “It’s something that every family has experienced one way or another: occupation, deportations, killings. We don’t need to be taught why we need to invest in defense,” Trimbel said.\nStill, since the war in Ukraine, there’s a renewed sense of urgency and solidarity. The 2025 edition ofRadarom, a public fundraising campaign for Ukraine, collectedmore than €5.6 millionfor drones and anti-drone systems, including from UDS. Trimbel endorsed it, urging, “Support Ukraine NOW … and any other day till victory.”\nLike nearly all Lithuanians, Trimbel recalls where she was when Russia launched its full-on invasion of its eastern neighbor on February 24, 2022. A few days earlier, she was abroad with her two daughters, and they discussed whether they should return as signs of war amounted — until her youngest daughter pointed out that they had to: They had left the cat.\nCat or no cat, Trimbel would likely have returned to Lithuania either way. She points out that her first name, Viktorija, or Victory, is a good match for her relentless personality. Her circle of girlfriends is also up to par: “Instead of going to the bar and discussing a new handbag or a dress or lipstick, we go to the shooting range,” she said with a smile.\nOf course, not everyone reacts the same way — it’s only human to experience a flight or freeze reflex. In the immediate aftermath of the war, however, she aimed to get others out of this paralysis by encouraging them to take practical steps. One of them was to join volunteering initiatives that have gained steam across Lithuania.\nThe most emblematic organization in that field is the government-backed nonprofit Lithuanian Riflemen’s Union (LRU). While it is dedicated to the defense and strengthening of Lithuania, its activities extend beyond military training: Together with Coinvest and others, it co-organized theFire Shield hackathon, which will return in 2025 for a third edition.\nThat’s the context in which Trimbel is pictured above, together with the Union’s commander, Lieutenant Colonel Linas Idzelis (in uniform) and retired Lt. Col. Valerijus Šerelis, former squadron commander of the special operations forces that thenot-that-random countrysent to support NATO allies in Afghanistan after 9/11.\nLRU also contributed to civilian response during the COVID-19 pandemic, as did Trimbel, who invested efforts into ahelmet-based ventilation protection project. “COVID was a good rehearsal to mobilize society during times of threat,” she said. For her, that threat has now changed, but it is very much real.\nBut even now, Trimbel cares about areas other than defense tech, and so does Coinvest. She spoke enthusiastically of portfolio startupWalk15and its upcoming “Labrador walk,” an outdoors hike with dogs to encourage people to take more steps to be more active — literally.\nHowever, as she wrote in a recentLinkedIn post, “no other investment returns will matter if Ukraine will not receive sufficient support from allies and Europe will be invaded further.” As her name and personality suggest, she won’t relent in her efforts to prevent this outcome.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/07/sxsw-2025-what-were-paying-attention-to/",
        "date_extracted": "2025-03-14T13:24:15.767257",
        "title": "SXSW 2025: What we’re paying attention to",
        "author": null,
        "publication_date": null,
        "content": "TechCrunch will be on the ground at SXSW 2025 — the annual tech, music, comedy, and film conference that kicked off Friday in Austin — in search of the zeitgeist of this AI-centric era.\nYup, we’re one sentence in and AI has already made its entrance. And why not? A quick scan of the massive SXSW schedule illustrates that AI is on center stage in Austin — and globally. It’s worth noting that this year there seems to be an emphasis on how AI is being applied to the real world, not just speculation on what it could be.\nSXSW tends to reflect what the tech ecosystem of founders and backers are working on. And it often coincides with the hype cycle. Autonomous vehicles, scooter mania, crypto, psychedelics — they’ve all had their moment at SXSW.\nThe tech portion of the annual event kicked off Friday and will run through March 13. The conference begins with several tracks that fall squarely in TechCrunch’s area of interest, including the creator economy, culture, startups, health and medtech, and energy. The AI track officially begins Sunday, but it’s already making cameos. For instance, Signal President Meredith Whittaker, who was interviewed onstage Friday, called outagentic AI as a security and privacy threat, and a health expert warned that it can bedangerous for people to be too reliant on AI for companionship.\nDeep tech like space and quantum computing will also make its mark at the show, as will climate, sustainability — look out for Rivian founder and CEO RJ Scaringe’skeynote March 11— and transportation.\nAutonomous vehicles are back, but this time they’re on the road — not just the topic of conversation in a panel. Earlier this week, Uber and Waymo launched arobotaxi servicein Austin. The so-called “Waymo on Uber” robotaxi service is available to any member of the public who has an Uber account. And you better believe TechCrunch will be hailing those robots and talking to human Uber drivers about what they think.\nTechCrunch will also be talking to the VCs, founders, and industry experts at SXSW to get the pulse of how the tech world is adjusting to the Trump administration and, of course, to find the next newnewthing. We’ll also be paying attention to the numerous keynotes and interviews with tech and business luminaries, notably Alan Baratz of D-Wave Quantum, Qualcomm President and CEO Cristiano Amon, Colossal Biosciences founder Ben Lamm, and Arm CEO Rene Haas.\nDon’t worry, we’ll have a bit of fun, too.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/podcast/the-california-ai-bill-is-back-and-it-lost-its-teeth/",
        "date_extracted": "2025-03-14T13:24:18.955605",
        "title": "No Title Found",
        "author": null,
        "publication_date": null,
        "content": "California’s mostcontroversial AI safety billof 2024 might be dead, but its authorisn’t backing down. State Senator Scott Wiener is back with SB 53, a new AI bill that strips away the most debated parts of last year’s failed legislation while keeping key whistleblower protections and a public cloud computing initiative called CalCompute.\nWith the AI industry and even the federal government shifting away from AI safety regulation in favor of innovation, will the bill gain any traction? Today, on TechCrunch’sEquitypodcast, hosts Kirsten Korosec, Max Zeff, and Anthony Ha are unpacking the latest moves in AI regulation, along with the week’s top stories in tech and startups.\nListen to the full episode to hear about:\nEquity will be back next week, so stay tuned!\nEquity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. Subscribe to us onApple Podcasts,Overcast,Spotifyand all the casts. You also can follow Equity onXandThreads, at @EquityPod. For the full episode transcript, for those who prefer reading over listening, check out our full archive of episodeshere.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/07/last-day-to-apply-to-be-a-techcrunch-sessions-ai-speaker/",
        "date_extracted": "2025-03-14T13:24:22.342020",
        "title": "Last day to apply to be a TechCrunch Sessions: AI speaker",
        "author": null,
        "publication_date": null,
        "content": "TechCrunch Sessions: AIkicks off on June 5 in Zellerbach Hall at UC Berkeley — and we want AI leaders to take part in industry-changing conversations. Make your mark by leading breakout sessions and discussions with over 1,200 startup founders, VC leaders, and other industry pioneers at TC Sessions: AI. But don’t wait, you haveuntil tonight at 11:59 p.m. PTto apply.\nAre you an innovator driving the discourse and want a rare chance to take center stage?TC Sessions: AIwants to highlight your expertise. Apply to lead a 50-minute breakout session, complete with a presentation, panel discussion, and audience Q&A, on a topic that you think will help impact and inform the industry.\nHead to theTC Sessions: AI event pageand click the “Apply to Speak” button to submit your topic. Whether the focus is on the startups within the space, the tools changing the way we work and build, or the infrastructure it takes to support further innovation, we’re open to a wide range of discussions.\nOnce applications are submitted, our TechCrunch audience will vote on their favorite sessions that they want to see at our premiere AI industry event.\nSure, you’ll be able to lead a discussion and take home some bragging rights, but there’s plenty of other perks if your topic is selected. Selected speakers will get access to our exclusive main stage of AI event programming, additional breakout sessions, and the opportunity to join in on small-group and 1:1 networking opportunities.\nSpeakers will also be prominently featured across all of our event listings and agendas and will receive social media promotion.\nIf this sounds up your alley, don’t wait. Put your brightest ideas together for a chance to inspire, educate, and shape the future of AI innovation. The clock is ticking — apply to speak bytonight at 11:59 p.m. PTbefore time runs out!\nIs your company interested in sponsoring or exhibiting at TechCrunch Sessions: AI? Contact our sponsorship sales team byfilling out this form.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2024/04/53679979052_da1066fe91_o.jpg?w=680"
        ]
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/06/why-vcs-ghost-founders-or-reject-deals-and-never-speak-to-the-founder-again/",
        "date_extracted": "2025-03-14T13:24:25.702897",
        "title": "Why VCs ghost founders, or reject deals and never speak to the founder again",
        "author": null,
        "publication_date": null,
        "content": "Getting ghosted is never fun. Especially if you’re a founder seeking capital from investors.\nIt’s similar to dating. You might be left wondering “Why is this person not getting back to me? Did I do something wrong?” Did the investor hate the product? Did they not care for me personally?” It’s enough to drive anyone crazy.\nGhosting is an undeniable signal of a lack of interest. If a VC wanted to invest, they would definitely respond to your cold call, or get back to you after the pitch.\nThere are a variety of reasons why a VC might vanish after a founder thought they would agree to a meeting, or worse, after one, according to several VCs who talked to TechCrunch.\nTime is people’s scarcest resource, Mercedes Bent, a partner at Lightspeed Venture Partners wrote ina LinkedIn poston the topic of VC ghosting that went viral. VCs naturally are going to spend more of it on the founders and startups in which they see potential.\n“Writing a thoughtful rejection takes effort, and when a pass won’t ‘convert’ [to an investment],  it often gets deprioritized. Not saying this is good,” she wrote in her LinkedIn post.\nBent also notes that the investing environment has shifted over the past decade so that VCs are having to make decisions faster and thus, have less time to get back to prospects.\n“VC has ballooned at breakneck speed – more firms, more capital, more pitches,” she wrote. “With more focus on volume and speed, there is little room for the intentionality and personal touch that once defined the industry.”\nSuch rapid growth has created a churn-and-burn culture where relationships feel increasingly transactional, she added.\nBetter Tomorrow Ventures co-founder and general partner Sheel Mohnot says things most often slip through the cracks when he’s “super swamped.”\n“This is never about the founder and always about what else I have going on in life — like if we are fundraising, or it’s the week of founder camp, our AGM, Money 2020, etc.,” he told TechCrunch.\nEric Bahn, co-founder and general partner of Hustle Fund, relies on an automated email response to help him manage the influx of inbound deal opportunities he receives in his inbox. He estimates that he receives about 30 inbound pitches per day.\n“I have a permanent out of office email message set up that will reply back to every message with instructions on how the founders can engage with our investment team via our website form,” he told TechCrunch. “Our team takes every submission seriously, but I just can’t respond to every email solicitation any longer, as much as I’d like to.”\nNow, if he has already taken a meeting with a founder, Bahn claims he will “never ghost” them.\n“When I have to pass on a deal, I will explain why I am passing and share some feedback,” he said. “This is a simple etiquette that I wish more VCs would do more consistently as well.”\nIronically, one investor who wished to not be named cited frustration with AI-generated founder cold outreach, telling TechCrunch: “It’s so much that it’s drowning out all the genuine outreach. I can tell it’s AI-generated because I get dozens with the same structure, but different words and there are always some weird inaccuracies. It’s just going to burn all written outreach as a channel to reach new people.”\nSo, while VCs may love to back AI startups these days, many of which write emails, they don’t want to be on the receiving end of them.\n“Eventually, we will just filter out any email from an unknown sender because it’s likely an AI-generated message,” she added. “So to meet someone new, you’ll literally need to run into them socially (warm intro or in person). Back to the stone ages!”\nOne thing that really annoys Bahn is a lack of self-awareness. Don’t try to claim that your startup has no competitors or faces no existential risks, for example.\nBahn typically asks founders during a pitch what could kill their businesses. A shocking number of founders will respond: nothing.\n“Anyone with simple self-awareness knows that absolutely is not true,” he said. “So many things can threaten their business: competitors outperforming; markets facing new compliance or regulation; a new pandemic.”\nAs a potential investor, Bahn wants to know that you not only see the risks, but have plans to mitigate them. “As the legendary CEO, Andy Grove of Intel, once said: only the paranoid survive,” he said.\nMohnot says if a founder can’t explain how they’ll grow their business beyond an initial concept, he takes note. But the reverse is also true: Unrealistic expectations is a red flag, noting he’s turned off by founders who claim their startup will “immediately disrupt an entire industry” or are projecting “wildly optimistic financial projections without solid evidence.”\nOther things that he finds to be a turnoff: visible tension or lack of complementary skills among founding team members, suggesting potential collaboration issues; lack of technical depth or an overemphasis on fundraising as opposed to “building a sustainable, valuable business.”\nRex Salisbury, founder and general partner of Cambrian Ventures and former partner at Andreessen Horowitz (a16z), wants to see that a founder is on top of things. He views a pitch deck with a date in the file name that is six months old as a red flag. Misrepresenting numbers, however, will get you cut off from Salisbury altogether.\nThere are other behaviors that will end your conversations with VCs. For Bahn, if a founder says something racist or sexist, they’re cut off.\n“A founder actually once called a competing founder the c-word in front of me,” he shared. “I have no tolerance to spend the next decade working with someone that has such little respect for other people.”\nFounders should also keep in mind that even if an investor rejects them now, they might consider working with them later. So being disrespectful when getting turned down will likely kill any chance of that, and could also cause the VC to never talk to a founder again.\nBahn says sometimes his firm provided detailed feedback on a rejection and then that founder would “turn around and call you names and/or even threaten you.” He notices this happens more to his female colleagues than to himself.\n“I’m grateful when those moments happen because it means we made the right choice to not choose to work with that founder,” Bahn told TechCrunch.\n“That person is also blacklisted — we will not respond to that person ever again, and the interaction will be recorded in our internal database, so that our institution can avoid them forever,” Bahn adds.\nAll of the VCs, naturally, said dishonesty is an instant deal killer. Addie Lerner Katz, founder and managing partner of Avid Ventures, pointed out that dishonesty can take place in a variety of forms, including exaggerations and a lack of transparency.\nShe’s also turned off when founders speak negatively of current or past investors or colleagues. Negative reference calls are another cause for pause for Lerner Katz.\n“Across each of these buckets, we take ‘yellow flags’ very seriously and usually view them as disqualifying,” she told TechCrunch.\nMohnot recalled an incident where a founder lied about a deal with another startup. The other startup happened to be in Mohnot’s portfolio “so a quick text message sorted that one out.”\nBut lying in general about metrics, team capabilities, market size or technology performance, will often also be easily exposed by the VC.\n“It happens more often than you think,” Mohnot said.\nAll of the VCs still think there’s no true excuse for not sending a simple, “no thank you” follow-up to a founder if they actually had a pitch meeting with a founder. As Bent put it, ghosting happens anyway.\n“I’m not saying any of these are good reasons. It’s the reality. It’s the game,” she wrote.\nBut given the risks of behaving badly to a VC who has stopped talking to you, she also suggests the golden rule applies to both parties. “Treat people how you want to be treated.”",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/podcast/is-silicon-valley-still-the-best-place-for-startups-insight-partners-ryan-hinkle-doesnt-think-so/",
        "date_extracted": "2025-03-14T13:24:28.572417",
        "title": "No Title Found",
        "author": null,
        "publication_date": null,
        "content": "“Silicon Valley is not a necessary and sufficient condition for success — it’s just one option,” saysRyan Hinkle, challenging the long-held belief that the Bay Area is the ultimate startup hub.\nHinkle is a managing director at Insight Partners, the giant New York-based venture capital firm that invests in tech worldwide. It has $90 billion in assets under management andjust raised a new $12.5 billion fund.\nToday onEquity, Julie Bort sits down with Hinkle to unpack the evolving landscape of startup ecosystems. They talk about the post-pandemic shift that saw many founders moving to cities like New York or Miami only for the rise of OpenAIand Cerebral Valleyand the accompanying AI boom to reignite San Francisco and Silicon Valley in general.\nWhile some founders saythat they are now relocating their companies to San Francisco, Hinkle disagrees with the necessity of doing so.\nHe concedes that the Valley offers an unmatched talent pool, but argues it also comes with steep costs and retention challenges, making it far from the only viable choice for startups.\nListen to the full episode to hear more about:\nEquity will be back on Friday with our weekly news roundup, so don’t miss it!\nEquity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. Subscribe to us onApple Podcasts,Overcast,Spotifyand all the casts. You also can follow Equity onXandThreads, at @EquityPod. For the full episode transcript, for those who prefer reading over listening, check out our full archive of episodeshere.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/05/growth-at-all-costs-is-destroying-the-internet-pr-maven-ed-zitron-says-thats-an-opportunity-for-startups/",
        "date_extracted": "2025-03-14T13:24:32.631292",
        "title": "Growth at all costs is destroying the internet. PR maven Ed Zitron says that’s an opportunity for startups.",
        "author": null,
        "publication_date": null,
        "content": "If you spend any amount of time online, you probably noticed that your user experience keeps getting worse.\nWebsites are waterlogged with autoplay ads, pop-ups, and tracking scripts. Customer service chatbots are useless, despite the promises of generative AI. Social media algorithms boost rage-bait to keep you scrolling and engaged. Dating apps hide all the good ones behind a paywall. Your printer won’t work without a monthly subscription. Oh, and good luck canceling that subscription in three clicks or less.\nThis is the backwash of the internet’s shift from a user-first experience to one designed to maximize engagement, ad revenue, and subscriptions.\nEd Zitron, CEO ofEZPRand host of the Better Offline podcast, calls it the “rot economy,” the result of “a tech industry that has become so obsessed with growth that you, the paying customer, are a nuisance to be mitigated far more than a participant in an exchange of value.”\nIn arecent episode of the Equity podcast, I spoke to Zitron — who is writing a book called “Why Everything Stopped Working” — about why the stagnation of major companies creates the perfect opportunity for startups to challenge incumbents across various industries.\nZitron didn’t hold back when describing Big Tech’s decline, criticizing its obsession with quarter-to-quarter growth that leads to subpar products: “They’re ugly, they’re expensive, they don’t work very well, you don’t like using them.” He argued that many of these dominant players have grown “fat and lazy” and “overconfident,” their business models based on the idea that “it’s just easier to stay with us.”\n“You can beat that,” Zitron said. “Anything you see on the web that sucks right now is at threat.”\nAs Zitron sees it, there are numerous areas that are ripe for disruption. One of the most obvious is social media, where he notes that “to use Instagram right now is to fight Meta to get to the things you want” and get past what Meta wants you to see. “And Facebook is even worse,” he laments.\nThis crummy user experience, combined with the political maneuverings on Elon Musk and Mark Zuckerberg, is why we’re seeing peopledefectfromXandMetaand sign up for platforms on the decentralized web, which is a system of independent, privately owned servers that work together to provide private and secure access to information and services.\nBlueskyandMastodonhave emerged as popular alternatives to X, and many startups are throwing their hats in the ring to challenge Instagram and TikTok. In the decentralized space, Bluesky is launching aphoto-sharing app called Flashes, andPixelfedis already attracting users. Many TikTok users havedownloaded RedNoteas the ByteDance-owned app remains in limbo.\nZitron similarly sees massive opportunities when it comes to enterprise and productivity offerings like Microsoft 365 that aren’t “great.”\nZitron said of Microsoft broadly, “They don’t make great products. They haven’t in some time.” Here, he added that he would “maybe put the gaming [division] aside” from this complaint. “I quite like the Xbox division,” he said. Then he added: “But they love laying people off and I’m sure that that place is going to slop soon.”\nBut it’s not just Microsoft. Zitron argued that many once-beloved Silicon Valley darlings — like Microsoft, Salesforce, Dropbox, and Zoom — lost their way after going public. The pressure to deliver quarter-over-quarter growth to appease shareholders invariably forces companies to prioritize short-term gains over long-term product quality.\nHe pointed to Google Docs as an example of growing corporate overreach designed to benefit a company at its users’ expense.\n“Google Docs was beloved for being this really clean, easy-to-use thing,” Zitron said. “The problem is now it’s telling me that it needs AI. I must use Gemini in it now.”\nZitron called Adobe “the weakest company in tech” at the moment, calling them “desperate” and calling for a replacement. Some potential challengers we’ve seen include Figma, Affinity, and Blender.\nGenerally, Zitron thinks consumers will have a role to play in this shift as they cotton onto the self-serving “laziness” of incumbents.\n“I believe in the next year, we’re going to see a real shift in consumers, both business and otherwise, away from these shitty companies. And when I say shitty companies, I mean most of Big Tech.”\nGoogle in particular is already facing an assault by numerous startups, and deservedly so in Zitron’s mind. Google Search used to surface the best links for your query. Now it surfaces a page of sponsored links that don’t answer your question.\n“Google search is bad now,” he said, noting that DuckDuckGo “apparently makes money” and may be able to rise if the judge inGoogle’s search antitrust trialforces the company to share its datasets with competitors.\nZitron didn’t list all the other search competitors, but it’s worth mentioning a few. Perplexity, for example, is competing with chatbot-style search that answers questions directly in a conversational way while citing resources.Diem is a female-focused social search enginewith an AI chatbot that’s fighting against data bias in a world designed for men. In the decentralized space, Marginalia Search boosts obscure, non-commercial sites rather than SEO-optimized junk, while OpenSearch is an independent, crawler-based engine.\nFor users who prioritize not just a better search experience but also a more privacy-focused search, there’s Kagi, a paid, private search engine with a focus on high-quality results and no ads.\nThere’s also Brave Search, a fully independent search index that doesn’t rely on Google or Bing. Brave also has a privacy-focused browser that blocks ads and trackers by default.\nZitron believes email is another area that a startup could “take on.” While email is one of the dominant communication tools, most of our inboxes are cluttered with spam and disorganized due to clunky UX from giants like Outlook, Gmail, and Yahoo. The same is true for enterprise email, like Microsoft Exchange and Google Workspace.\nThere are plenty of opportunities for disruption here, notes Zitron. He says an offering from the end-to-end encrypted email service Proton “isn’t as usable as it needs to be,” but it’s not the only game in town (rival services include Tutanota and Skiff). At the same time, increasingly popular alternatives Superhuman, Hey, and Shortwave are trying to rethink user experience in email.\nZitron sees opportunities for disruption everywhere, and not just in a purely digital sense. He also sees an opportunity for startups to take on Amazon’s shipping and logistics business by “creating a coalition of other companies with smaller businesses — a Shopify for the delivery side.”\nWhether it’s coming up with a new real estate technology to replace the “fat and happy” Zillows of the world, or a better version of Canva that’s not bloated with AI offerings, Zitron has called for a fresh take on the venture capital model. He says VC has too long focused on growth at all costs, which has created astranded generationof startups that raised too much money — and have nowhere to go as a result.\nZitron’s PR business is to draw attention to startups, so it’s in his interests to underscore the many shortcomings of Big Tech in comparison. Still, it was an inspiring chat.\nIf you’re hankering for a better user experience, or you’re working on something to take down the bigs, you’ll definitely enjoy it. Check out our chathere.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/podcast/can-kevin-rose-and-alexis-ohanian-bring-digg-back/",
        "date_extracted": "2025-03-14T13:24:35.738177",
        "title": "No Title Found",
        "author": null,
        "publication_date": null,
        "content": "In this week’s episode of StrictlyVC Download, TechCrunch Editor in Chief Connie Loizos is joined by Kevin Rose, who foundedDigg. The news aggregator changed the way people engaged with the news back in 2004 and it’s apparently coming back. Kevin joined forces with Alexis Ohanian — his former rival and the co-founder of Reddit — and Digg’s new CEO Justin Mezzell to relaunch Digg for a completely new and expanded audience. In this conversation, Rose shares the story behind repurchasing Digg, why now is the perfect moment for a comeback, and how AI will play a key role in moderating and enhancing online discourse.\nStrictlyVC Download posts every Tuesday. Subscribe onApple,Spotify,orwherever you listen to podcaststo be alerted when new episodes drop.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/04/loftyinc-capital-launches-third-fund-for-seed-and-series-a/",
        "date_extracted": "2025-03-14T13:24:38.602599",
        "title": "African VC LoftyInc Capital launches third fund for seed and Series A, reaches $43M first close",
        "author": null,
        "publication_date": null,
        "content": "One of Africa’s most active investors, known for early bets on unicorns likeFlutterwave,Andela, andWave, has secured fresh capital to invest in startups across the continent. This comes as funding deals and volumes in Africa saw only a slight dip last year, according to areportby VC firm Partech.\nLoftyInc Capital, which primarily backed startups at the pre-seed and seed stages for over a decade, has reached the first close of its third fund, LoftyInc Alpha, at $43 million.\nUnlike its earlier focus, this fund will target late-seed and Series A startups while retaining its geographical focus across Nigeria, Egypt, Kenya, and Francophone Africa, founder and managing partnerIdris Ayo Bellotold TechCrunch.\nThe first close attracted a diverse group of limited partners, including sovereign wealth funds from the Middle East and Africa, such as Egypt’s MSMEDA and Tunisia’s Anava Fund of Funds. Development finance institutions like FMO, Proparco (FISEA), AfricaGrow, IFC, and the U.S.-based First Close Partners also participated, alongside African high-net-worth individuals (HNIs) and European family offices.\nBello, who launched LoftyInc’s first investment vehicle in 2012, is one of the few investors to have witnessed Africa’s tech evolution firsthand. His firm has backed startups through various phases, from startup diversification beyond fintech and the rise of tech talent to the unicorn boom of 2021 and the current funding slowdown.\nThe pre-seed vehicle, run by an angel network that has since grown into a self-sustaining community of 250+ investors across Africa and the diaspora, laid the foundation for LoftyInc’s first structured venture fund five years later.\nIn 2017, the Lagos-based venture capital firm raised its first institutional fund at $1.1 million, exclusively from HNIs and fully deployed in Nigeria. Bello, who launched the fund withMarsha WulffandMichael Oluwagbemi, said it delivered a 5.7x DPI (cash return) to its investors, driven by exits and secondaries from Flutterwave and General Atlantic-backed health tech startupReliance Health.\nBy 2021, LoftyInc launched its second VC fund, initiallytargeting $10 millionbut closing at $14.2 million. This second fund expanded beyond its market scope outside Nigeria and took a pan-African approach, investing in startups across Egypt, South Africa, and Francophone Africa—markets where LoftyInc aims to remain active.\nAmong its investors was Meta,through its NPE team, marking the tech giant’s first and only investment in an African VC.\nWith its third fund, LoftyInc is refining its investment strategy to tackle a significant challenge in Africa’s startup ecosystem: the low graduation rate from pre-seed to Series A. Africa’s VC landscape saw the steepest average ticket sizes decline at Series A (-18%) and Series B (-27%) last year, per the Partech report.\nBello notes that while LoftyInc’s angel networks and micro funds have helped cover pre-seed and seed rounds, the real funding gap emerges at the late-seed stage, where startups need structured support to scale and secure Series A capital.\n“At pre-seed and seed, there’s a lot of hype, but by Series A, the questions investors ask are very different,” he said. “Our goal is to come in at seed, but our mandate is to help you get to Series A. We want to be the firm that gets startups over that hump.”\nPositioning startups for Series A rounds where it plans to make follow-on investments and bring in co-investors will also strengthen the pipeline “opportunistically” for top-tier African investors at the Series A and growth stages, such asTLcom Capital,Partech, andNorrsken22.\nBello says LoftyInc differentiates itself in the crowded early-stage investment market in Africa by leveraging its partners’ operational expertise and networks. With over 200 investments and 14 exits, the managing partner posits that the firm provides more than capital, offering market access, business development support, and investor matchmaking to its portfolio companies.\nLoftyInc has expanded its leadership team with its latest fund to keep up with its evolving strategy and growing portfolio, an important move for regional expertise and execution as it invests in startups that require localized support.\nOver the past two years, the firm addedMariam KamelandKevin Simmonsas general partners. They will apply their investment banking, angel investing, and operational VC experience across the Middle East and Africa to help deepen the firm’s presence in Africa’s east, north, and Francophone regions (where at least 30% of the fund will be deployed).\n“They bring in fund and investor experience, which ties into our geographical expansion and exit plans,” Bello said, adding that Oluwagbemi and Wulff will continue managing LoftyInc’s previous funds while supporting the transition into this larger, more structured fund.\nLoftyInc Alpha says it’s backing innovations that drive Africa’s “everyday economy.” Most of that will revolve around financial services, which remains the most dominant sector in African tech, accounting for 60% of theover $2 billion in equity dealsstartups raised last year; logistics and transport; health tech; retail; climate; and deep tech and AI where they apply as enablers across the other sectors.\nBello says the fund plans to invest in 20-25 companies, with initial checks averaging $1 million and follow-ons up to $5 million.\nThe firm’s portfolio spans notable startups, including Uber-backed vehicle financing platformMoove, Egypt’s Robinhood-style trading appThndr, and African B2B e-commerce platformOmniRetail.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/04/foundation-capital-an-early-backer-of-solana-and-cerebras-raises-600m-fund/",
        "date_extracted": "2025-03-14T13:24:41.485444",
        "title": "Foundation Capital, an early backer of Solana and Cerebras, raises $600M fund",
        "author": null,
        "publication_date": null,
        "content": "Foundation Capitalhas come a long way since it was forced to scale down its fund size from $750 million in 2008 to$282 million (its sixth main fund)in 2013.\nOn Tuesday, the 30-year-old firm announced that it raised a $600 million eleventh flagship fund, which is 20% larger than the predecessor$500 million fundit closed about three years ago.\nFoundation credits its revival with sticking to its knitting: seed-stage investing.\n“Most firms that have been around for 30 years have typically gone multi-stage, multi-geography, multi-strategy. We instead have stayed very focused on the early stage,” general partner Steve Vassallo told TechCrunch.\nFoundation is the first institutional investor in over 70% of its portfolio companies.\n“We look for what I call ‘$0 billion’ markets in enterprise, AI, fintech and crypto,” Vassallo said. “These are markets that don’t even exist until founders will them into being.”\nHe explained that when Cerebras launched in 2016, from Foundation Capital’s office, the AI chip market was virtually nonexistent. “At that time, AI workloads were minuscule,” Vassallo explained, adding that Nvidia’s GPUs were used mainly by gamers and graphic designers.\nSince then, Cerebras has grown into a company valued at $4.25 billion. The company filed a public S-1 last fall butpostponed its IPOprimarily due to a review by the Committee on Foreign Investment in the United States (CFIUS).\nFoundation Capital was also the first institutional investor in the blockchain platform Solana.\nVassallo compared how they look for founders to the pre-criminals in the movie Minority Report. “We sometimes joke about identifying pre-founders before they’ve even left their last job,” he said.\nFoundation claims that by creating new markets, the firm’s winning investments end up “owning their categories,” leading to exponentially better outcomes.\nVassallo attributed the firm’s ability to raise a larger fund than its predecessorin this marketto the firm’s history of high cash distributions.\n“We gave roughly $1.4 billion back to our LPs over the last three years,” Vassallo said, adding that that amount is over three times what the firm called (or requested) from its investors during the period.\nRecent exits that helped to drive the firm’s cash returns include the sale of fraud detection companyEvolutionIQ to CCC for $730 millionand the acquisition of cybersecurity startupVenafi by CyberArk for $1.5 billion.\nAlthough Foundation is firmly sticking to its early-stage strategy, it claims it needs a larger fund because the size of seed and Series A deals has grown, and the firm wants to continue to own 15% to 20% of each company when it first invests.\nBut one thing about Foundation is different now. Charles Moldow, an investor who spent nearly 20 years at the firm and backed companies like LendingClub, Rappi, and Kiavi, retired last year, leaving Foundation with four general partners.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/04/funding-to-women-founded-startups-declined-12-in-2024-but-that-wasnt-far-behind-the-broader-market/",
        "date_extracted": "2025-03-14T13:24:45.061789",
        "title": "The decline in funding has hit male and female-led startups equally, but women out-raise men in DeepTech",
        "author": null,
        "publication_date": null,
        "content": "Venture investment in startups run by women has always lagged behind the overall market. But the data tells a different tale for 2024 — at least according to a new report unveiled this week in London by European venture platformFemale Foundry: Venture investment to startups founded by women in Europe declined 12% in 2024 from a year earlier, but that was nearly in line with the 11% decrease in overall venture investment.\nNotably, women who founded deep tech startups are raising more than men in that area. The report, dubbedFemale Innovation Index 2025, found that the number of female founders in deep tech is increasing thanks to that sector’s links to academia, where women tend to be more equally represented. About 33% of all venture capital raised by female entrepreneurs in Europe is going into deep tech startups — 2% more than gender-agnostic startups. Key areas of innovation include synthetic biology, generative AI, and drug development.\nFor the report, Female Foundry surveyed more than 1,200 female founders, investors, and executives, and over 35 private equity firms, venture associations, and ecosystem players across 20 European countries. It’s worth noting here that Female Founders counted startups that had at least one female co-founder, which greatly increases the sample size of startups considered in this report, compared to other reports that only refer to all-women founding teams when they say “female-founded startups.”\nSeveral surveys last year generally agreed that women founders continued to be vastly outnumbered by men, with all-women founding teamsraising only 2.2% of the venture capitalallocated for 2024.\n“I started the index because I realized that the oft-quoted 2% figure about the number of female-founded startups is not detailed enough,”Agata Nowicka, founder ofFemale Foundryand the author of the report, told TechCrunch. “I would not have been included in that stat, because as an entrepreneur, I had a male co-founder. We should be taking into account far more diverse metrics.\nThat deep tech metric is heartening, but Nowicka thinks women in academic environments need to be encouraged more to take up entrepreneurship. “There is still a little bit of stigma attached to entering a startup from academia,” she said.\nShe noted that the COVID-19 pandemic had helped create a more level playing field for women in tech because the wider industry had been forced to open up.\n“As a founder in 2016, most VCs didn’t even have a website or had just a landing page. Many events were held privately,” she said. “The venture capital industry transformed during COVID because of the boom in investment during 2021-2022. VC became overall more accessible to women […] because they needed deal-flow, and it became more competitive.”\nHere are a few interesting nuggets from the report:",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/03/general-catalyst-loses-three-top-investors-as-the-firm-expands-beyond-venture-contemplates-ipo/",
        "date_extracted": "2025-03-14T13:24:47.857842",
        "title": "General Catalyst loses three top investors as the firm expands beyond venture, contemplates IPO",
        "author": null,
        "publication_date": null,
        "content": "Three key investors have left General Catalyst amidst a series of recent changes at the firm, which now describes itself as an “investment and transformation company,” TechCrunch has learned.\nThe departed managing directors include Deep Nishar and Kyle Doherty, who co-led General Catalyst’s late-stage strategy known as Endurance, and Adam Valkin, one of the three leads of the firm’s early-stage fund, according to multiple people close to General Catalyst.\nNishar, Doherty, and Valkin didn’t respond to requests for comment. General Catalyst declined to comment.\nWhile the reasons for the departures remain unclear, a General Catalyst limited partner described a number of other changes among the leadership at the company.\nFollowing its October 2023 merger withEuropean early-stage firm La Famiglia, General Catalyst appointed Jeannette zu Fürstenberg, La Famiglia’s founder, as one of its top most senior partners, according to the LP. About six months later, General Catalystacquired Indian VC firm Venture Highway, placing its founder, Neeraj Arora, also among the top most senior investors at the firm, the LP added.\nIndividuals close to General Catalyst have also said that the firm’s strategic shift beyond venture has influenced how investors are compensated. General Catalyst has shifted its compensation structure to favor cash bonuses over equity, these people said.\nDeep Nishar, a former LinkedIn executive,joined General Catalyst from SoftBank’sVision Fund in 2021. While at SoftBank, Nishar led deals into Slack and 10x Genomics.\nKyle Doherty joined General Catalyst in 2017 after spending five years as head of private investments at Coatue. Doherty’s investments include digital bankingstartup Stepand insurance companyEthos. He departed General Catalyst in July, according tohis LinkedIn.\nMeanwhile, Valkin began his tenure with the firm in 2013. Valkin serves on the board of Rapyd, a fintech startup reportedly raising capital at a steepvaluation drop of $3.5 billion, and Shift Technology, a fintech that last raised funding in 2021 at a valuation of over$1 billion. He also backed ClassPass, which wasacquired by MindBodyin 2021.\nThe departures come at a time when General Catalyst, which manages $32 billion in assets, is evolving from a partnership-model firm into a company and adding non-venture strategies such as a wealth management business and buying a hospital system in Ohio.\nThe firm has been long rumored to desire becoming a public company. In recent weeks, multiple people have told TechCrunch that the firm is getting closer to contemplating an IPO. Axios reported on Friday that General Catalyst is in the “very early stagesof considering” a public offering.",
        "tags": [],
        "images": []
    },
    {
        "category": "Venture",
        "url": "https://techcrunch.com/2025/03/02/last-chance-last-24-hours-to-save-up-to-325-on-techcrunch-sessions-ai/",
        "date_extracted": "2025-03-14T13:24:50.679705",
        "title": "Last chance! Last 24 hours to save up to $325 on TechCrunch Sessions: AI",
        "author": null,
        "publication_date": null,
        "content": "Tonight is the night and the clock is winding down to register forTechCrunch Sessions: AIat our Super Early Bird pricing. Register before 11:59 p.m. PT so you can save up to $325 on passes!\nTC Sessions: AI will bring you invaluable insights into the cutting-edge and ever-evolving world of AI through expert-led main stage sessions with AI pioneers, hands-on demos in the Expo Hall, interactive breakouts, and unparalleled networking opportunities. Whether you’re an experienced AI whiz or you just want to know about the world of AI, join us for a jam-packed day to remember on June 5 in Zellerbach Hall at UC Berkeley.\nRegister by tonight before 11:59 p.m. PT to save up to $325!\nLeaders and shakers in the AI industry will join TC Sessions: AI to share their invaluable insights on the main stage. Here’s a small preview of who you’ll be able to learn from at the event.\nAs the co-founder and CEO ofTwelve Labs, Jae Lee is on a mission to transform how developers and enterprises analyze and understand massive video corpora. Lee leads the development of advanced multimodal foundation models, with aims of pushing the boundaries of AI-powered video intelligence.\nJae will take the main stage alongside Sara Hooker, VP of Research at Cohere, to discuss “How Founders Can Build on Existing Foundational Models.”\nOliver Cameron is looking at the next frontier of artificial intelligence at his AI startupOdyssey. Odyssey is pioneering “world models” able to generate “cinematic, interactive worlds in real time.” Before Odyssey, Cameron was co-founder and CEO of the autonomous vehicle startup Voyage.\nCameron joins TC Sessions: AI for a main stage talk about howsmall companies can compete against established onesin the fast-paced and rapidly changing AI market.\nKanu Gulati has spent her career pushing the boundaries of AI and innovation, whether it be in a research lab or as a VC. As a partner atKhosla Ventures, Gulati invests in transformative AI, robotics, and autonomous systems and has backed companies like PolyAI, Regie, and Waabi. Gulati previously spent more than a decade as a scientist at Intel and Cadence and was the co-founder of multiple startups, two of which were acquired.\nKanu will join Jill Chase, a partner at CapitalG, for an in-depth discussion on “From Seed to Series C: What VCs Expect from Founders.”\nAs the leader of AI safety atElevenLabs, Artemis is dedicated to building responsible AI systems. Prior to this, she guided OpenAI’s efforts to ensure the safe deployment of its models and spearheaded Meta’s global response to geopolitical and adversarial threats. With a PhD in political science and a JD from Stanford, her career spans management consulting, international policy, legal frameworks, and civil society.\nAs investment partner atCapitalG, Jill Chase leads the AI investing practice for Alphabet’s independent growth fund. With a background working alongside senior Googlers and AI experts, she has refined her AI/ML investment thesis and worked with leading founders and technologists in the space.\nJill has spearheaded investments in Magic, /dev/agents, and Motif at CapitalG. She also lectures at the Stanford Graduate School of Business, has served as CEO of a private equity-backed company, and founded a Y Combinator-backed startup.\nJill and Kanu will take the stage together for a deep dive into “From Seed to Series C: What VCs Expect from Founders.”\nAs the leader ofCoherefor AI, Sara Hooker drives cutting-edge research in machine learning, tackling complex challenges and pushing the boundaries of AI. Before joining Cohere, she made significant contributions at Google Brain, focusing on efficient model training and multi-criteria optimization. Her work ensures that AI models are not only powerful but also interpretable, efficient, fair, and robust. At Cohere, she leads a team dedicated to making large language models more efficient, safe, and well-grounded. A PhD graduate from Mila AI Institute, she co-founded the Trustworthy ML Initiative and advises organizations like Kaggle and the World Economic Forum. In 2024, TIME recognized her among the 100 Most Influential People in AI.\nWant to join in on the action? If you’re an AI expert who can have insightful discussions with innovators and entrepreneurs, we want to see you at TechCrunch Sessions: AI!Apply here by March 7for a chance to help develop the minds of future AI leaders with your expertise.\nIf you’re ready to take the plunge to learn from — and network with — AI experts,register for TechCrunch Sessions: AI now to secure your spot, and save at least $300.Be warned, prices will be raised after 11:59 p.m. PT tonight.\nWant more deals and promotions to TechCrunch events like this?Subscribe to our TechCrunch Events newsletterand you’ll be the first to know when they happen.\nAre you an AI expert who can drive powerful discussions with tech innovators and entrepreneurs? We want to hear from you!Apply by March 7for a chance to share your expertise and shape the future of the AI community.\nIs your company interested in sponsoring or exhibiting at TechCrunch Sessions: AI? Contact our sponsorship sales team byfilling out this form.",
        "tags": [],
        "images": [
            "https://techcrunch.com/wp-content/uploads/2025/02/Jae-Lee-Headshot-1080x1080-1.png?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/02/Oliver-cameron-headshot-1080x1080-1.png?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/02/Kanu-Gulati-khosla-ventures_Headshot_1080x1080.png?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/03/Artemis-Seaford_headshot.png?w=511",
            "https://techcrunch.com/wp-content/uploads/2025/02/Jill-Chase-headshot-1080x1080-1.png?w=680",
            "https://techcrunch.com/wp-content/uploads/2025/03/Sara-Hooker_headshot.jpg?w=510"
        ]
    }
]